{"pageProps":{"post":{"title":"AI, 한 분당 환각이 생겨나네요","description":"","date":"2024-05-17 22:15","slug":"2024-05-17-AIASuckerBornEveryMinute","content":"\n\n**AI 제품의 탈을 쓴 특별혜택**\n\n<img src=\"/assets/img/2024-05-17-AIASuckerBornEveryMinute_0.png\" />\n\n지난 십 년 동안 숨 쉬어온 여러분은 이미 알고 계실 것입니다. 수많은 Techbro Barnums이 끊임없는 풍년을 약속하며 다가오는 부를, 대규모 생산성 향상을, 그리고 다음으로 큰 혜택을 가져다줄 일에 투자하라는 이야기를 하는 것을. 이는 법인 투자자들이 이미 최신과 최고의 사기를 위해 대단한 금전과 명성을 투입한 후에 벌어진 일입니다! 지금 당장 오셔요! 뒤처지지 마세요! 작은 저축, 한 푼짜리, 저렴한 구독금만으로 당신도 다음 아마존! 다음 구글!의 일원이 될 수 있습니다! 그러나 Juicero, Soylent, 또는 Theranos에 대한 소식을 듣기도 전에 다른 이들은 이미 부를 쌓고, 혹시 지금 행동을 취한다면 당신도 적은 비용으로 일컬매 진흙을 챙겨갈 수 있을지도 모릅니다. 이는 NFT, 암호화폐, 웹 3.0, VR 헤드셋, 메타버스에도 동일하게 적용됩니다. 이 사기들 중 어디에는 좋은 의도와 긍정적인 아이디어의 작은 씨앗이 없었다고 말하고 싶진 않습니다. 혁신 기업들이 모두 후퇴할 때, 빛나는 오브젝트로 움직일 때, 이러한 사기 중 일부는 안정화되며 비즈니스가 변화하고 여러 소비자에게 어떤 요긴함을 가져다줄 수도 있습니다. 그러나 현대 비즈니스 모델의 수명주기에서 그런 단계가 이루어질 때까지, 대중은 자신의 집단 정신을 잃고 돈, 시간, 자원을 \"튤립 매니아 3.0\"에 들이붓습니다.\n\n그렇게 우리가 현재 직면한 패러다임 변화 사기, 인공지능에 대해 이야기해보겠습니다. 저는 이전에 언급된 수많은 유행들보다 이것이 훨씬 해로운 것으로 생각합니다. 이 제품은 사람들의 업무 생활의 모든 부분에 뿌리를 내리고 있는데, 이는 위험한 일입니다. 다른 속임들은 항상 너무 복잡하고 궁극적인 멀리에 있다는 느낌을 주었고, 당신이 위험에 처하려면 약간의 지식이 필요했습니다. 그러나 AI는 일반 업무일의 끝없는 단조로움에 대한 해독제로 약속되고 있습니다. AI는 대신 글을 쓰거나 디자인을 하거나 메모를 남기거나 작업을 편집하거나 일을 수행하거나 버튼 하나만으로 시대의 경이로운 것을 그려줄 것입니다. 그러나 이 모든 일을 잘 처리하지 못합니다. 그들은 아직 잘하지 않는다고 말합니다. 그러나 시간을 주면, 그것이 인터넷을 긁고, 당신의 하드 드라이브나 개인, 기업 데이터, 세계의 거대한 라이브러리를 살펴볼 것입니다. 삶을 더 쉽게 만들 것이라고 약속합니다. 그냥 우리가 들어와서 __주변을 둘러보게 허용해주세요__. 이상한 일을 하지는 않을 것이라고 약속합니다. 혹은 불법적이거나 기도하지 않습니다. 그저 우리가 할 수 있는 일을 허락해주십시오. 그 일의 일부는 다른 사람들의 정보와 창의력을 훔치는 것일 수 있지만, 당신의 삶은 훨씬 더 쉬워질 것입니다.\n\nAI의 과대 약속에 대항하는 많은 사람들이 있습니다. 그러나 이미 너무 늦은 것이 아닐까 우려스럽습니다. 매 순간 사회 전반에 이를 올려놓고 있는 것이 다양한 방식으로 우리에게 밀어붙이고 있습니다. AI는 먼저 작가들, 아티스트들, 디자이너들, 일러스트레이터들을 위해 왔습니다. 그들은 반격했지만, AI의 해일은 너무 강력했습니다. 벌금을 벌어들일 수 있는 돈이 너무 많았으며, 쥐어 질 수 있는 시장 점유율이 너무 컸습니다. 이제 당신의 고객들은 쉽사리 AI를 사용하기를 제안하고, 다음에는 AI를 요구할 것입니다. AI는 곧 당신의 직장으로 올 것입니다, 당신이 그것을 좋아하든 말든 헤. 당신이 현재까지 아주 편안하게 사용해오던 제품, 원래 개발된 업무를 위해 완벽하게 작동했던 제품? 그 이제 그것에 AI를 밀어 넣었습니다! 이제 그 구식 제품이 원하지 않는 작업을 수행하는 것을 지켜보세요. 그것이 당신을 오도하거나 해롭게 만들기까지, 모든 것을 다시 시작하게 하기까지, 단순 대화 봇이 말한 것을 다시 확인하기 위해 두 번 세 번 확인하기까지, 인터넷에서 정확한 답을 헤매는 모습을 지켜보세요. 그러나 AI가 이미 통합된 당신의 믿을 수 있는 검색엔진으로 인해, 보다수익성이 알 수 없을 것입니다. 상품 가격이 AI로 인해 오르기 시작하며, 당신의 옆집 책상이 상사가 AI를 통해 노동력을 줄이기를 원하기 때문에 비어나가는 것을 지켜보세요. 당신이 자리를 걱정하기 시작할 때, 당신의 매니저가 프로젝트에 AI를 사용하도록 지시하는 것을 듣게될 때, 우리가 새로운 것을 구독했으니, AI를 사용해달라고 말할 때 지켜보세요!\n\n<div class=\"content-ad\"></div>\n\n한 번 오십센트만 내시면, 이 게임이 어떻게 흔들리고 흔듭니다! 여러분이 산업을 조기 포장하면서 일자리가 어디로 사라갔는지, 얼마나 쉬워진 삶을 즐기는지 궁금해하며, 시대의 놀라움을 경이롭게 생각해보세요.","ogImage":{"url":"/assets/img/2024-05-17-AIASuckerBornEveryMinute_0.png"},"coverImage":"/assets/img/2024-05-17-AIASuckerBornEveryMinute_0.png","tag":["Tech"],"readingTime":3},"content":"<!doctype html>\n<html lang=\"en\">\n<head>\n<meta charset=\"utf-8\">\n<meta content=\"width=device-width, initial-scale=1\" name=\"viewport\">\n</head>\n<body>\n<p><strong>AI 제품의 탈을 쓴 특별혜택</strong></p>\n<p>지난 십 년 동안 숨 쉬어온 여러분은 이미 알고 계실 것입니다. 수많은 Techbro Barnums이 끊임없는 풍년을 약속하며 다가오는 부를, 대규모 생산성 향상을, 그리고 다음으로 큰 혜택을 가져다줄 일에 투자하라는 이야기를 하는 것을. 이는 법인 투자자들이 이미 최신과 최고의 사기를 위해 대단한 금전과 명성을 투입한 후에 벌어진 일입니다! 지금 당장 오셔요! 뒤처지지 마세요! 작은 저축, 한 푼짜리, 저렴한 구독금만으로 당신도 다음 아마존! 다음 구글!의 일원이 될 수 있습니다! 그러나 Juicero, Soylent, 또는 Theranos에 대한 소식을 듣기도 전에 다른 이들은 이미 부를 쌓고, 혹시 지금 행동을 취한다면 당신도 적은 비용으로 일컬매 진흙을 챙겨갈 수 있을지도 모릅니다. 이는 NFT, 암호화폐, 웹 3.0, VR 헤드셋, 메타버스에도 동일하게 적용됩니다. 이 사기들 중 어디에는 좋은 의도와 긍정적인 아이디어의 작은 씨앗이 없었다고 말하고 싶진 않습니다. 혁신 기업들이 모두 후퇴할 때, 빛나는 오브젝트로 움직일 때, 이러한 사기 중 일부는 안정화되며 비즈니스가 변화하고 여러 소비자에게 어떤 요긴함을 가져다줄 수도 있습니다. 그러나 현대 비즈니스 모델의 수명주기에서 그런 단계가 이루어질 때까지, 대중은 자신의 집단 정신을 잃고 돈, 시간, 자원을 \"튤립 매니아 3.0\"에 들이붓습니다.</p>\n<p>그렇게 우리가 현재 직면한 패러다임 변화 사기, 인공지능에 대해 이야기해보겠습니다. 저는 이전에 언급된 수많은 유행들보다 이것이 훨씬 해로운 것으로 생각합니다. 이 제품은 사람들의 업무 생활의 모든 부분에 뿌리를 내리고 있는데, 이는 위험한 일입니다. 다른 속임들은 항상 너무 복잡하고 궁극적인 멀리에 있다는 느낌을 주었고, 당신이 위험에 처하려면 약간의 지식이 필요했습니다. 그러나 AI는 일반 업무일의 끝없는 단조로움에 대한 해독제로 약속되고 있습니다. AI는 대신 글을 쓰거나 디자인을 하거나 메모를 남기거나 작업을 편집하거나 일을 수행하거나 버튼 하나만으로 시대의 경이로운 것을 그려줄 것입니다. 그러나 이 모든 일을 잘 처리하지 못합니다. 그들은 아직 잘하지 않는다고 말합니다. 그러나 시간을 주면, 그것이 인터넷을 긁고, 당신의 하드 드라이브나 개인, 기업 데이터, 세계의 거대한 라이브러리를 살펴볼 것입니다. 삶을 더 쉽게 만들 것이라고 약속합니다. 그냥 우리가 들어와서 <strong>주변을 둘러보게 허용해주세요</strong>. 이상한 일을 하지는 않을 것이라고 약속합니다. 혹은 불법적이거나 기도하지 않습니다. 그저 우리가 할 수 있는 일을 허락해주십시오. 그 일의 일부는 다른 사람들의 정보와 창의력을 훔치는 것일 수 있지만, 당신의 삶은 훨씬 더 쉬워질 것입니다.</p>\n<p>AI의 과대 약속에 대항하는 많은 사람들이 있습니다. 그러나 이미 너무 늦은 것이 아닐까 우려스럽습니다. 매 순간 사회 전반에 이를 올려놓고 있는 것이 다양한 방식으로 우리에게 밀어붙이고 있습니다. AI는 먼저 작가들, 아티스트들, 디자이너들, 일러스트레이터들을 위해 왔습니다. 그들은 반격했지만, AI의 해일은 너무 강력했습니다. 벌금을 벌어들일 수 있는 돈이 너무 많았으며, 쥐어 질 수 있는 시장 점유율이 너무 컸습니다. 이제 당신의 고객들은 쉽사리 AI를 사용하기를 제안하고, 다음에는 AI를 요구할 것입니다. AI는 곧 당신의 직장으로 올 것입니다, 당신이 그것을 좋아하든 말든 헤. 당신이 현재까지 아주 편안하게 사용해오던 제품, 원래 개발된 업무를 위해 완벽하게 작동했던 제품? 그 이제 그것에 AI를 밀어 넣었습니다! 이제 그 구식 제품이 원하지 않는 작업을 수행하는 것을 지켜보세요. 그것이 당신을 오도하거나 해롭게 만들기까지, 모든 것을 다시 시작하게 하기까지, 단순 대화 봇이 말한 것을 다시 확인하기 위해 두 번 세 번 확인하기까지, 인터넷에서 정확한 답을 헤매는 모습을 지켜보세요. 그러나 AI가 이미 통합된 당신의 믿을 수 있는 검색엔진으로 인해, 보다수익성이 알 수 없을 것입니다. 상품 가격이 AI로 인해 오르기 시작하며, 당신의 옆집 책상이 상사가 AI를 통해 노동력을 줄이기를 원하기 때문에 비어나가는 것을 지켜보세요. 당신이 자리를 걱정하기 시작할 때, 당신의 매니저가 프로젝트에 AI를 사용하도록 지시하는 것을 듣게될 때, 우리가 새로운 것을 구독했으니, AI를 사용해달라고 말할 때 지켜보세요!</p>\n<p>한 번 오십센트만 내시면, 이 게임이 어떻게 흔들리고 흔듭니다! 여러분이 산업을 조기 포장하면서 일자리가 어디로 사라갔는지, 얼마나 쉬워진 삶을 즐기는지 궁금해하며, 시대의 놀라움을 경이롭게 생각해보세요.</p>\n</body>\n</html>\n"},"__N_SSG":true}