{"pageProps":{"posts":[{"title":"AI, 한 분당 환각이 생겨나네요","description":"","date":"2024-05-17 22:15","slug":"2024-05-17-AIASuckerBornEveryMinute","content":"\n\n**AI 제품의 탈을 쓴 특별혜택**\n\n<img src=\"/assets/img/2024-05-17-AIASuckerBornEveryMinute_0.png\" />\n\n지난 십 년 동안 숨 쉬어온 여러분은 이미 알고 계실 것입니다. 수많은 Techbro Barnums이 끊임없는 풍년을 약속하며 다가오는 부를, 대규모 생산성 향상을, 그리고 다음으로 큰 혜택을 가져다줄 일에 투자하라는 이야기를 하는 것을. 이는 법인 투자자들이 이미 최신과 최고의 사기를 위해 대단한 금전과 명성을 투입한 후에 벌어진 일입니다! 지금 당장 오셔요! 뒤처지지 마세요! 작은 저축, 한 푼짜리, 저렴한 구독금만으로 당신도 다음 아마존! 다음 구글!의 일원이 될 수 있습니다! 그러나 Juicero, Soylent, 또는 Theranos에 대한 소식을 듣기도 전에 다른 이들은 이미 부를 쌓고, 혹시 지금 행동을 취한다면 당신도 적은 비용으로 일컬매 진흙을 챙겨갈 수 있을지도 모릅니다. 이는 NFT, 암호화폐, 웹 3.0, VR 헤드셋, 메타버스에도 동일하게 적용됩니다. 이 사기들 중 어디에는 좋은 의도와 긍정적인 아이디어의 작은 씨앗이 없었다고 말하고 싶진 않습니다. 혁신 기업들이 모두 후퇴할 때, 빛나는 오브젝트로 움직일 때, 이러한 사기 중 일부는 안정화되며 비즈니스가 변화하고 여러 소비자에게 어떤 요긴함을 가져다줄 수도 있습니다. 그러나 현대 비즈니스 모델의 수명주기에서 그런 단계가 이루어질 때까지, 대중은 자신의 집단 정신을 잃고 돈, 시간, 자원을 \"튤립 매니아 3.0\"에 들이붓습니다.\n\n그렇게 우리가 현재 직면한 패러다임 변화 사기, 인공지능에 대해 이야기해보겠습니다. 저는 이전에 언급된 수많은 유행들보다 이것이 훨씬 해로운 것으로 생각합니다. 이 제품은 사람들의 업무 생활의 모든 부분에 뿌리를 내리고 있는데, 이는 위험한 일입니다. 다른 속임들은 항상 너무 복잡하고 궁극적인 멀리에 있다는 느낌을 주었고, 당신이 위험에 처하려면 약간의 지식이 필요했습니다. 그러나 AI는 일반 업무일의 끝없는 단조로움에 대한 해독제로 약속되고 있습니다. AI는 대신 글을 쓰거나 디자인을 하거나 메모를 남기거나 작업을 편집하거나 일을 수행하거나 버튼 하나만으로 시대의 경이로운 것을 그려줄 것입니다. 그러나 이 모든 일을 잘 처리하지 못합니다. 그들은 아직 잘하지 않는다고 말합니다. 그러나 시간을 주면, 그것이 인터넷을 긁고, 당신의 하드 드라이브나 개인, 기업 데이터, 세계의 거대한 라이브러리를 살펴볼 것입니다. 삶을 더 쉽게 만들 것이라고 약속합니다. 그냥 우리가 들어와서 __주변을 둘러보게 허용해주세요__. 이상한 일을 하지는 않을 것이라고 약속합니다. 혹은 불법적이거나 기도하지 않습니다. 그저 우리가 할 수 있는 일을 허락해주십시오. 그 일의 일부는 다른 사람들의 정보와 창의력을 훔치는 것일 수 있지만, 당신의 삶은 훨씬 더 쉬워질 것입니다.\n\nAI의 과대 약속에 대항하는 많은 사람들이 있습니다. 그러나 이미 너무 늦은 것이 아닐까 우려스럽습니다. 매 순간 사회 전반에 이를 올려놓고 있는 것이 다양한 방식으로 우리에게 밀어붙이고 있습니다. AI는 먼저 작가들, 아티스트들, 디자이너들, 일러스트레이터들을 위해 왔습니다. 그들은 반격했지만, AI의 해일은 너무 강력했습니다. 벌금을 벌어들일 수 있는 돈이 너무 많았으며, 쥐어 질 수 있는 시장 점유율이 너무 컸습니다. 이제 당신의 고객들은 쉽사리 AI를 사용하기를 제안하고, 다음에는 AI를 요구할 것입니다. AI는 곧 당신의 직장으로 올 것입니다, 당신이 그것을 좋아하든 말든 헤. 당신이 현재까지 아주 편안하게 사용해오던 제품, 원래 개발된 업무를 위해 완벽하게 작동했던 제품? 그 이제 그것에 AI를 밀어 넣었습니다! 이제 그 구식 제품이 원하지 않는 작업을 수행하는 것을 지켜보세요. 그것이 당신을 오도하거나 해롭게 만들기까지, 모든 것을 다시 시작하게 하기까지, 단순 대화 봇이 말한 것을 다시 확인하기 위해 두 번 세 번 확인하기까지, 인터넷에서 정확한 답을 헤매는 모습을 지켜보세요. 그러나 AI가 이미 통합된 당신의 믿을 수 있는 검색엔진으로 인해, 보다수익성이 알 수 없을 것입니다. 상품 가격이 AI로 인해 오르기 시작하며, 당신의 옆집 책상이 상사가 AI를 통해 노동력을 줄이기를 원하기 때문에 비어나가는 것을 지켜보세요. 당신이 자리를 걱정하기 시작할 때, 당신의 매니저가 프로젝트에 AI를 사용하도록 지시하는 것을 듣게될 때, 우리가 새로운 것을 구독했으니, AI를 사용해달라고 말할 때 지켜보세요!\n\n<div class=\"content-ad\"></div>\n\n한 번 오십센트만 내시면, 이 게임이 어떻게 흔들리고 흔듭니다! 여러분이 산업을 조기 포장하면서 일자리가 어디로 사라갔는지, 얼마나 쉬워진 삶을 즐기는지 궁금해하며, 시대의 놀라움을 경이롭게 생각해보세요.","ogImage":{"url":"/assets/img/2024-05-17-AIASuckerBornEveryMinute_0.png"},"coverImage":"/assets/img/2024-05-17-AIASuckerBornEveryMinute_0.png","tag":["Tech"],"readingTime":3},{"title":"지금은 진지하게 사용자와 경험에 대해 이야기할 때입니다","description":"","date":"2024-05-17 22:13","slug":"2024-05-17-ItsTimeWeSeriouslyTalkAboutUsersandExperiences","content":"\n<img src=\"/assets/img/2024-05-17-ItsTimeWeSeriouslyTalkAboutUsersandExperiences_0.png\" />\n\n이유를 알 수 없지만, UX 전문가들은 사용자나 경험에 대해 결코 이야기하지 않습니다. 이는 우리의 작업에 해를 끼칩니다.\n\n“하지만 나는 항상 내 사용자에 대해 이야기해.”\n\n확실히, 우리는 종종 “우리 사용자들은 최상의 사용자 경험을 받을 자격이 있다”고 말하지만, 그것이 부족한 것은 아니라고 생각합니다.\n\n<div class=\"content-ad\"></div>\n\n위 문제는 특정 사용자와 그들의 구체적인 경험에 대해 이야기하지 않았다는 것입니다. 사용자의 이름은 무엇인가요? 우리 제품이나 서비스가 사용자의 삶을 개선할 수 있는 일들이 있었나요? 그것이 여기서 이야기하고 싶은 구체성입니다.\n\n# UX 팀 구성원들 중 모두 한 명씩 사용자의 이름을 말할 수 있나요?\n\n지난 주, 저는 교사들을 위한 소프트웨어를 만드는 회사의 UX 팀 매니저와 대화를 나누었습니다. 그들이 생각하기에 교사들의 업무를 상당히 개선할 수 있는 놀라운 소프트웨어입니다.\n\n하지만 그 팀 매니저는 이 소프트웨어를 사용할 수 있는 교사 한 명을 제대로 소개할 수 없었습니다. 팀의 연구 노력이 미뤄지고 교사들을 거의 만나지 못했습니다. 매니저는 만난 교사 한 명의 이름도 알지 못했습니다.\n\n<div class=\"content-ad\"></div>\n\n대신, 이들은 현재 교사가 아니지만 예전에 교사였던 사람들, 이전 생애에 관리자로 일했던 사람들이나 교육 이론을 공부했던 사람들인 주제 전문가들(SMEs)에 의존했습니다. 그들은 매일 교사들이 직면하는 어려움은 없었지만 그 어려움이 무엇인지 알고 있다고 주장했습니다.\n\n이러한 SMEs는 정말로 지적이고 능력 있는 사람들이지만, 그들은 이 제품을 매일 사용할 교사들은 아닙니다. 아마 그들은 교사들이 필요로 하는 것을 알고 있을지도 모릅니다. 그러나 그들이 알지 못할 경우에는 어떨까요? 현재 교사들의 삶 속에서 무엇이 일어나는지 모르기 때문에 추측하는가 하면?\n\n우리는 사용자 중심 설계를 실천한다고 말합니다. 그런데 너무 자주, 우리는 어떤 사용자라도 한 명도 지칭할 수 없습니다.\n\n# 모든 UX 팀 구성원이 사용자 간의 차이점을 설명할 수 있을까요?\n\n<div class=\"content-ad\"></div>\n\n같은 학교에서도 모든 교사가 같지 않습니다. 같은 병원에서도 모든 의사가 같지 않습니다. 같은 보험 청구 조정자라도 같은 보험 청구 부서에서도 모두 같지 않습니다.\n\n그러나 우리는 종종 사용자에 대해 동일한 역할을 하는 사람들 사이에 의미 있는 차이가 없는 것처럼 이야기합니다. 저는 '교사'라는 이름의 교실 제품을 위해 단일 페르소나를 만들고 '학생'이라는 다른 페르소나를 만들려는 유혹이 있는 단순화된 방식에 비난을 받습니다.\n\n그러나 어떤 교사는 우리 제품을 현재의 교실 활동에 쉽게 통합할 수 있을 수도 있고, 다른 교사는 우리 제품이 작동하도록 하는 데 어려움을 겪을 수도 있습니다. 차이는 가르치는 년수나 기술 이해, 학생들이 영어가 유창한지 여부, 소프트웨어가 쉽게 조정되어 그들의 요구에 부응할 수 있는지에 있을 수 있습니다.\n\n사용자들의 차이점을 식별하고 카탈로그화하지 않으면 다양성의 전체 범위에 대한 설계는 어려울 것입니다. 사용자 중 한 명이 다른 사용자와 어떻게 다를 수 있는지 설명할 수 없다면, 그들은 아무도 위해 설계 중이라는 가능성이 큽니다.\n\n<div class=\"content-ad\"></div>\n\n# 모든 UX 팀 구성원이 사용자의 실제 경험을 설명할 수 있을까요?\n\n교사의 하루는 어떻게 보내나요? 보편적인 교사가 아니라, 실제 교사에 대해 이야기해보죠.\n\n예를 들어, 우리가 만난 교사 이름은 에드나입니다. 에드나는 테네시주 녹스빌에 있는 중학교 특수교육 교사입니다.\n\n최근 에드나의 하루는 어떻게 보냈을까요? 일을 생각하기 시작한 순간부터 끝날 때까지 어떤 모습이었을까요? 에드나에게 그날은 좋은 날인가요, 나쁜 날인가요? 그것이 좋았거나 나빴던 이유는 무엇이었나요?\n\n<div class=\"content-ad\"></div>\n\n나는 구체적인 사용자 경험에 관한 질문에 대답할 수 있는 UX 전문가를 거의 만나지 못했습니다. 우리 분야의 대부분 사람들은 거의 사용자들의 일상 경험에 대한 세부적인 내용에 노출되지 않습니다.\n\n또한 그들은 사용자들의 극한 경험에 노출되지 않습니다. Edna가 올해 가장 힘든 날은 어떤 날이었나요? 그녀를 위해 그것이 왜 그토록 어렵기 했나요? 지금까지 그녀의 가장 좋은 날은 무엇이며, 그 이유는 무엇인가요?\n\n특정 날들이 왜 도전적인지 알지 못하면 어떻게 각 사용자의 날을 개선할 수 있을까요? 그들을 훌륭하게 만드는 이유를 알지 못하고 제품이 사용자의 좋은 날을 악화하지 않도록 어떻게 할 수 있을까요?\n\nUX 전문가들은 사용자의 경험을 사방에서 알고 있어야 합니다. 그럼에도 불구하고 전문가들 중에는 그렇게 하는 사람이 거의 없다고 발견했습니다.\n\n<div class=\"content-ad\"></div>\n\n# 제품 및 개발팀 구성원들은 자신들의 작업에서 혜택을 받는 사용자를 이름 지어 설명할 수 있나요?\n\n현재 개발자들은 코드를 작성하고 제품 관리자들은 PM이 하는 일을 하고 있습니다. 모두가 다음 릴리즈를 위해 새로운 기능을 제공하기 위해 열심히 일하고 있죠.\n\n하지만, 이러한 새로운 기능을 통해 누구가 혜택을 받을 것인지를 생각해 본 적이 있나요? 각 사용자가 제품을 자신만의 방식으로 어떻게 활용할지 설명할 수 있나요?\n\n개발자들과 PM들은 새로운 기능이 각 사용자의 어려운 날을 어떻게 개선할지, 제품이 어떤 사용자에게 불편함을 느끼게 하지 않도록 어떻게 보장할지 설명할 수 있나요? 만약 우리가 협업하는 사람들이 자신이 개발하고 있는 사용자에 대해 알지 못한다면, 그들이 만드는 새로운 기능이 아무에게도 도움이 되지 않을 가능성이 있습니다.\n\n<div class=\"content-ad\"></div>\n\n# 제품 요구 사항은 실제 고객과 사용자의 실제 경험에서 왔을까요?\n\n스테이크홀더와 제품 리더들이 단 한 명의 사용자를 명명하거나 해당 사용자가 경험했던 실제 경험을 설명할 수 없다면, 제품 요구 사항은 어디에서 나올까요? 우리가 우리 사용자에 대해 아무것도 모른 채 정확한 사용자 스토리를 만들 수 있을까요?\n\n더 중요한 것은, 우리가 그들을 위해 디자인하지 않은 제품에 대해 고객이 얼마나 마음에 들 것인가요? 우리가 그들의 특별한 필요성을 고려하지 않고 무엇을 제공하면 그들이 얼마나 가치 있게 여길까요? 그리고 만약 우리 제품이나 서비스를 통해 혜택을 받을 수 있는 고객을 한 명도 명명하지 못한다면 어떻게 할까요?\n\n# 우리는 지금부터 우리 사용자와 그들의 경험에 대해 이야기해야 합니다.\n\n<div class=\"content-ad\"></div>\n\nUX는 모든 것이 사용자와 그들의 경험을 중심으로 하는 것이죠 — 그것이 이름에도 담겨 있습니다.\n\n사용자의 이름을 부르지 못하거나 그들의 경험을 설명할 수 없을 때, 우리는 모든 것을 늦추게 됩니다. 각각의 UX 팀원, 개발자, 제품 매니저, 이해당사자들마다 사용자가 무엇을 필요로 하는지 다르게 생각하게 되죠.\n\n우리는 사용자가 무엇을 필요로 하는지 또는 사용자가 누구인지에 대해 논쟁하고 논의하게 됩니다. 그 논쟁은 프로젝트를 늦추게 만듭니다. 게다가, 팀이 사용자와 고객이 필요로 하는 것을 잘못 추측하는 경우, 결과적으로 엉성한 판매와 비즈니스 목표의 미션을 초래합니다.\n\n사용자가 정말 누구인지에 대해 자세하게 이야기해 봅시다. 모든 조직 구성원이 각 사용자를 독특하게 만드는 것이 무엇인지 알 수 있도록 합시다. 우리 조직 전체에서 우리 사용자와 그들의 경험에 대한 세계 최고의 전문가가 되도록 합시다.\n\n<div class=\"content-ad\"></div>\n\n우리 사용자와 그들의 경험에 대해 이야기하는 것이 우리 조직에 가장 값진 기여입니다.\n\nCenter Centre 웹사이트에 원래 게시된 내용입니다.\n\n전략적인 UX 연구는 귀하가 귀하의 사용자 및 조직 전체에서 경험에 대해 전문 지식을 구축하는 방법입니다.\n\n세계 최고의 사용자 및 그들의 경험에 대한 전문가가 되어보세요.\n\n<div class=\"content-ad\"></div>\n\n우리의 전략적인 사용자 경험 연구 집중교육인 6월 3일부터 7일까지 참여해보세요.\n\n![Image](/assets/img/2024-05-17-ItsTimeWeSeriouslyTalkAboutUsersandExperiences_1.png)\n","ogImage":{"url":"/assets/img/2024-05-17-ItsTimeWeSeriouslyTalkAboutUsersandExperiences_0.png"},"coverImage":"/assets/img/2024-05-17-ItsTimeWeSeriouslyTalkAboutUsersandExperiences_0.png","tag":["Tech"],"readingTime":5},{"title":"게임화가 사용자 경험을 변화시키는 방법","description":"","date":"2024-05-17 22:12","slug":"2024-05-17-HowGamificationIsTransformingUserExperience","content":"\n![Gamification Image](/assets/img/2024-05-17-HowGamificationIsTransformingUserExperience_0.png)\n\n모두가 한 번쯤은 그랬을 것입니다. 끝없는 메뉴 클릭, 혼란스러운 인터페이스와 그냥 포기하고 싶은 강렬한 욕구가 드는 순간들을 겪었습니다. 그런데 만일 디지털 공간을 탐험하는 것이 매력적이고 보상적인 재미있는 비디오 게임과 같았다면 어떨까요?\n\n이 기사에서, 우리는 게임화의 매혹적인 세계를 탐험하며 사용자 경험을 혁신하고 사용자 참여를 촉진하며 디지털 세계를 더욱 재미있고 보상적인 공간으로 만드는 방법을 알아보겠습니다. 준비하시고, UX에 대한 이해를 높이는 시간이에요!\n\n## 게임화는 게임으로 간주되나요?\n\n<div class=\"content-ad\"></div>\n\n지금 \"게이미피케이션\"이라는 단어를 듣는 순간 당신의 머리속에는 픽셀 캐릭터, 황금같은 가상 물건들을 모으려는 강렬한 욕구와 같은 이미지가 떠오를 수 있습니다. 그리고 당신이 틀리지 않았어요! 게이미피케이션은 게임 디자인의 원칙들을 많이 차용하지만, 모든 것을 완전한 비디오 게임으로 바꾸는 것은 아니에요.\n\n실세계 상황에 게임 메카닉을 전략적으로 적용하는 것이죠. 예를 들어, 매일 운동을 완료하도록 독려하거나, 웹사이트의 모든 이용 약관을 읽도록 하는 것 등이 있습니다 (알아요, 누가 그럴까요?).\n\n## 게이미피케이션이 정확히 무엇인가요?\n\n간단히 말하자면, 게이미피케이션은 게임적 사고와 게임 메카닉을 게임이 아닌 맥락에 적용하는 프로세스를 말해요. 여기서는 점수, 배지, 리더보드, 진행 막대, 가상 보상 등이 모두 참여, 동기 부여 및 원하는 결과를 이끌어내는 데 사용돼요.\n\n<div class=\"content-ad\"></div>\n\n![Screenshot](/assets/img/2024-05-17-HowGamificationIsTransformingUserExperience_1.png)\n\n일상적인 작업을 더 재미있고 보상적으로 만들기 위해 게임의 재미와 중독성 있는 요소를 적용하는 것으로 생각해보세요.\n\n## 게임화는 새로운 개념인가요?\n\n이제, \"게임화? 그냥 어떤 것에 거리낌없는 뱃지를 붙이는 멋진 말일 뿐 아니지 않아?\" 라고 생각할 수도 있습니다. 뱃지 추가가 전략의 일부가 될 수 있지만, 게임화는 꾸밈이 아닙니다. 인간 심리를 이해하고 게임 기법을 활용하여 더 매력적이고 보상적인 경험을 만들어내는 것입니다.\n\n<div class=\"content-ad\"></div>\n\n게임 메카닉을 사용하여 사람들을 동기부여하고 참여시키는 개념은 예전부터 존재했습니다. 예를 들어, 교육 분야에서 게임화가 활용되었고 포인트와 보상을 사용하여 학습을 독려했습니다.\n\n실생활에서 게임화를 소개하는 이 비디오를 확인해보세요: [링크](https://www.youtube.com/watch?v=SByymar3bds)\n\n## 게임화가 사용자 경험(User Experience, UX)에 어떤 영향을 미치나요?\n\n디지털 경험을 더욱 매력적이고 동기 부여되는 것으로 만드는 데 관련이 있습니다. 게임화는 사용자의 여정을 동적이고 보상 받는 경험으로 변화시켜 단순한 인터페이스를 흥미진진한 놀이터로 만들어줍니다. 재미있는 도전, 보상적인 놀라움, 진전을 명확히하는 요소들을 통해, 기능적일 뿐만 아니라 즐겁고 유저 중심적인 디지털 경험을 창조합니다. UX 디자이너를 이 디지털 놀이터의 건축가로 생각해보세요. 부드럽고 직관적이며 즐거운 탐험 경험을 제공하는 경험을 만들어냅니다. 게임화 요소를 뿌려서, 사용자 참여를 높이고, 사용자들이 오래 머물고 놀이터가 제공하는 것을 모두 탐험하도록 만듭니다.\n\n<div class=\"content-ad\"></div>\n\n## 게임화는 항상 유익한가요?\n\n그러나 강력한 도구들과 마찬가지로, 게임화도 남용될 수 있습니다. 핵심은 적당한 사용과 대상 청중에 대한 심층적인 이해입니다. 너무 많은 설탕이 디저트를 지루하게 만들 수 있는 것처럼, 게임화도 사용자들이 핵심 작업에서 주의를 산만하게 하고 부자연스러운 경험을 만들어 낼 수 있습니다. 비디오 게임처럼 느껴지도록 디자인된 플랫폼에서 진지한 업무 프로젝트를 완료하려고 시도하는 상황을 상상해 보세요 — 집중과 생산성을 자극하기에 적합하지 않을 것입니다.\n\n또한, 과도한 게임화는 기술능력이 부족한 사용자들을 혼란스럽게 만들 수도 있습니다. 포인트, 뱃지 및 혼란스러운 메커니즘으로 사용자를 압도하는 경우도 있습니다. 게임화의 수준을 특정 사용자 군과 플랫폼의 목적에 맞게 조절하는 것이 중요합니다. 재미와 기능성 사이의 적절한 균형을 찾는 것은 성공적인 사용자 경험을 위해 필수적입니다.\n\n게임화는 디지털 경험을 변화시킬 수 있는 잠재력이 있지만, 모든 상황에 항상 적합한 해결책은 아닙니다. 모든 디자인 요소와 마찬가지로, 게임화는 전략적으로 적용되어야 하며 사용자의 요구사항과 선호도를 신중하게 고려해야 합니다.\n\n<div class=\"content-ad\"></div>\n\n## 결론\n\n디지털 환경이 계속 발전함에 따라, 게임화는 사용자 경험을 형성하는데 더욱 중요한 역할을 할 것으로 예상됩니다. 그 강점, 한계 및 적절한 균형을 이루는 중요성을 이해함으로써, 게임화의 힘을 활용하여 매력적이고 동기부여되며 정말 즐거운 디지털 경험을 만들어낼 수 있습니다. 그래서, 우리는 게임화의 흥미진진한 세계를 계속 탐험하고 미래를 위해 디자인하는 방식을 더욱 높여가야 합니다!\n\n게임화의 세계로 함께한 여정에 참여해 주셔서 감사합니다! 이 여정을 즐겁게 생각하시고 유용한 UX 디자인 탐험을 찾으셨기를 바랍니다. 만약 UX 디자인에 더욱 심취하고 제 작품들을 더 살펴보고 싶으시다면, 내 포트폴리오를 방문해주십시오: https://bento.me/mohamedisskessioui\n","ogImage":{"url":"/assets/img/2024-05-17-HowGamificationIsTransformingUserExperience_0.png"},"coverImage":"/assets/img/2024-05-17-HowGamificationIsTransformingUserExperience_0.png","tag":["Tech"],"readingTime":3},{"title":"변덕스러운 글꼴","description":"","date":"2024-05-17 22:11","slug":"2024-05-17-CapriciousFont","content":"\n\n🌟 캡리셔스 폰트를 소개합니다! 이 매혹적인 산세리프 폰트로 여러분의 디자인을 한 단계 높여보세요. 놓치지 마세요, 지금 무료로 다운로드 받아보세요!\n\n캡리셔스는 로고, 결혼식, 초대장, 인용구, 광고, 인쇄물, 잡지 등에 완벽하게 어울리는 다재다능하고 현대적이며 세련된 산세리프 폰트입니다. 여러분의 가장 창의적인 아이디어에 추가해보고, 어떻게 그 아이디어들이 빛을 발하는지 확인해보세요!\n\n## 호환성\n\n- Windows\n- Apple/Mac\n- Linux\n- 쉽게 웹폰트로 변환 가능\n- 크리큣\n- 실루엣\n- 기타 커팅 머신\n\n<div class=\"content-ad\"></div>\n\n## 설치:\n\nWindows에 글꼴 설치하기\n\nMac에 글꼴 설치하기\n\n더 많은 설치 가이드 보기\n\n<div class=\"content-ad\"></div>\n\n## 이 폰트를 시도해보세요\n\n변덕스러운\n\n## 폭포\n\n## 모든 글리프 보기\n\n<div class=\"content-ad\"></div>\n\n| Size     | Markdown |\n|----------|----------|\n| 72pt     | # Capricious |\n| 48pt     | ## Capricious |\n| 36pt     | ### Capricious |\n\n<div class=\"content-ad\"></div>\n\n24pt\n\n18pt\n\n14pt\n\n개인 및 상업용으로 평생 사용할 수 있는 라이센스입니다. 다중 사용자 라이센스가 필요하신가요?\n\n<div class=\"content-ad\"></div>\n\n## 무료로 이 글꼴 받아가세요\n\n폰트도 포함됨\n\n168,732개의 폰트 무제한 액세스 가능\n\n매일 새로운 폰트 추가됨\n\n<div class=\"content-ad\"></div>\n\n10개 다운로드 받기 완전 무료\n\n무료\n\n무료로 다운로드하세요\n\n**당신을 위해 손수 골라진 것**\n\n<div class=\"content-ad\"></div>\n\nQmico\n\n글꼴\n\n아보카도 패밀리\n\n글꼴\n\n<div class=\"content-ad\"></div>\n\n신비한\n\n폰트들 속에서\n\n멋진 볼드\n\n폰트들 속에서\n\n<div class=\"content-ad\"></div>\n\n- 상업용 라이센스 포함\n- 모든 다운로드 및 구매에는 상업용 라이센스가 포함됩니다. 라이센스에 대해 자세히 알아보세요.\n- 프리미엄 기술 지원\n- 문제가 있나요? 우리는 모든 니즈에 맞는 전문 기술 지원을 제공하기 위해 여기에 있습니다.\n- 무제한 다운로드\n- 구매한 내역은 항상 온라인에서 확인하고 무제한으로 다운로드할 수 있습니다.\n\n## A Christie\n\n프로필 보기\n\n## 168,732 개의 글꼴 다운로드\n\n<div class=\"content-ad\"></div>\n\n10개의 무료 제품을 다운로드하고 위험 없는 무료 평가판을 활성화하세요.\n\n무료 평가판 활성화\n\n## 변덕스러운 글리프\n\n## The Quick Brown Fox\n\n<div class=\"content-ad\"></div>\n\n## 숫자\n\n## 구두점\n\n## 저자의 더 많은 작품\n\nMontana\n\n<div class=\"content-ad\"></div>\n\n글꼴 안내\n\n부티크\n\n글꼴 안내\n\n디스커베라\n\n<div class=\"content-ad\"></div>\n\n폰트에 관하여\n\n르네상스\n\n폰트에 관하여\n\n## 관련 주제\n\n<div class=\"content-ad\"></div>\n\n임의로 결정하는\n\n서체 산세리프\n\n서체\n\n타이포그래피\n\n<div class=\"content-ad\"></div>\n\n디자인\n\n웹 글꼴\n\n디스플레이 글꼴\n\n본문 글꼴\n\n<div class=\"content-ad\"></div>\n\n현대적 글꼴\n\n깔끔한 글꼴\n\n미니멀한 글꼴\n\n우아한 글꼴\n\n<div class=\"content-ad\"></div>\n\n**Professional 글꼴**\n\n**다용도 글꼴**\n\n**가독성 있는 글꼴**\n\n**굵은 글꼴**\n\n<div class=\"content-ad\"></div>\n\nCondensed Font\n\nSans-serif Family\n\n글꼴 스타일\n\n글꼴 두께\n\n<div class=\"content-ad\"></div>\n\n폰트 형식\n\nTtf 폰트\n\nOtf 폰트\n\nGoogle Fonts\n\n<div class=\"content-ad\"></div>\n\n글꼴 조합\n\n글꼴 조합\n\n글꼴 크기\n\n글꼴 맞춤 설정\n\n<div class=\"content-ad\"></div>\n\n폰트 다운로드\n\nA Christie\n\n산세리프\n\n뷰티\n\n<div class=\"content-ad\"></div>\n\n사랑\n\n귀엽다\n\n아이들\n\n여성적\n\n<div class=\"content-ad\"></div>\n\n크리스마스\n\n할로윈\n\n꽃\n\n폰트\n\n<div class=\"content-ad\"></div>\n\n로고\n\n기업\n\n기업용\n\n로고유형\n\n<div class=\"content-ad\"></div>\n\n우아하고 현대적입니다","ogImage":{"url":"/assets/img/2024-05-17-CapriciousFont_0.png"},"coverImage":"/assets/img/2024-05-17-CapriciousFont_0.png","tag":["Tech"],"readingTime":3},{"title":"디자인에서 줄 높이를 마스터하는 완벽한 수직 리듬 만들기","description":"","date":"2024-05-17 22:09","slug":"2024-05-17-CraftingthePerfectVerticalRhythmMasteringLineHeightsinDesign","content":"\n## 문장 주변에 최적의 여백량은 무엇인가요?\n\n![이미지](/assets/img/2024-05-17-CraftingthePerfectVerticalRhythmMasteringLineHeightsinDesign_0.png)\n\n인쇄 프레스 시대에는 \"리딩(leading)\"이라는 용어가 타입 라인 간에 삽입된 얇은 납 금속 조각을 가리켜 수직 간격을 증가시키고 가독성을 향상시키는 데서 유래했습니다. 전통적인 활자 조판에서 리딩은 연속되는 라인들의 베이스라인 간 거리를 가리키는데, 이는 포인트 단위로 측정되었습니다. 당시 타자기는 매우 제한된 리딩 옵션을 가지고 있었는데, 일반적으로 싱글 스페이싱, 더블 스페이싱, 가끔은 행운아들을 위해 1.5 스페이싱을 제공했습니다. 마찬가지로, 현대의 워드 프로세싱 소프트웨어는 전통적인 활자 조판 관행에서 전수받은 \"포인트\" 시스템을 활용하여 줄 간격에 대한 유사한 측정 시스템을 사용합니다.\n\n![이미지](/assets/img/2024-05-17-CraftingthePerfectVerticalRhythmMasteringLineHeightsinDesign_1.png)\n\n<div class=\"content-ad\"></div>\n\n디자인 용어에서 \"줄 간격\"이라는 용어는 텍스트 줄 간의 수직 공간을 가리킵니다. 그러나 그 아이디어는 본질적으로 오래된 스쿨 개념인 리딩과 동일합니다. 줄 간격을 조정하면 텍스트가 읽기 쉽고 매력적으로 보이는 데 상당한 차이를 만들 수 있습니다, 특히 긴 문서나 대형 글꼴 크기를 다룰 때 특히 그렇습니다.\n\n![Crafting the Perfect Vertical Rhythm Mastering Line Heights in Design](/assets/img/2024-05-17-CraftingthePerfectVerticalRhythmMasteringLineHeightsinDesign_2.png)\n\n### 매끄럽게 처리되면 눈에 띄지 않지만, 조금이라도 잘못되면 독자들에게 중대한 어려움을 초래하여 텍스트의 이해와 가독성을 저해할 수 있습니다.\n\n![Crafting the Perfect Vertical Rhythm Mastering Line Heights in Design](/assets/img/2024-05-17-CraftingthePerfectVerticalRhythmMasteringLineHeightsinDesign_3.png)\n\n<div class=\"content-ad\"></div>\n\n연구를 통해 밝혀진 것은 줄 간격 값에 대한 보편적인 표준이 없다는 것입니다. Medium(1.6), Google(1.58), Reddit(1.75)와 같은 다양한 플랫폼은 특정 고려 사항을 바탕으로 자체 가이드라인을 채택했습니다. 줄 간격은 주관적이며 글꼴 선택, 콘텐츠 길이, 인쇄물 또는 웹을 기반으로한 것, 그리고 원하는 미학 등의 요소에 영향을 받습니다.\n\n## 그래서, 줄 간격에 대한 황금 규칙은 무엇인가요?\n\n제 경험을 토대로 한 제품/UX 디자인 분야에서 얻은 몇 가지 개인적인 통찰력을 통해 타이포그라피의 이해와 효과적인 줄 간격 활용에 중요한 역할을 한 것들은 다음과 같습니다:\n\n최적의 줄 간격은 일반적으로 120%에서 180% 범위 내에 있지만, 이는 모든 글꼴이나 맥락에 대한 일반적인 해결책이 아닙니다. 개인적인 경험을 통해 매우 가독성이 뛰어난 결과를 일관되게 얻을 수 있는 일련의 확고한 규칙을 개발했습니다.\n\n<div class=\"content-ad\"></div>\n\n## 나의 규칙 중 가장 소중하게 따르는 것은:\n\n- 한 줄 텍스트의 경우, 줄 높이를 120%로 설정합니다.\n\n![CraftingthePerfectVerticalRhythmMasteringLineHeightsinDesign_4.png](/assets/img/2024-05-17-CraftingthePerfectVerticalRhythmMasteringLineHeightsinDesign_4.png)\n\n2. 문단을 작성할 때, 글꼴 크기와 유형에 맞춰 줄 간격을 130%에서 180% 사이로 조절합니다.\n\n<div class=\"content-ad\"></div>\n\n![CraftingthePerfectVerticalRhythmMasteringLineHeightsinDesign_5](/assets/img/2024-05-17-CraftingthePerfectVerticalRhythmMasteringLineHeightsinDesign_5.png)\n\n3. 아이콘과 함께 텍스트가 있는 경우, 행 높이를 아이콘 크기에 근접하게 맞추세요. 예를 들어, 40px 아이콘이 포함된 버튼 옆에 24px 글꼴 크기의 텍스트가 있는 경우, 24px 글꼴의 행 높이를 40px 아이콘과 일치시키려고 노력합니다. 이는 글꼴 크기를 픽셀 값으로 고정하는 유일한 경우입니다.\n\n![CraftingthePerfectVerticalRhythmMasteringLineHeightsinDesign_6](/assets/img/2024-05-17-CraftingthePerfectVerticalRhythmMasteringLineHeightsinDesign_6.png)\n\n또한, 난독증을 가진 사람들은 행 간격을 증가시킴으로써 가독성을 향상시킬 수 있습니다. 이 이상적인 간격은 단어 사이 간격에 비례하는 것이 좋으며, 선호되는 비율은 1.5 또는 150%입니다. 글꼴 크기와 행 높이가 난독증을 가진 사람들에게 어떻게 영향을 미치는지에 대한 자세한 정보는 '난독증 친화적 스타일 가이드'를 참고하시기 바랍니다.\n\n<div class=\"content-ad\"></div>\n\n결론적으로, 타이포그래피와 줄 간격을 마스터하는 것은 엄격한 규칙을 넘어 설계 원칙과 사용자 요구에 대한 심층적인 이해가 필요한 여정입니다. 미적 요소는 중요하지만 가독성을 우선시하는 것이 필수적입니다. 타이포그래피는 시각적으로 매력적일뿐만 아니라 모든 사용자가 액세스할 수 있어야 합니다. 사용자가 사용하는 장치에 관계없이요.\n\n이 블로그는 웹과 인쇄 형식에 대한 타이포그래피에 대한 통찰을 제공했지만, 모바일 전화와 같은 작은 화면용 반응형 디자인에서 더 탐구해야 할 부분이 많이 남아 있습니다. 앞으로 제가 이 주제를 더 깊이 파고들 예정이니 기대해 주세요. 그리고 추가 통찰을 가진 경험이 풍부한 디자이너라면, 항상 여러분의 피드백과 지적을 기다리고 있습니다. 이 분야에서 계속해서 배우고 성장하기 위해 노력하는 도중에 여러분을 도와주고 영감을 줄 수 있는 기회로서 환영할 것입니다.\n\n이 정도 읽어주신 여러분, 첫 블로그 글을 읽어 주셔서 감사합니다. 앞으로 사용자 경험과 제품 디자인에 관한 더 많은 통찰력 있는 콘텐츠를 기대해 주세요. 저는 사키라이고, 제 생각과 경험을 공유하며 내 마음을 분명히 하고 함께 응원하고 영감을 줄 수 있는 제품 디자이너에게 지식을 전해주는 것을 기대합니다. 함께 이 학습 모험에 떠나 봅시다!\n\n또한, LinkedIn에서 저를 팔로우해 주세요.\n","ogImage":{"url":"/assets/img/2024-05-17-CraftingthePerfectVerticalRhythmMasteringLineHeightsinDesign_0.png"},"coverImage":"/assets/img/2024-05-17-CraftingthePerfectVerticalRhythmMasteringLineHeightsinDesign_0.png","tag":["Tech"],"readingTime":4},{"title":"아이콘 그리드와 키패드 라인에 대한 내 이해","description":"","date":"2024-05-17 22:08","slug":"2024-05-17-Myunderstandingoficongridandkeyline","content":"\n\n안녕하세요 여러분! 쉽게 아이콘을 만드는 데 도움이 될 수 있는 제 경험에서 가져온 다른 이야기로 돌아왔습니다. 아이콘을 만드는 것은 어렵게 보일 수 있지만, 적절한 도구가 있다면 여러분만의 라이브러리를 만들 수 있습니다. 이전 이야기에서는 Figma에서 아이콘을 만든 방법을 공유했습니다. 이 이야기는 아이콘 이야기의 전편입니다.\n\n# 시작해볼까요!\n\n![image](/assets/img/2024-05-17-Myunderstandingoficongridandkeyline_0.png)\n\n위 이미지를 다섯 개의 섹션으로 나누는 것부터 시작해보죠.\n\n<div class=\"content-ad\"></div>\n\n- 그리드\n- 직교선 (Lines)\n- 활동 영역과 트림 영역\n- 키 형태\n- 마스크\n\n이러한 요소들을 하나의 프레임에 결합하면 아이콘을 만드는 데 사용되는 키프레임과 그리드를 얻게 됩니다.\n\n# 그리드\n\n![그리드](/assets/img/2024-05-17-Myunderstandingoficongridandkeyline_1.png)\n\n<div class=\"content-ad\"></div>\n\n그리드는 구조물 전체에 걸쳐 교차하는 수직 및 수평선의 연속입니다. 그리드는 그래픽 요소를 조직하는 데 중요한 지원 구조로 작용합니다.\n\n나는 1.5px 두께의 스트로크를 이용해 아이콘을 만들 것이기 때문에 24x24px 캔버스에 1px 그리드를 사용했습니다. 따라서 2px 그리드보다 1px 그리드를 사용하는 것이 더 편리합니다.\n\n![Myunderstandingoficongridandkeyline_2.png](/assets/img/2024-05-17-Myunderstandingoficongridandkeyline_2.png)\n\nFigma의 레이아웃 그리드 옵션을 활용하여 캔버스에 그리드를 추가해 보세요.\n\n<div class=\"content-ad\"></div>\n\n# 직교축\n\n![Image](/assets/img/2024-05-17-Myunderstandingoficongridandkeyline_3.png)\n\n직교축은 캔버스의 중심점을 교차하고 추가적인 꼭짓점을 만드는 키프레임을 의미합니다. 이러한 선들은 보통 90°, 45°, 15° 및 5° 각도로 배치됩니다. 대개 90°와 45°가 사용되지만, 필요에 따라 15°와 5°를 추가할 수도 있습니다.\n\n직교축을 다양한 각도로 추가하려면 선 도구를 사용하면 됩니다.\n\n<div class=\"content-ad\"></div>\n\n# 라이브 영역 및 트림 영역\n\n![이미지](/assets/img/2024-05-17-Myunderstandingoficongridandkeyline_4.png)\n\n라이브 영역은 아이콘의 주요 콘텐츠가 있는 공간입니다. 필요한 경우, 아이콘의 범위는 트림 영역까지 확장될 수 있지만 트림 영역 밖으로 확장되어서는 안 됩니다.\n\n# 주요 모양\n\n<div class=\"content-ad\"></div>\n\n![img](/assets/img/2024-05-17-Myunderstandingoficongridandkeyline_5.png)\n\nKey Shapes은 원, 직사각형 및 정사각형과 같은 기본 도형을 만드는 데 도움이 되는 가이드입니다.\n\n저는 이러한 도형들을 자주 사용할 것이기 때문에 차원이 다른 다섯 개의 도형을 주요 도형으로 배치했습니다.\n\n- 10과 20의 차원을 가진 두 개의 원\n- 높이와 너비가 각각 18px인 한 개의 정사각형\n- 크기가 20px이고 너비가 16px인 수직 직사각형\n- 높이와 너비가 각각 16px와 20px인 수평 직사각형\n\n<div class=\"content-ad\"></div>\n\n각 모양마다 다른 색상이 있어서 사용하기 쉽습니다.\n\n# 마스크\n\n![이미지](/assets/img/2024-05-17-Myunderstandingoficongridandkeyline_6.png)\n\n마스크는 아이콘의 컨테이너입니다. 로고 디자인에 주로 도움이 됩니다. 컨테이너에 내용을 클리핑하는 데 사용됩니다. 사용 사례에 따라 다른 테두리 반지름을 가질 수도 있습니다.\n\n<div class=\"content-ad\"></div>\n\n# 끝\n\n위 단계들을 결합하면 아이콘 그리드와 키라인을 얻게 됩니다. 이를 사용하여 많은 아이콘을 만들어보세요 :D\n\n저는 지출 관리 회사인 Fyle Technologies를 위해 이 그리드와 키라인을 사용하여 아이콘 라이브러리를 만들었습니다.\n\n<img src=\"/assets/img/2024-05-17-Myunderstandingoficongridandkeyline_7.png\" />","ogImage":{"url":"/assets/img/2024-05-17-Myunderstandingoficongridandkeyline_0.png"},"coverImage":"/assets/img/2024-05-17-Myunderstandingoficongridandkeyline_0.png","tag":["Tech"],"readingTime":3},{"title":"독특한 예술 스타일로 일관된 일러스트레이션 시리즈 생성하기","description":"","date":"2024-05-17 22:06","slug":"2024-05-17-Generateaseriesofconsistentillustrationsinuniqueartstyles","content":"\n![illustration generator](/assets/img/2024-05-17-Generateaseriesofconsistentillustrationsinuniqueartstyles_0.png)\n\n첫 번째이자 유일한 전문 화가가 만든 AI 이미지 생성기의 힘을 발견하십시오.\n\nAI로 생성 된 일러스트레이션은 종종 뚜렷한 '기계에 의해 만들어진' 느낌을 줍니다. 진정한 인간 모습의 작품을 만들려면 여전히 프롬프트 사용에 대한 심오한 전문 지식이 필요하며, 바로 이것이 Illustration Generator가 해결하려는 바입니다.\n\nIcons8 Ouch! 뒤의 예술가 및 엔지니어 팀은 예술과 기술을 접목하여 진정한 작가들의 스타일 내에서 완벽하게 일관된 이미지를 생성할 수 있습니다.\n\n<div class=\"content-ad\"></div>\n\n# 가능한 방법은 무엇인가요?\n\n다음 세 가지 과정을 통해 가능합니다:\n\n- 10만 개 이상의 일러스트를 그렸으며 매주 새로운 일러스트 수백 개를 그립니다. 그럼에도 불구하고, 모든 사람들의 요구를 충족시키기에는 한계가 있습니다. 이때 인공 지능이 도움이 됩니다.\n- 저희는 일러스트 데이터셋을 만들었습니다. 다른 생성 플랫폼과 달리 이미지를 인터넷에서 가져오진 않았습니다. 우리가 소유한 데이터를 사용해 훈련시켰습니다.\n- 인공 지능을 훈련시켜 우리 스타일에 맞는 그림을 생성하도록 했습니다. 이제 당신은 우리를 고용했다고 생각할 수 있는 사진을 얻을 수 있습니다. 같은 스타일로 생성한 다음 이미지는 이전 이미지와 일치합니다.\n\n가장 이상적인 상황에도 사용할 수 있는 무한한 일러스트 팩을 갖게 된 것과 같아요.\n\n<div class=\"content-ad\"></div>\n\n# 일러스트레이션 생성기로 무엇을 얻을 수 있나요\n\n## 친절하게 답변해 드릴게요\n\n앱에 들어가서 그림에서 보고 싶은 것을 간단히 입력하세요.\n\n![이미지](/assets/img/2024-05-17-Generateaseriesofconsistentillustrationsinuniqueartstyles_1.png)\n\n<div class=\"content-ad\"></div>\n\n## 생성된 결과물에 대한 완전한 제어\n\n최종 일러스트레이션에 무엇을 원하고 원치 않는 지를 특정지어 설명하기 위해 부정적인 프롬프트를 사용하고 설명을 조정하세요.\n\n<img src=\"/assets/img/2024-05-17-Generateaseriesofconsistentillustrationsinuniqueartstyles_2.png\" />\n\n## 참조 이미지\n\n<div class=\"content-ad\"></div>\n\n![2024-05-17-Generateaseriesofconsistentillustrationsinuniqueartstyles_3.png](/assets/img/2024-05-17-Generateaseriesofconsistentillustrationsinuniqueartstyles_3.png)\n\n## 배경 옵션\n\n배경이 있는 이미지 또는 배경이 없는 이미지를 다운로드하세요.\n\n<div class=\"content-ad\"></div>\n\n![Image](/assets/img/2024-05-17-Generateaseriesofconsistentillustrationsinuniqueartstyles_4.png)\n\n## 다양한 종횡비\n\n사각형은 잊어버려. 필요한 종횡비를 선택해봐.\n\n![Image](/assets/img/2024-05-17-Generateaseriesofconsistentillustrationsinuniqueartstyles_5.png)\n\n<div class=\"content-ad\"></div>\n\n## 역사\n\n빠른 참조와 재사용을 위해 생성된 이미지의 기록을 확인하세요.\n\n![이미지](/assets/img/2024-05-17-Generateaseriesofconsistentillustrationsinuniqueartstyles_6.png)\n\n# 작동 방식\n\n<div class=\"content-ad\"></div>\n\n쉽고 간단한 4단계로 100% 원본 및 합법적 이미지를 쉽게 만들어보세요:\n\n- 프롬프트 입력 또는 이미지 업로드\n- 스타일 선택 및 드래프트 생성\n- 마음에 드는 드래프트 선택하고 향상시키기\n- 고품질 일러스트레이션 획득\n\n## 지금 일러스트레이션 생성기를 사용해보세요\n\n<img src=\"/assets/img/2024-05-17-Generateaseriesofconsistentillustrationsinuniqueartstyles_7.png\" />\n\n<div class=\"content-ad\"></div>\n\n원래 2024년 5월 16일에 https://blog.icons8.com에서 게시되었습니다.\n","ogImage":{"url":"/assets/img/2024-05-17-Generateaseriesofconsistentillustrationsinuniqueartstyles_0.png"},"coverImage":"/assets/img/2024-05-17-Generateaseriesofconsistentillustrationsinuniqueartstyles_0.png","tag":["Tech"],"readingTime":3},{"title":"AI 경험을 위한 디자인","description":"","date":"2024-05-17 22:04","slug":"2024-05-17-DesigningforAIExperiences","content":"\n\nAI의 관점에서 디자인 시스템\n\nAI는 작업 방식을 변화시키고 있습니다. 이 글은 핵심 개념과 예시를 통해 AI 경험을 가능하게 하는 디자인 시스템에 대해 알아봅니다.\n\n![AI Design System](/assets/img/2024-05-17-DesigningforAIExperiences_0.png)\n\n## 투명성\n\n<div class=\"content-ad\"></div>\n\nAI는 chatGPT와 같이 독립적인 경험처럼 기존 앱과 통합되어 있습니다. AI를 기존 앱/프로세스에 통합할 때 AI가 사용되고 있는지 명확히 알 수 있어야 합니다. 예를 들어, 사람과 AI 추천이 함께 제공되는 경우 추천이 명확하게 라벨링되어야 합니다.\n\n의사 결정/프로세스/추천에 AI가 참여했음을 나타낼 수 있는 몇 가지 기술을 아래에서 설명하겠습니다:\n\n## 브랜드\n\n강력한 시각적 브랜드는 사용자들이 AI 서비스와 콘텐츠와 상호 작용하는지를 이해하는 데 도움이 될 것입니다.\n\n<div class=\"content-ad\"></div>\n\nOpenAI은 채팅 대화 중에 자신들의 로고를 아바타로 사용합니다. 이 로고는 OpenAI 제품 오퍼링 전반에 사용되며, 일관된 경험을 제공하고 AI 상호작용을 식별하는 데 도움이 됩니다. Microsoft도 Copilot에서 동일한 방식을 사용합니다.\n\n디자인 시스템은 표준 아바타 구성 요소와 AI 관련 그림을 제공함으로써 이러한 경험을 가능케 할 수 있습니다.\n\n![이미지](/assets/img/2024-05-17-DesigningforAIExperiences_1.png)\n\n## 색상\n\n<div class=\"content-ad\"></div>\n\n보라색이 AI를 대변하는 선도적인 색 중 하나로 떠오르고 있습니다. 때로는 색상 그라데이션이 이용되어 능력의 범위와 복잡성을 나타냅니다. \n\n디자인 시스템은 사용자들을 위한 일관성 구축을 돕기 위해 AI 요소 주변의 색상 안내를 제공할 수 있습니다.\n\n![image](/assets/img/2024-05-17-DesigningforAIExperiences_2.png)\n\n## 완드, 반짝임, 그리고 구체\n\n<div class=\"content-ad\"></div>\n\n아이콘은 AI와 관련된 작업 및 콘텐츠를 빠르게 이해하는 데 도움이 될 수 있어요.\n\n콘텐츠를 생성하기 위한 CTA(Call To Action)에 주로 사용되는 완드와, AI가 생성한 콘텐츠를 강조하는 데 사용되는 반짝임 효과인 스파클이 있어요. 완드 CTA와 잘 어울리는 스파클은 AI 생성 콘텐츠를 강조하기에 좋은 선택이에요.\n\nSiri와 같은 그래픽을 사용한 구체적인 AI 개체의 표현으로 인해 구체적인 AI 개체로서 보다는 AI 개념을 추상화하는 방향으로 나아가고 있는 많은 AI 제품들이 있어요 (2024년의 Clippy와 같은 방식으로 AI를 표현하는 것을 생각해보세요).\n\n디자인 시스템은 이러한 경험에 필요한 아이콘을 제공할 뿐만 아니라 완드 휙 소리나 빛나는 스파클과 같은 애니메이션도 제공할 수 있어요. 이러한 애니메이션은 사용자에게 기쁨을 제공할 수 있지만 과용되면 주의해야 해요. 애니메이션은 처음 사용할 때 또는 가끔 사용할 때만 트리거되도록 고려해보세요.\n\n<div class=\"content-ad\"></div>\n\n![Image](/assets/img/2024-05-17-DesigningforAIExperiences_3.png)\n\n## 설명\n\n사용자는 AI가 생성한 콘텐츠와 제안을 원천으로 되돌릴 수 있어야 합니다. 이는 신뢰와 추적 가능성을 경험에 녹여냅니다.\n\nCopilot은 정보를 얻은 곳을 참조하는 내용 각주를 제공합니다.\n\n<div class=\"content-ad\"></div>\n\n디자인 시스템은 이 경험을 지원하기 위해 주석 컴포넌트를 제공하여 소스 자체와 함께 사용되는 칩/오버플로우 칩에 필요한 정보를 제공할 수 있습니다.\n\n![이미지](/assets/img/2024-05-17-DesigningforAIExperiences_4.png)\n\n# 피드백\n\n환각 및 잘못된 콘텐츠는 여전히 AI 제품에서 흔합니다. 사용자들은 모델을 개선하거나 추가 기능을 추가하기 위해 사용할 수 있는 피드백을 제공할 수 있어야 합니다.\n\n<div class=\"content-ad\"></div>\n\n다음은 EDT 시간으로 3월 30일 토요일 새벽 4시쯤에 생성된 예입니다. 결과는 잘못되었을 가능성이 높고, 아마도 최신 모델 생성 시기를 나타낼 것입니다.\n\n디자인 시스템은 아이콘 그래픽을 제공하여 짧은 양식 피드백에 대한 피드백 경험을 활성화할 수 있으며, 장문 피드백을 위해 표준 텍스트 입력 구성 요소를 제공할 수 있습니다.\n\n<div class=\"content-ad\"></div>\n\n# 성능과 대기 시간\n\n실시간으로 AI 콘텐츠가 생성되므로 현재 요청이 보내진 후 응답이 앱으로 반환되어 사용자에게 렌더링되기까지는 약간의 지연이 발생합니다.\n\n사용자가 이 지연을 어떻게 인지하느냐는 UI 경험에 영향을 받을 것입니다. 빈 화면은 사용자가 문제가 있는 것으로 생각하고 떠나버릴 수 있습니다.\n\n인라인로딩 표시기는 사용자가 자신의 질문이 보내졌고 AI가 \"생각\"하고 있다는 것을 확신할 수 있도록 도와줄 수 있습니다. 섬세한 애니메이션은 사용자가 기다리는 동안 즐겁게 할 수 있습니다.\n\n<div class=\"content-ad\"></div>\n\n## 컨텍스트 한계\n\n일부 AI 경험은 지원하는 컨텍스트의 양이 제한될 수 있습니다. 예를 들어 단일 대화에 대한 채팅 기록의 양이 제한될 수 있습니다.\n\n사용자에게 컨텍스트 한계를 알려줌으로써 채팅의 길이에 대한 기대를 관리할 수 있습니다. 이러한 간단한 표시기는 각 부서가 동일한 접근 방식을 사용하도록 하는 디자인 시스템 내에서 중앙집중화될 수 있습니다.\n\n![이미지](/assets/img/2024-05-17-DesigningforAIExperiences_7.png)\n\n<div class=\"content-ad\"></div>\n\n# 덜은 더 많은 것\n\n생성적 AI는 화면을 내용으로 저렴하게 채울 수 있는 가능성을 제공합니다; 모든 앱이 제공할 수 있는 모든 것을 보여주는 것이 유혹적일 수 있지만 사용자가 특정 데이터 포인트에 집중하지 못하고 다른 곳으로 넘어가는 반대 효과를 가질 수 있습니다.\n\n화이트 스페이스는 디자인에서 항상 효과적인 도구가 될 것입니다 (현재 아마도 이 글을 중앙에서 읽고 계실 텐데 그것은 읽고 있는 글에 집중할 수 있도록 화이트 스페이스를 활용하기 때문입니다); 새롭거나 복잡한 경우 특히 내용을 충분히 간격을 두어야 합니다.\n\n디자인 시스템은 사용하기 쉬운 간격과 레이아웃 구성 요소를 제공할 수 있으며 소화하기 쉬운 경험을 만들 수 있습니다.\n\n<div class=\"content-ad\"></div>\n\n# 결론\n\nAI 공간은 빠르게 변화하고 있습니다; 몇 달 전까지는 존재하지 않았던 새로운 경험을 지원하도록 디자인 시스템이 유연하고 적응해야 합니다.\n\n디자인 시스템이 AI 경험을 가능하게 하는 방법에 대한 생각이나 의견이 있으시면 꼭 댓글을 남겨주세요!","ogImage":{"url":"/assets/img/2024-05-17-DesigningforAIExperiences_0.png"},"coverImage":"/assets/img/2024-05-17-DesigningforAIExperiences_0.png","tag":["Tech"],"readingTime":4},{"title":"올댓 텍스트, 어디서나, 한 번에 GIPHY 통합된 곳 어디서든 접근 가능한 GIF 찾기","description":"","date":"2024-05-17 22:03","slug":"2024-05-17-AltTextEverywhereAllAtOnceFindaccessibleGIFseverywhereGIPHYisintegrated","content":"\n\n5월 16일 글로벌 접근성 인식의 날을 기념하기 위해, 최근 GIPHY에서 접근성 증대를 위해 내놓은 몇 가지 진전을 살펴보려고 했습니다. 이전에 이야기했듯이, 접근성 라이브러리의 접근성을 높이기 위해 Scribely와의 긴박하고 광범위한 파트너쉽을 가졌습니다.\n\n흥미로운 업데이트는 오늘 기준으로, GIPHY의 API 또는 SDK를 사용하는 모든 통합에서 대체 텍스트가 제공된다는 점입니다. 이는 iMessage, Instagram, Threads 등 GIPHY의 수천 개 통합 중에서 4만 개 이상의 접근성 있는 GIF가 포함되어 있음을 의미합니다(매일 대체 텍스트가 추가되는 GIF가 늘어날 예정입니다!).\n\n통합 전반에 대체 텍스트가 사용자들에게 전달되고 있는지 확인하는 것 외에도, 우리는 라이브 커버리지를 포함하여 대체 텍스트 생성을 우선 고려하고 있습니다. 우리는 오스카 시상식에서 Scribely와 함께 이 작업 프로세스를 시도했으며 최근 Met Gala에서도 계속 진행하며 실시간으로 사용자에게 접근성 있는 GIF를 제공하고 있습니다.\n\n인터넷을 완전히 접근성 있는 상태로 유지하는 것은 GIPHY 및 모든 콘텐츠 제공자의 평생 책임이지만, 우리는 GIPHY가 모든 사람에게 접근 가능하도록 하는 이 다음 큰 단계에 대해 매우 기쁩니다.\n\n<div class=\"content-ad\"></div>\n\n또한, 장애인 공동체 구성원을 소재로 한 GIF 및 스티커 컬렉션을 만들기 위해 World Institute on Disability (WID), Scibely, Daniella Decker와의 협력으로 GIPHY가 노력했습니다. 이 컨텐츠는 온라인에서의 보다 포용적인 분위기 조성을 목표로 하며, 장애인 공동체 내의 다양한 목소리와 재능을 보여주고 축하하는 데 그 의미가 있습니다.\n\nGIPHY의 더 많은 소식은 인스타그램, 틱톡, 트위터에서 팔로우해주세요.","ogImage":{"url":"/assets/img/2024-05-17-AltTextEverywhereAllAtOnceFindaccessibleGIFseverywhereGIPHYisintegrated_0.png"},"coverImage":"/assets/img/2024-05-17-AltTextEverywhereAllAtOnceFindaccessibleGIFseverywhereGIPHYisintegrated_0.png","tag":["Tech"],"readingTime":1},{"title":"디자인은 지식이 시각적으로 표현된 것이에요","description":"","date":"2024-05-17 22:02","slug":"2024-05-17-Designisintelligencemadevisible","content":"\n\n👋 기쁜 월요일! 데일리 에디션에 오신 것을 환영합니다\n이슈 #77: OpenAI가 Siri를 위해 나섰습니다, H5N1 조류 독감에 관한 새로운 연구, 그리고 Long Covid와 함께하는 삶\n저자: 해리스 소클\n\n\"디자인\"이라는 단어는 종종 볼 수 있는 것들의 맥락에서 사용됩니다: 웹사이트, 앱, 공간 안의 물체들. 하지만 디자인에 대한 최상의 정의 중 하나는 인간들이 만들어낸 모든 것에까지 이를 확장합니다. 이는 그래픽 디자이너 루이스 단지저가 한 말 중 하나인데요, 그는 \"디자인은 지능이 시각적으로 나타난 것\"이라고 했습니다.\n\n저는 Medium의 맥락에서 많이 이에 대해 생각해봅니다. 여기서는 사람들이 읽고 쓰는 데 도움이 되는 도구를 디자인하고 있습니다. 그러나 이것은 또한 글쓰기 자체에도 적용된다고 생각합니다. 글쓰기 또한 지능이 시갤적으로 나타난 것이기 때문이죠.\n\n이와 관련하여, 나누고 싶은 디자인에 관한 이야기가 있어요. 이 이야기는 글쓰기, 사고, 다른 사람과의 관계에까지 확장해볼 수 있는 내용입니다. 제품 디자이너 타라스 바쿠세비치가 작성한 \"아름다운 UI 디자인을 위한 58가지 규칙\"인데요. 그곳에서 그는 디자인의 \"우아함 공식\"과 8개의 주요 원칙에 매핑된 58가지 규칙을 소개합니다.\n\n<div class=\"content-ad\"></div>\n\n- 공감: 좋은 디자인은 청중을 이해하는 데서 출발합니다.\n- 배치: 눈을 편안하게 이끌어냅니다.\n- 본질주의: 단순함과 목적을 최우선으로 합니다.\n- 안내: 디자인은 우리를 어딘가로 인도해야 합니다.\n- 미학: 감정을 전달합니다.\n- 독창성: \"진정한 예술은 독창성과 익숙함을 균형있게 조화시키는 데 있습니다.\"\n- 일관성: 혼란스럽지 말고 신뢰를 쌓습니다.\n- 참여: 좋은 디자인은 좋은 대화처럼 존재합니다.\n\n이 원칙 중 어느 것이 글쓰기, 소프트웨어 공학 또는 삶 자체에 적용될 수 있는지요? 저는 그렇게 생각합니다.\n\n# 우리가 더 읽을 만한 것\n\n- OpenAI가 Chat GPT-4o(여기서 'o'는 '옴니(omni)'를 의미합니다)를 공개했습니다. 이 봇은 주변을 듣고 관찰하며 Siri보다 미묘하게 더 현실적인 목소리로 답할 수 있습니다(즉, \"음\"이나 \"그래서\"와 같은 말들을 더 사용합니다). AI 전문가인 Thomas Smith는 이 봇의 강조된 음성 능력이 좀 이상할 수 있지만, GPT-4o의 기본 기능은 애플리케이션 개발에 미묘하고 광범위한 영향을 미칠 것이라고 지적합니다. 기존 Chat GPT를 사용하는 앱을 \"더 똑똑하고 빠르고 나은 것으로 만들어서 운영 비용도 더 저렴하게 할 것\"이라고 설명합니다.\n- 만약 소 차이파병(H5N1) 발병에 관한 제76호 글을 읽었다면: 백신 전문가인 Chris Buck은 텍사스의 아황산 염기 9개 도시의 폐수에 높은 수준의 H5N1이 포함되어 있다고 밝힙니다. \"팬데믹의 주요 교훈 중 하나는 우리가 기존에 호흡기 병원균으로 생각하던 바이러스가 식도에서도 복제된다는 것\"이라고 설명합니다. Buck는 이러한 연구 결과를 설명할 수 있는 가장 가능성이 높은 가설은 인간에서 무증상 H5N1이 증가했다는 것이라고 믿지만, 이것이 증명되기 위해서는 별도의 실험이 필요할 것이라고 합니다.\n- Anna Holmes는 코로나 후 이어지는 장기 증상(구체적으로 PASC: 코로나 19의 장기 연조직 증상)과 함께하는 생활에 대한 직접 증언을 공유합니다. 그녀에게 가장 아픈 부분은 대부분의 세계가 코로나에 대해 완전히 넘어갔다는 것입니다. 그녀의 이야기는 수백만 명의 이야기입니다: 약 \"인구의 7%에 해당하는 약 1800만 명\"이 2022년 CDC 조사에 따르면 장기 코로나로 고통받고 있다고 합니다.\n\n<div class=\"content-ad\"></div>\n\n# 💡 매일 실용적인 지혜를 찾아보세요: 기업가정신에 관해\n\n소설가이자 비즈니스 전략가인 엘리엇 페퍼는 거의 10년 전에 \"스토리텔링은 기업가들의 정의적인 기술이다\"라고 썼습니다. 언제나 비즈니스 상황에서 누굴 설득하거나 모집하거나 유혹하려 할 때는, \"독자들이 빠뜨리는 부분들을 없애려고 노력하세요.\"\n\n매일 뭔가 새로운 것을 배워보세요. Medium의 데일리 에디션으로 가입하세요.\n\n편집 및 제작자:\n스콧 램브\n&\n칼리 로즈 길리스\n\n<div class=\"content-ad\"></div>\n\n문의 사항, 피드백 또는 이야기 제안이 있으신가요? tips@medium.com 으로 이메일 주세요.","ogImage":{"url":"/assets/img/2024-05-17-Designisintelligencemadevisible_0.png"},"coverImage":"/assets/img/2024-05-17-Designisintelligencemadevisible_0.png","tag":["Tech"],"readingTime":3}],"page":"5","totalPageCount":15,"totalPageGroupCount":1,"lastPageGroup":15,"currentPageGroup":0},"__N_SSG":true}