{"pageProps":{"posts":[{"title":"호밍 프로젝타일 만들기","description":"","date":"2024-05-15 23:30","slug":"2024-05-15-CreatingaHomingProjectile","content":"\n<img src=\"/assets/img/2024-05-15-CreatingaHomingProjectile_0.png\" />\n\n최종 플레이어 특별 탄약으로 호밍 미사일을 만들고 싶었습니다. 이를 통해 파워 업을 사용하여 얻게 되는 미사일을 만들고 싶었어요. 이를 위해 다음과 같은 작업이 필요했죠:\n\n- 호밍 미사일 파워 업을 만들기\n- 파워 업의 행동 결정하기 — 수집 시 다음 다섯 발의 총알이 호밍 미사일이 되는 방법\n- 호밍 미사일 프리팹 만들기\n- 호밍 미사일의 동작 결정하기 — 미사일이 가까운 적에게 잠금을 걸고 그 적으로 직접 이동하는 방법\n\n## 호밍 미사일 파워 업 만들기\n\n![Homing missile creation step 1](/assets/img/2024-05-15-CreatingaHomingProjectile_1.png)\n\nFor the homing missile, I created a blue version of the regular Ammo Power Up. Just like when I made that Power Up, I added this new one to the Power Up ID list and then included it in the balancing system of my Spawn Manager. After ensuring that the new Power Up would spawn correctly, I needed it to trigger a method in the Player.\n\n![Homing missile creation step 2](/assets/img/2024-05-15-CreatingaHomingProjectile_2.png)\n\nIn this case, I named it HomingMissileActive().\n\n## '파워 업' 동작 결정하기\n\n![이미지](/assets/img/2024-05-15-CreatingaHomingProjectile_3.png)\n\n이 방법은 세 가지 새로운 변수를 사용했어요. 한 가지는 'Homing 미사일 파워 업'이 활성화되었는지를 추적하기 위한 것이고, 다른 하나는 수집 가능한 아이템을 수집할 때마다 미사일 5개 한도를 설정/재충전하는 데 사용되며, 새로운 오디오 클립을 위한 세 번째 변수도 있어요.\n\n![이미지](/assets/img/2024-05-15-CreatingaHomingProjectile_4.png)\n\n이 Power Up은 Triple Shot Power Up과 유사하게 작동하며, 시간 제한 대신 발사 횟수 제한이 있습니다. 따라서 FireLaser() 메서드를 수정하여 Homing Missile Power Up이 활성화되었을 때 실행되도록 if 문을 포함시켰어요.\n\n이 경우에는 문이 해당 Power Up이 활성화되어 있는지, 그리고 \\_homingMissileCounter 발사 추적 변수에 남아있는 총알이 있는지 확인합니다. 그렇다면 새로운 \\_homingMissilePrefab을 발사하게 됩니다. 또한 그 if 문 안에는 각 발사 후에 마지막인지 확인하는 또 다른 문도 있습니다. 그렇다면 \\_isHomingMissileActive bool를 비활성화하고 오디오 클립을 표준 레이저 샷으로 변경하게 됩니다.\n\n## Homing Missile Prefab 생성하기\n\n<img src=\"/assets/img/2024-05-15-CreatingaHomingProjectile_5.png\" />\n\n홈잉 미사일 프리팹은 유니티 에셋 스토어에서 발견한 무료 미사일 스프라이트에요. 플레이어에 사용하는 스프라이트와 동일한 스러스터 애니메이션도 포함했고, 주변의 적이 가까워지면 감지할 수 있는 레이더 빈 오브젝트를 추가했어요. 적들이 회피하는 방법을 만드는 데 사용한 방식과 유사해요.\n\n또한, 이 회피 동작에 대해 생성한 스크립트와, 그리고 파워 업을 파괴하는 동작에 대한 스크립트를 차용해서 \"EnemyRadar\"를 \"Radar\"로 변경해서, 이 스크립트 아래에 앞으로 필요한 모든 레이더 작업을 담을 수 있도록 했어요.\n\n![이미지](/assets/img/2024-05-15-CreatingaHomingProjectile_6.png)\n\n스크립트 시작 부분에서, 홈잉 미사일 프리팹을 호출해요. 레이더는 프리팹의 자식 객체이기 때문에 transform.parent를 사용해서 찾을 수 있어요. 그렇게 함으로써 올바른 게임 오브젝트를 찾고 있는지 확인할 수 있어요. 홈잉 미사일은 레이저의 한 형태로 될 것이기 때문에(보호막 펄스와 같이 전체 새로운 스크립트가 아니에요), 호출해야 하는 컴포넌트는 레이저야.\n\n![Screenshot](/assets/img/2024-05-15-CreatingaHomingProjectile_7.png)\n\n이 구체적인 레이더에 radarID를 2로 설정한 후, 적과 충돌할 때마다 Laser 스크립트(아래 참조)에서 HomingMissile(GameObject) 메소드를 호출합니다 (검출된 적을 GameObject 필드에 전달함).\n\n## 호밍 미사일의 동작 결정\n\n![Screenshot](/assets/img/2024-05-15-CreatingaHomingProjectile_8.png)\n\n레이저 스크립트 내에서 HomingMissile(GameObject) 메서드는 두 가지 새 변수와 함께 작동합니다. 하나는 \\_lockedOn이 달성되었는지를 결정하고, 두 번째는 \\_lockedOnTarget을 결정하는 데 사용됩니다.\n\n\\_lockedOnTarget이 결정되면, null인 if 문을 사용하여 호밍 미사일이 경로상의 다른 적에 잠기지 않도록 방지합니다. 이렇게 함으로써 애니메이션 및 게임 플레이가 더 부드럽고 직관적으로 보입니다.\n\n![이미지](/assets/img/2024-05-15-CreatingaHomingProjectile_9.png)\n\n이러한 변수들은 Update 메서드 내에서 사용되어 \\_lockedOnTarget으로 Vector3.MoveTowards를 수행합니다.\n\n이 방법 이외에는, 호밍 미사일은 일반 레이저 발사와 동일하게 작동합니다. 그래서 새로운 레이저 ID를 만들거나 다른 동작을 지정할 필요가 없었습니다. 이는 표준 레이저가 사용하는 이동 및 파괴 명령을 사용합니다. 그리고 HomingMissile 방법은 오직 호밍 미사일 파워 업이 활성화된 경우에만 호출되며, 이는 순서상 Prefab이 생성될 때뿐입니다.\n\n이 모든 것이 함께 작동하여, 플레이어는 다음 레벨로 진행하기 위해 특별한 호밍 미사일을 사용할 수 있습니다.\n","ogImage":{"url":"/assets/img/2024-05-15-CreatingaHomingProjectile_0.png"},"coverImage":"/assets/img/2024-05-15-CreatingaHomingProjectile_0.png","tag":["Tech"],"readingTime":4},{"title":"세상에서 가장 최악인 아티잔 칵테일들","description":"","date":"2024-05-15 23:29","slug":"2024-05-15-TheWorldsWorstArtisanalCocktails","content":"\n# 꼭 시도해봐야 할 취향저격 음료! 🍹\n\n![이미지 1](/assets/img/2024-05-15-TheWorldsWorstArtisanalCocktails_0.png)\n\n![이미지 2](/assets/img/2024-05-15-TheWorldsWorstArtisanalCocktails_1.png)\n\n![이미지 3](/assets/img/2024-05-15-TheWorldsWorstArtisanalCocktails_2.png)\n\n![Image 3](/assets/img/2024-05-15-TheWorldsWorstArtisanalCocktails_3.png)\n\n![Image 4](/assets/img/2024-05-15-TheWorldsWorstArtisanalCocktails_4.png)\n\n![Image 5](/assets/img/2024-05-15-TheWorldsWorstArtisanalCocktails_5.png)\n\n![Image 6](/assets/img/2024-05-15-TheWorldsWorstArtisanalCocktails_6.png)\n\n![Image](/assets/img/2024-05-15-TheWorldsWorstArtisanalCocktails_7.png)\n\nShebani Rao는 일반적으로 필라델피아에서 무언가를 쓰고 그리는데, 음식을 먹으면서 하는 경우가 많습니다. 그녀는 McSweeney’s, The Seventh Wave, LitHub, The Margins, Buzzfeed 등 다양한 잡지에 기고한 경험이 있습니다. Instagram에서 @shebanimal 또는 shebanirao.com에서 그녀를 만날 수 있습니다.\n","ogImage":{"url":"/assets/img/2024-05-15-TheWorldsWorstArtisanalCocktails_0.png"},"coverImage":"/assets/img/2024-05-15-TheWorldsWorstArtisanalCocktails_0.png","tag":["Tech"],"readingTime":1},{"title":"전문 B2B 인터페이스를 디자인하면서 얻은 5가지 통찰력","description":"","date":"2024-05-15 23:27","slug":"2024-05-15-5insightsfromdesigningprofessionalB2Binterfaces","content":"\n![Professional Interfaces](/assets/img/2024-05-15-5insightsfromdesigningprofessionalB2Binterfaces_0.png)\n\n프로페셔널 인터페이스와 소프트웨어 작업을 처음 시작했을 때, 그 주제에 대한 자원 부족과 일반적인 지식의 부족에 놀랐습니다. 매체(Medium), LinkedIn 게시물을 끝없이 스크롤하고 수시로 비디오를 시청했지만 원하는 내용을 찾지 못했습니다. 아마 게으르게 행동하고 있었을 수도 있었겠죠. 탐구하지 않고 본인 스스로 찾아야 할 정보를 받아먹고자 했을 수도 있었겠죠. 또는 이미 다른 사람들이 만든 플랫폼을 찾고자 스마트하게 행동하고 있었을 수도 있죠. 어찌되었든, 1년 반 동안 디자인의 반대편, 고객 경험의 좋지 않은 형제인 프로페셔널 인터페이스에 몰입한 후, 여러분이 직원들에게 최상의 도구를 제공할 수 있도록 도와주는 내 인사이트와 배운 것들을 공유하고 싶습니다.\n\n# 1. 간단하게 유지하라\n\n이 흔히 알려진 디자인 클리셰가 여기서 완전히 적용됩니다. 보여줄 필요가 있는 것만, 보여줘야 하는 시기에만 화면에 보여주면 인터페이스의 효율성을 크게 향상시킬 수 있습니다.\n\n존재하는 것을 의심하고 필요한 것에 집중함으로써 작업을 빠르게 완료할 수 있고, 자리를 만들어 더 많이 완료하고 결국 더 많이 발전시킬 수 있습니다.\n\n## 2. 명확해지기\n\n현장에서 사람들과 함께 발견한 가장 큰 답답함 중 하나는 은유를 싫어하는 것이었습니다. 오늘날 고객 중심의 콘텐츠를 살펴보면 대부분 마케팅 태도로 빛나고 즐거운 제품 설명으로 가득차 있는데, 그 이유는 충분히 좋기 때문입니다. 그러나 전문 인터페이스에서는 아무것도 팔려고 하지 않습니다. 그래서 팔려고 하지 마세요. 우리가 발견한 것은 더 짧으면 더 명확하고, 더 명확하면 더 좋다는 것입니다.\n\n일반적으로 귀하의 기술자들을 위한 최고이며 가장 효율적인 경험을 원한다면 긴 텍스트 벽과 화려한 복사본을 버리고 직접적으로 표현하세요. 제가 말씀드립니다, 그들은 그것을 사랑할 것입니다.\n\n# 3. 디자인을 크게 만들어보세요; 정말 크게\n\n느립하고 까다로운 소프트웨어보다 나쁜 것은 없습니다. 전문 사용자들과 상호작용할 때 이 효과가 100배로 확대될 수 있습니다. Apple의 Human Interface Guidelines나 Microsoft의 Fluent 2 Design System과 같은 보편적인 디자인 시스템은 터치 대상을 48px부터 60px 사이로 지정합니다. 이런 사양은 데스크톱 웹사이트나 모바일 전화에 적합하지만, 현장에서 작업하는 기술자들이 이 사양을 준수하는 구성 요소와 상호 작용하는 데 어려움을 겪는 것을 발견했습니다.\n\n![í´ë¦¬ ê¸ ë¶ì!](/assets/img/2024-05-15-5insightsfromdesigningprofessionalB2Binterfaces_1.png)\n\n## 그래서 우리는 무엇을 했나요?\n\n대상을 약 96px로 늘려서 명확한 AAA 접근 가능 상태로 만들어 선택 사항을 명확하게 인식할 수 있도록 합니다. 이것은 '느림과 세부적인' 문제를 해결할 뿐만 아니라, 기술자가 두꺼운 장갑을 끼고 선택을 하려고 할 때 실수를 방지하는 데 도움이 되었습니다. 그들은 편안하게 대상을 터치할 수 있었고, 시스템은 어려운 조건에서도 기술자에게 선택에 대한 명확한 피드백을 제공하여, 예를 들어 화면이 눈부심으로 가려진 경우에도 도와주었습니다.\n\n![image](/assets/img/2024-05-15-5insightsfromdesigningprofessionalB2Binterfaces_2.png)\n\n# 4. 성공을 향한 길이 되어 성공을 이끄는 길이 되어라\n\n기술자들과 시간을 보낸 뒤, 한 가지 흔한 문제에 대해 밝혀냈습니다. 우리 도구에는 유연성이 없었습니다. 보통 현장 프로세스와 회의는 아무 문제 없이 원활히 진행되지만 가끔씩 문제가 발생했을 때 보고할 경로가 없었습니다.\n\n예를 들어, 저희가 작업한 소프트웨어 중 하나는 기술자들이 현장 작업을 문서화하고 제출할 수 있는 기능을 제공했습니다. 저희는 시스템에서 이러한 제출물 중 일부가 완전히 비어 있는 것을 발견했습니다. 이에 대한 두 가지 가능한 이유는 있습니다:\n\n- 시스템 문제였을 수 있습니다 (걱정하지 마세요, 확인한 결과 문제가 없었습니다)\n- 일부 기술자가 비어 있는 제출물을 작성한 것일 수 있습니다\n\n이제 이것을 기술자들의 업무 윤리나 관리가 떨어진 것으로 가정하는 것이 쉬운 길일 수 있지만, 우리가 발견한 것은 때로는 기술자들이 다양한 이유로 필요한 것을 제대로 문서화할 수 없었던 경우도 있었음을 알게 되었습니다. 이전 기술자가 작업을 제대로 완료하지 않은 경우, 이전에 설치된 장치가 테스트되지 않았고 작동하지 않는 경우 등이 그 이유였습니다.\n\n우리는 기술자가 여전히 비어 있는 제출물을 제출할 수 있도록 결정했지만, 이를 확인하는 것은 우리의 인터페이스가 아닌 품질 관리 부서의 책임이 되었습니다. 또한, 우리의 조사 결과, 소프트웨어에 '문제 제출' 경로를 도입하여 기술자들이 무엇이 잘못되었는지 또는 왜 업무를 제대로 제출할 수 없었는지에 대한 피드백을 제공할 수 있도록 하여, 그들의 업무 품질과 총 배포 품질을 크게 향상시켰습니다. 오늘의 교훈: 조금 더 앞으로 나아가고, 모든 것을 의심하며, 당신의 도구를 사용하는 사람들에게 최선을 다하세요.\n\n<img src=\"/assets/img/2024-05-15-5insightsfromdesigningprofessionalB2Binterfaces_3.png\" />\n\n# 5. 관련 요소 연결하기\n\n많은 회사에서 모두가 서로가 무엇을 하는지 알고 있다거나 누군가 다른 사람이 무엇을 하는지 좋아한다고 생각하는 것은 현실적이지 않을 수 있습니다. 이러한 일반적인 인식의 부족은 자원의 중복, 팀이 매우 유사한 프로젝트에 노력을 기울이는 경우, 책임이 여러 팀을 넘나드는 등을 초래할 수 있습니다.\n\n만약 \"내가 작업 중인 것에 필요한 중요한 것이 필요해\"라고 생각하고 있다면 (회사가 충분히 크다면) 이미 그것을 가지고 있는 사람이 있을 확률이 높습니다. 이러한 팀을 찾아 연결하고 함께 비전을 세워 더 적게 개발하고 더 많은 영향을 줄 수 있습니다.\n\n마무리하며, 대규모 기반 구축을 위한 전문 인터페이스 및 도구를 설계하여 효율적으로 작동하는 것은 정확한 과학보다는 예술에 가깝습니다. 더 고객 중심적인 프로그램에서 갖게 될 자세와는 다소 다른 사고 방식이 필요합니다. 자신의 접근 방식을 의심하고 급격히 다른 상황과 시나리오에 적응하며 직면하는 장애물을 극복해야 합니다. 이러한 도전에 맞서기 위해 기억해야 할 사항은 다음과 같습니다:\n\n- 단순하게 유지하세요\n- 명확하게 표현하세요\n- 대규모로 디자인하세요\n- 길이 되어 주세요\n- 점과 점을 잇어 주세요\n\n이 모든 것을 거쳐서, 최고의 경험을 제공하고 그들이 최선을 다하도록 하는 도구를 제공하는 결과물을 얻길 바랍니다.\n","ogImage":{"url":"/assets/img/2024-05-15-5insightsfromdesigningprofessionalB2Binterfaces_0.png"},"coverImage":"/assets/img/2024-05-15-5insightsfromdesigningprofessionalB2Binterfaces_0.png","tag":["Tech"],"readingTime":4},{"title":"피드백으로부터의 성장 트렌디올 판매자 센터에서 제품 카테고리 페이지를 재디자인하는 여정","description":"","date":"2024-05-15 23:25","slug":"2024-05-15-FromFeedbacktoActionTheJourneyofRedesigningtheProductCategoryPageinTrendyolMealSellerCenter","content":"\n\n트렌디올에서는 항상 데이터 주도의 의사 결정에 큰 중점을 두고 왔습니다. 우리는 고객 피드백에서 얻은 통찰을 중요하게 생각하고 팀으로 협력하여 개선해 왔습니다. 지속적인 개선을 약속한 회사로서, 우리는 고객의 목소리를 듣고 그들의 요구에 대처하기 위한 적극적인 조치를 취하는 중요성을 알아차립니다. 우리는 트렌디올 판매자 센터의 제품 카테고리 페이지 재설계 여정을 격려하는 우수성과 협력에 대한 이 약속 때문에 나아갈 수 있었습니다.\n\n# 고통 포인트 식별\n\n지속적인 사용자 피드백 추적 및 사용자 설문\n\n트렌디올 판매자 센터에서 제품 카테고리 화면은 음식점 주인들이 제품을 관리하고 추적하는 데 중요합니다. 그러나 이러한 화면에는 사용자가 효과적으로 사용하기 어렵게 만든 몇 가지 문제점이 있었습니다. Hotjar를 통해 수집한 사용자 피드백을 통해, 제품 카테고리 화면의 복잡성과 제품 분류 트리 구조를 이해하기 어려워했으며 시각적 디자인에 만족하지 못했다는 것을 발견했습니다.\n\n\n\n이 피드백에 대한 대응으로, 저희는 이 도메인의 제품 매니저, UI/UX 디자이너 및 UX 연구자로서, Trendyol Meal Seller Center 제품 카테고리 화면의 재설계 작업을 시작하기로 결정했습니다. 그러나 이 결정을 내리기 전에, 현재 문제를 더 잘 이해하고 사용자의 기대를 결정하기 위해 포괄적인 연구 및 분석 작업에 착수했습니다.\n\n우리는 580명의 참가자와 다양한 질문이 포함된 설문 조사를 실시하여 사용자들의 생각과 요구사항을 파악하기 위한 통찰을 얻었습니다.\n\n사용자들에게 질문한 몇 가지는 다음과 같았습니다:\n\n- 이 진술에 동의하십니까?: 카테고리 페이지를 유용하다고 생각합니다. (척도 0-7)\n- 이 진술에 동의하십니까?: 카테고리 페이지를 쉽게 변경할 수 있다고 생각합니다. (척도 0-7)\n- 이 진술에 동의하십니까?: 카테고리 페이지에 제시된 용어 (카테고리, 제품, 옵션)가 이해하기 쉬울 것이라고 생각합니다. (척도 0-7)\n\n\n\n우리의 연구와 분석 결과는 매우 유익했어요. 조사 결과에 따르면:\n\n- 현재 화면의 사용성은 7점 만점에 5.3점을 받았어요.\n- 사용 편의성은 7점 만점에 5.5점을 받았어요.\n- 버튼 및 제목 라벨링은 7점 만점에 5.4점을 받았어요.\n\n이 모든 데이터와 함께 사용자들의 생각을 함께 살펴보았어요.\n\n또한, 사용자 중 60.8%가 개선이 필요하다고 언급했는데, 이는 저희의 재설계 결정을 지지하는 중요한 데이터로 작용했어요.\n\n\n\n# 프로세스를 시작하기 전에\n\n평가지표, 데이터 분석 및 디자인 워크샵\n\n우리는 손에 데이터와 평가지표를 쥐고 디자인팀을 모아 디자인 워크샵을 개최하여 아이디어를 논의하고 사용자 경험을 더 개선하기 위한 주요 우선 순위를 파악했습니다.\n\n저희의 워크샵 일정은 다음과 같았습니다:\n\n\n\n- 데이터와 연구 결과를 검토하고 사용자의 일반적인 요구를 이해하려 노력합니다.\n- 벤치마킹을 검토하고, 좋다고 생각하는 체험적 또는 시각적인 포인트를 식별합니다.\n- 사용성, 이해 가능성 및 시각적 측면에서 실시간 화면을 평가합니다.\n- 혁신적인 아이디어 생성하기\n- 워크샵 세션 중에 모든 아이디어에 우선순위를 매깁니다.\n\n워크샵 세션 후에는 비즈니스 및 제품 관리 동료들과 긴밀히 협력하여 재설계 계획을 추진하는 동안 모두가 같은 방향으로 나아가도록 확실히 했습니다.\n\n![이미지](/assets/img/2024-05-15-FromFeedbacktoActionTheJourneyofRedesigningtheProductCategoryPageinTrendyolMealSellerCenter_0.png)\n\n# 실행하기\n\n\n\n재설계 과정\n\n제품 매니저와 워크샵 결과물을 우선순위로 정한 후에 우리는 재설계 과정을 시작했습니다. 이 과정에서 특히 다음을 주의 깊게 고려했습니다:\n\n- 사용자들이 더 잘 이해할 수 있도록 카테고리 화면에서 제품 트리 구조를 단순화하는 것.\n- 제품들의 분류를 명료하게하고 탐색을 쉽게하기 위해 중첩 접기 구조를 도입하는 것.\n- 정보 및 버튼 배치를 최소화하여 혼잡을 줄이고 필수 요소에 집중할 수 있도록 하는 것.\n- Trendyol Meal Seller Center의 정립된 디자인 표준 및 구성 요소를 사용하여 배운 습관과 패널 전체에서 사용하기에 적합한 것.\n\n# 디자인에서 개발로\n\n\n\n프로토타입 테스트\n\n디자인 작업을 완료한 후에는 프로토타입 테스트를 진행했습니다. 프로토타입 테스트에서는 사용자들에게 샘플 화면에서 2가지 작업을 수행해달라고 요청했고, 그들의 성공률, 오류 클릭 수 및 올바른 영역을 찾는 평균 소요 시간을 살펴보았습니다:\n\n1. \"더블 피자 메뉴\" 제품 내 \"더블 메뉴\" 카테고리 아래에 \"음료 선택\" 옵션을 추가하고 싶다고 가정했을 때, 어디에 어떻게 추가해야 할까요?\n\n![화면 샘플](/assets/img/2024-05-15-FromFeedbacktoActionTheJourneyofRedesigningtheProductCategoryPageinTrendyolMealSellerCenter_1.png)\n\n\n\n이 미션 결과를 살펴보면:\n\n- 사용자들 중 34%가 기대한 경로를 통해 시험을 성공적으로 완료했습니다.\n- 올바른 클릭 지역을 찾는 평균 시간은 74.8초입니다.\n- 총 잘못 클릭 비율은 80.8%입니다.\n\n우리가 결과를 바탕으로 내린 결론은 다음과 같습니다:\n\n- 히트맵에 따르면, 모든 사용자(실패한 사용자 및 성공한 사용자)가 먼저 'Ürün Ekle' 및 'İşlemler' 버튼을 클릭하여 추가 옵션 디자인 요소를 보았습니다.\n- 여기에 옵션을 추가하려는 사용자들이거나 여기서 메뉴를 열 수 있다고 생각한 것으로 볼 수 있습니다. 따라서 성공률이 낮습니다.\n- 혼잡하고 혼란스러운 버튼을 피하기 위해 사용자는 카테고리 페이지의 세부 정보로 설계된 페이지로 이동하여 카테고리 작업을 수행할 수 있습니다.\n- 카테고리 이름 옆에 있는 버튼은 아코디언 메뉴 구조 안으로 삽입되어 명확해질 수 있습니다.\n\n\n\n2. \"햄버거 메뉴\" 카테고리를 판매를 마감하고 싶다면 어디에서 어떻게 할까요?\n\n<img src=\"/assets/img/2024-05-15-FromFeedbacktoActionTheJourneyofRedesigningtheProductCategoryPageinTrendyolMealSellerCenter_2.png\" />\n\n이 임무의 결과를 살펴보면:\n\n- 사용자 중 83.6%가 기대한 경로를 통해 테스트를 성공적으로 완료하였습니다.\n- 올바른 클릭 영역을 찾는 평균 소요 시간은 11.5초 입니다.\n- 총 오작동 비율은 69.2%입니다.\n\n\n\n결과에 따르면 다음과 같은 사실을 알 수 있습니다:\n\n- 판매를 위해 카테고리를 닫는 새로운 디자인이 성공적입니다.\n\n이 조사를 통해 소프트웨어 개발 단계로 전진하기 전에 필요한 개선 사항을 반영할 수 있었습니다. 이 반복적인 프로세스를 통해 우리의 디자인이 사용자들과 공감되도록 보장할 뿐만 아니라, 나중에 재작업과 비용을 절약할 수 있었습니다.\n\n![이미지](https://miro.medium.com/v2/resize:fit:1400/1*RUsyNdtm57ll2lAb5RBdMg.gif)\n\n\n\n# 향후 계획\n\n지속적인 사용자 피드백 추적\n\n새로운 화면이 출시된 후, 우리는 적극적으로 피드백을 수집하고 필요에 따라 개선을 하고 있습니다. 앞으로도 사용자 경험을 향상시키는 데 주력할 것입니다. 사용자의 요구를 더 잘 충족시키기 위해 우리는 계속된 노력에 전념하고 있습니다.\n\n# 마무리하며…\n\n\n\n저희는 Trendyol Meal Seller Center의 제품 카테고리 페이지를 재디자인하는 여정을 데이터 주도의 의사 결정과 사용자 중심의 디자인에 중점을 둔 강력한 헌신으로 이끌고 있습니다. 철저한 연구, 분석 및 사용자 피드백을 통해 주요 도전과 개선 기회를 확인하여 포괄적인 재디자인 작업을 위한 길을 열었습니다.\n\n다항적인 팀 간의 협력과 명확한 커뮤니케이션을 우선시함으로써 사용자 요구를 충족시키고 카테고리 화면의 사용 편의성을 향상시킬 수 있었습니다. 프로토 타입 테스트와 지속적인 피드백 수집을 중시한 디자인 과정은 우리의 솔루션이 사용자 인사이트를 바탕으로 하고 사용 편의성 문제를 효과적으로 해결할 수 있도록 보장했습니다.\n\n우리는 계속해서 사용자의 목소리에 귀 기울이고 그들의 변화하는 요구에 적응하며 탁월한 가치와 사용 편의성을 제공하기 위해 플랫폼을 개선해 나갈 것입니다.\n\n\n\n# 특별감사 인사\n\n## 더 강해진 팀으로\n\n이번 재설계 여정의 모든 단계에서 소중한 데이터 통찰을 계속 제공해주고 사용자와 우리 사이의 다리 역할을 해온 UX 연구자 Reyhan İkan에게 감사의 말씀을 전하고 싶습니다. 또한, 이 프로젝트를 우선시하는 데 중요한 역할을 한 제품 매니저 Bilgesu Özge Aslantaş와 Meal 제품 개발팀에게도 감사의 인사를 전합니다.\n\n게다가, 디자인 과정 중에 지도해주시고 굳건한 지원을 보내주신 Marketplace UX 팀에 대해 매우 감사하며, 이 글을 쓰도록 격려해주신 제품 디자인 책임자 Franco Ejder Ortiz에게 감사의 마음을 표현하고 이를 형성하는 데 지속적인 도움을 주신 UI/UX 디자인 리드 Cenk Yılmaz에게도 깊은 감사를 드립니다.\n\n\n\n저희는 산업 분야에서 가장 밝은 두뇌들로 팀을 구축 중이에요. 함께 하고 싶으시다면 아래 페이지를 방문해 열려있는 포지션에 대해 더 알아보세요.","ogImage":{"url":"/assets/img/2024-05-15-FromFeedbacktoActionTheJourneyofRedesigningtheProductCategoryPageinTrendyolMealSellerCenter_0.png"},"coverImage":"/assets/img/2024-05-15-FromFeedbacktoActionTheJourneyofRedesigningtheProductCategoryPageinTrendyolMealSellerCenter_0.png","tag":["Tech"],"readingTime":5},{"title":"전진 장식 글꼴","description":"","date":"2024-05-15 23:23","slug":"2024-05-15-MoveOnDecorativeFont","content":"\n![image 0](/assets/img/2024-05-15-MoveOnDecorativeFont_0.png)\n\n![image 1](/assets/img/2024-05-15-MoveOnDecorativeFont_1.png)\n\n![image 2](/assets/img/2024-05-15-MoveOnDecorativeFont_2.png)\n\n![image 3](/assets/img/2024-05-15-MoveOnDecorativeFont_3.png)\n\n🔍 지금 \"Move On\"을 확인해보세요! 📁 이 장식 폰트를 탐험하고 여기에서 🆓 무료 다운로드를 받으세요. 함께 제작을 시작해봐요! 🚀\n\n\"Move On\"을 소개합니다 — 귀여운 장식 디스플레이 폰트로 여러분의 디자인 프로젝트를 새로운 높이로 끌어올릴 거예요. 우아하고 복잡한 디테일이 특징인 \"Move On\"은 모든 창조적 노력에 세련미와 매력을 더할 수 있는 완벽한 선택이에요.\n\n현대 디자이너를 염두에 두고 디자인된 \"Move On\"은 인쇄물과 디지털 애플리케이션 모두와 완벽하게 호환됩니다. 고해상도 포스터나 섬세한 웹사이트 디자인에 작업하더라도, \"Move On\"은 놀랍도록 명확하고 가독성이 좋아서 메시지가 선명하게 전달될 것이에요.\n\n그럼 어서요! \"Move On\"으로 여러분의 디자인 프로젝트를 새로운 높이로 끌어올려 보세요 — 아름다움, 다재다능성, 세련미가 한 패키지 안에 모두 결합된 장식 디스플레이 폰트를 지금 바로 다운로드 받고 여러분의 창의력을 비행시켜보세요.\n\n위에 언급된 파일들을 포함한 zip 파일입니다:\n\n- Move On OTF\n- Move On TTF\n- Move On WEBFONT-TT\n\n감사합니다!\n\n## 상품 태그\n\n# 장식적 # 디자인 # 폰트 # 아트 # 타이포그래피 # 재치있는 # 코믹 # 만화 # 필기체 # 서체 # 재미있는 # 풍부한 # 디스플레이 # 서체 # 타이틀\n\n## 추가\n\n웹 글꼴\n\n## 분류\n\n표태그를 마크다운 형식으로 바꿉니다.\n\nN/A\n\n## 간격\n\n보통\n\n## 최적 크기\n\n어떤 크기도 괜찮아요\n\n## 상업용 라이선스\n\n더 많은 정보\n\n## 비슷한 폰트\n\n더 보기\n\n![Deconator — Decorative Font by MightyFire_STD](/assets/img/2024-05-15-MoveOnDecorativeFont_4.png)\n\n![Deconator — Decorative Font by MightyFire_STD](/assets/img/2024-05-15-MoveOnDecorativeFont_5.png)\n\nShifters — MightyFire_STD가 디자인한 장식용 코믹 글꼴\n\n![Shifters](/assets/img/2024-05-15-MoveOnDecorativeFont_6.png)\n\nLikha Playful Display Typeface by studiotopia\n\n![Likha](/assets/img/2024-05-15-MoveOnDecorativeFont_7.png)\n\n로날도 - epdesigns가 디자인한 쿼키하고 재밌는 서체입니다\n\n## MightyFire_STD에서 더 많은 것을 만나보세요\n\n더 많은 것을 보려면 [여기](/assets/img/2024-05-15-MoveOnDecorativeFont_8.png)를 클릭하세요\n\n**고스트 서명** - MightyFire_STD가 직접 손으로 써 만든 서명 폰트\n\n![고스트 서명](/assets/img/2024-05-15-MoveOnDecorativeFont_9.png)\n\n**베스트 프렌** - MightyFire_STD가 직접 손으로 써 만든 손글씨 폰트\n\n![베스트 프렌](/assets/img/2024-05-15-MoveOnDecorativeFont_10.png)\n\nTypehunter — MightyFire_STD에서 만든 필기체 타이포라이터 글꼴\n\n![이미지](/assets/img/2024-05-15-MoveOnDecorativeFont_11.png)\n\nMelted Beef — MightyFire_STD에서 만든 필기 모노라인 글꼴\n","ogImage":{"url":"/assets/img/2024-05-15-MoveOnDecorativeFont_0.png"},"coverImage":"/assets/img/2024-05-15-MoveOnDecorativeFont_0.png","tag":["Tech"],"readingTime":3},{"title":"이 모자에 토끼 없어요","description":"","date":"2024-05-15 23:21","slug":"2024-05-15-TheresNoRabbitInThisHat","content":"\n![image](https://miro.medium.com/v2/resize:fit:1400/1*W77L6syXpU-aUDV44F5zCQ.gif)\n\n이전에 \"이 회의는 이메일로 대체할 수 있었을 거예요.\"라는 얘기가 있었지만, 요새는 새로운 이야기가 있네요.\n\n\"이 장비는 앱이었을 수 있어요.\"\n\n인공지능(AI)에 대해 좋은 소식이 몇 주동안 없었습니다. 결함이 많은 Humane AI Pin의 출시가 있었고, Meta의 AI가 이상한 말을 하는 이상한 이야기가 있었으며, 플랫폼에 과도하게 존재하는 AI 생성 콘텐츠 — 죽은 어린이들의 바이럴 이미지를 포함한 것 — 이 남아 있는 사용자 경험을 망쳐놓았습니다. OpenAI의 Sora 출시에 대한 기대감을 깨뜨리는 비디오가 나왔는데, 실제로 이 장비로 많은 출시 비디오를 만든 회사가 이를 사용할 때 상당한 후 처리가 필요했고, 프롬프트에서 결과를 얻는 것은 \"슬롯머신과 같다\"고 밝혔습니다. 그리고 이제 Rabbit r1의 출시가 있었고, 그렇습니다, 또 다른 미완성되고 제대로 작동하지 않는 장비가 나왔습니다. 이 장비는 약속한 것의 거의 없고, 할 수 있는 것들도 아주 느리고 아주 잘못하고 있습니다. 하지만, 적어도 색깔이 예쁘다고 말할 수 있을까요?\n\n만약 증거가 필요하시다면, Rabbit 창업자 Jesse Lyu가 라이브 오디언스 앞에서 DoorDash에서 주문하려고 하는 과정을 보여주는 이 귀찮은 비디오를 시청해보세요. 이 비디오는 정말 지루하고 처음에는 작동하지 않아요. 출시 초기에 디바이스가 통합 가능한 앱 중에 DoorDash가 네 개 중 하나인 점을 고려하면, 시작이 좋지 않다고 할 수 있어요. 이에 더해, '거의 아무것도 하지 않는 멋진 디바이스'라는 내용의 대부분의 부정적 리뷰들 뒤엔 Rabbit에 대한 찬양이 담겨 있어요. 인공 지능 디바이스는 분명한 트렌드를 세우고 있지만, 그들이 목표로 한 '다음 스마트폰 대세'는 아직 아닌 것 같아요.\n\n라이언 브로더릭이 그것을 어떻게 표현했는지가 정말 맘에 드네요. 그의 뉴스레터 'Garbage Day'에 나와 있어요 — \"맛있다.\" Dave2D의 이 비판도 훌륭한 마이크 드롭 순간이었어요.\n\n물론, Rabbit 창업자들은 '문제가 있어도 출시하라' 전략을 철저히 따라왔어요. 디바이스에 대한 비판에 대해 — 사용 용도 부족, 느림과 버벅거림, 최악의 배터리, 불편한 사용성 등 — 늘 하는 대응 방법인 미래 기능 로드맵, 약속 및 '우리는 작은 팀이니까 시간을 주세요' 같은 불쌍한 호소로 대응했어요. 그러나 소비자들은 이제 이러한 속임수에 지친 것으로 보여요. Rabbit의 PR의 방어적인 성격도 도움이 되지 않았죠. 당신의 작품을 헐뜯기는 것이 짜증나는 건 이해하지만, 다시 반격하면 유일한 옵션이 아닙니다. 그렇게 하면 오히려 비난이 더 빗발치게 됩니다 — 그리고 비난이 쏟아지고 있다는 걸 어찌나 이해하지 못하는지요.\n\n닌티 해커들은 이 장치를 자세히 살펴보고, 앱이어야 할 장치가 실제로 앱임을 발견했습니다. 이 장치는 내부에서 안드로이드를 실행하며 사용자가 상호 작용하는 전체 인터페이스는 단일 안드로이드 앱으로 구동됩니다. Rabbit의 창립자들은 이것이 사실이 아니라고 반박했지만, 그들은 또한 \"토끼 OS와 LAM이 매우 특별한 AOSP로 클라우드에서 실행된다\"고 발언했습니다. AOSP는 안드로이드 오픈 소스 프로젝트이며, 어떤 종류의 클라우드 서비스에 대한 구독이 없다는 사실에서 클라우드 주장이 다소 의심스러운 것 같습니다.\n\n한 AI 연구원이 유출 된 (이제 삭제된) 소스 코드의 화면 몇 개를 공유했는데, 그 장치 뒤에 인공 지능이 전혀 없다고 주장했습니다. 다른 사람은 네 개의 앱에 로그인하는 과정이 다소 수상하고 잠재적으로 보안에 취약하다는 것을 발견했습니다 - 이것은 Rabbit이 사용자의 자격 증명을 볼 수 있게 할 수 있습니다. 앗츄!\n\n이것은 제 전문 분야가 아니지만, 창립자들이 판매하고 있는 것만큼 AI 장치는 아닌 것 같습니다. 우리는 이것이 예견해야 할 사실이었어야 했는데요. 누군가가 창립자의 과거를 연구하고 제시가 이전에 'Gama'라는 사기 NFT 프로젝트를 주도했던 것을 발견했습니다. (다른 버려진 웹3 꿈 악몽에 대한 자세한 내용이 있는 좋은 쓰레드가 여기 있습니다.)\n\n누가 이것을 예상했을까요?\n\n그거야, NFT를 사용한 AI 교체의 또 다른 사례야. 이 시점에서 Jesse도 암호화폐에 손을 대본 적이 있을 것으로 가정해도 괜찮을 것 같네요. 그래프터 3배자가 완성됐네요.\n\n프로젝트에 대한 자세한 내용을 찾기 어려운 이유는 삭제되었기 때문이고, Jesse가 이에 대해 이야기하는 동영상 또한 삭제됐어요. 하지만 Web.Archive 덕분에 이 모든 정보를 확인할 수 있어요. 이 프로젝트가 얼마나 심각한지 알고 싶으세요? 이렇게 시작해요: \"Gama는 다음 세대 메타버스, 게임 스페이스 스테이션을 통해 미래의 원칙을 구축하고 있어요.\" 또한 \"새로운 엔터테인먼트의 세계를 약속합니다.\"\n\nGama가 다음 세대 메타버스를 이끌었나요? 또는 새로운 엔터테인먼트의 세계를 가져왔나요? 결코 아니에요. 이 프로젝트는 Jesse가 프로젝트의 Discord 채널에서 사라지고 초기 NFT 판매에서 많은 돈을 챙긴 정체불명의 행세를 한 것에 불과해요.\n\n뭔가 뜻하는 바가 있다는 걸 시사하려는 건 아니에요 — 설립자들은 늘 시도하고 실패해요 — 하지만 이전의 벤처를 숨기려 하고, 그 다음에 새로운 큰 혁신이 나타나는 걸 따라잡으려고 할 때, 그냥 잘 작동하지 않는 장치를 출시한다면... 모든 징후가 이 프로젝트가 폭로되기 전에 가능한 많은 돈을 빨아들이려고 했던 또 다른 프로젝트임을 가리키고 있어요. 솔직히 말해, 그 장치는 이미 죽은 상태에 가까워요. 팀은 약간의 업데이트를 발표하고 미래 가능성에 대해 크게 외칠 수 있겠지만, 관심은 그들이 한 모호한 약속을 이행하기도 전에 이미 식을 것이네요.\n\n예술 테크만으로 정한 것을 이건데 이건 리도 없어질거야.\n\n내 말 들어나보니, 나는 미래를 창조한다고 말하는 AI 전문가들이 절대적인 쓰레기만 제공하는 걸 지겨워해. Crypto에서 NFTs로 AI로 점프하는 그리프터들이 VC 자금과 소비자들의 자본을 태워가며 세상을 바꿀 것이라고 주장하면서 중요한 것을 생산하지 않겠다고 하는 거나 실하지 않아. Sam Altman과 같은 사람이 AGI를 만들기 위해 \"매년 50억 달러를 태워가도 상관없다\"며 열광적으로 언급할 때, AGI가 무엇이고 어떻게/왜 인류에게 이익이 될지 설명할 줄도 몰라. 이 사람은 도대체 뭐하는 사람이야? 누구든지 나에게 얘기하는 것이 어떻게 내 작업을 변경할지, 작업하지 않을지를 말하느니, 현존하는 결과물이 시장을 유일하게 하락시키는 것 뿐이라서 질려.\n\n현재 AI 명예평론은 현실과 완전히 연결이 끊겨 있다.\n\n만약 AI가 정말 혁명적일 것이라면, 증거를 제시할 때가 되었다. 더는 만약이고 그런다면이 아님. 높은 수준의, 세상을 바꿀 것이라는 발언도 아님. 한 사람들이 계속해서 중복되게 내뱉는 동일한 발언도 아님. 우리는 사회에 실제로 이익을 제공하는 유형의 현실적인 증거가 필요해.\n\n만약 Rabbit, Humane Pin, 그리고 ChatGPT가 최고 수준이라면, 이 혁명은 쉽게 사그라들 것 같아요.\n","ogImage":{"url":"/assets/img/2024-05-15-TheresNoRabbitInThisHat_0.png"},"coverImage":"/assets/img/2024-05-15-TheresNoRabbitInThisHat_0.png","tag":["Tech"],"readingTime":4},{"title":"CandyIcons AI Review 3단계로 쉽게 아이콘과 로고를 디자인해보세요","description":"","date":"2024-05-15 23:20","slug":"2024-05-15-CandyIconsAIReviewDesignYourOwnIconsandLogosin3SimpleSteps","content":"\n\n## CandyIcons은 참신한 AI 기술을 활용한 도구로, 앱 아이콘 및 로고 디자인 작업을 간편하게 만들어줍니다.\n\n마케터, SaaS 제공 업체 및 웹 디자이너를 대상으로 한 CandyIcons는 귀하의 아이디어를 세 번의 클릭만으로 아름답고 로열티 무료의 아이콘으로 변신시켜 줍니다. 최신 기술인 DALL·E 3 기술을 사용하며, CandyIcons를 통해 원하는 아이콘을 설명하고 색상과 스타일을 선택한 후, AI가 전문적인 품질의 아이콘을 생성하는 과정을 감상할 수 있습니다. 이 플랫폼은 무료 파비콘 생성기도 제공하며, 생성된 아이콘의 저작권 소유권을 완전히 보장합니다.\n\n👉🔥 이 기회를 놓치지 마세요 — “CandyIcons”을 놓치기 전에 지금 지급하세요! 🔥👈\n\n본 내용은 일부가 AI 기술을 활용하여 작성 과정을 개선하고 더 많은 통찰을 제공하는 데 도움을 준 부분이 포함되어 있습니다.\n\n\n\n# 사용자 경험\n\nCandyIcons를 사용하는 것은 전반적으로 긍정적인 경험입니다. 아이콘을 생성하는 것은 빠르고 간편합니다. 플랫폼은 반응이 빠르며 렉이 거의 없습니다. 완전한 저작권 소유권은 상당한 장점입니다. 그러나 현재의 15가지 스타일은 모든 디자인 요구를 충족시키지 못할 수 있습니다.\n\n# 기능성과 성능\n\nCandyIcons는 빠르게 고품질의 앱 아이콘과 로고 디자인을 생성하는 데 뛰어납니다. 사용자는 15가지 스타일 중에서 선택할 수 있고 색상을 사용자 정의하며 개인화된 아이콘을 즐길 수 있습니다. 파비콘 생성기는 애플 기기용으로 완벽한 크기의 파비콘을 생성합니다.\n\n\n\n# 장단점\n\n## 장점\n\n- AI를 이용한 쉽고 빠른 아이콘 생성\n- 다양한 라이브러리의 사전 제작된 아이콘\n- 생성된 아이콘의 저작권 소유권 보유\n- 무료 파비콘 생성기\n- 애플 기기용 완벽히 크기가 맞춰진 아이콘\n- 비용 효율적인 솔루션: 앱별 창작물 및 로고 디자인을 생성하는 데 예산 친화적인 옵션을 제공하여 디자이너 고용 비용을 절약합니다.\n\n## 단점\n\n\n\n- 아이콘 스타일이 제한되어 있습니다: 현재 사용자들은 15가지 스타일 중에서 선택할 수 있으며, 향후 업데이트에서 더 많은 스타일을 기대할 수 있습니다.\n- 제한된 사용자 정의 옵션: 사용 가능한 스타일은 감사하지만, 간단한 아이콘 필요에 더 잘 맞는 더 많은 제어 수준이 있었으면 좋겠습니다.\n- 제한된 배경 옵션: 배경 없이 아이콘을 다운로드할 수 있는 더 간단한 방법이 있었으면 좋겠습니다. 이 측면에 더 많은 제어를 제공합니다.\n\n# 주요 사항\n\n- CandyIcons는 텍스트 설명에서 앱 아이콘을 생성하기 위해 AI를 사용합니다.\n- 사용자는 아이콘의 색상과 스타일을 선택할 수 있습니다.\n- 이 플랫폼에는 수천 개의 미리 만들어진 아이콘 라이브러리가 포함되어 있습니다.\n- 생성된 모든 아이콘에 대한 완전한 저작권 소유권이 제공됩니다.\n- 무료 파비콘 생성기를 이용할 수 있습니다.\n- 아이콘은 모든 Apple 장치에 최적화되어 있습니다.\n\n# 비평적 사고\n\n\n\n캔디아이콘은 AI를 사용하여 앱 아이콘을 생성하는 편리하고 효율적인 방법을 제공하지만, 미리 정의된 스타일과 AI 생성 콘텐츠에 의존하는 창의적인 제약에 대해 의문을 제기할 수 있다. 창의적인 프로세스에서 AI 사용이 디자인 작업의 독창성과 독특성에 어떤 영향을 미칠 수 있을까요? 많은 사용자들이 유사한 AI 도구에 의존한다면 앱 아이콘 디자인의 동질화 위험이 있을 수 있을까요?\n\n# 비슷한 제품과 비교\n\n시장에서 다른 아이콘 생성 도구들과 비교했을 때, CandyIcons는 고급 AI 기술(DALL·E 3)과 다양한 미리 제작된 아이콘 라이브러리를 사용해 두드러지는 특징을 지니고 있습니다. 경쟁 업체들이 보다 많은 사용자 정의 옵션이나 스타일의 다양성을 제공할 수도 있지만, CandyIcons는 사용의 편의성과 품질 출력을 효과적으로 조화시키고 있습니다.\n\n\n\n## 최종 추천\n\n앱 아이콘과 로고 작성을 간단하게 하고 싶은 사람들을 위해 CandyIcons를 제안합니다. 일부 스타일만 제공되지만, 혜택이 이러한 단점을 상쇄합니다. 전문적인 앱 아이콘을 빠르고 저렴하게 만들고 싶다면, CandyIcons를 고려해보세요.\n\n👉🔥 특별 한정 CandyIcons 평생 이용권 거래를 지금 확인하세요! 👈","ogImage":{"url":"/assets/img/2024-05-15-CandyIconsAIReviewDesignYourOwnIconsandLogosin3SimpleSteps_0.png"},"coverImage":"/assets/img/2024-05-15-CandyIconsAIReviewDesignYourOwnIconsandLogosin3SimpleSteps_0.png","tag":["Tech"],"readingTime":3},{"title":"예쁘게 꾸미기만 하던 예전의 좋은 시절을 되살려보기","description":"","date":"2024-05-15 23:18","slug":"2024-05-15-Revivingthegoodoldaysofjustmakingthingslookpretty","content":"\n\n2006년 그래픽 디자이너로서 커리어를 시작했을 때 산업은 훨씬 간단했습니다. 당시에는 수십 가지 혼동스러운 직함이나 복잡한 업무 책임이 없었습니다. 우리의 일반적인 임무는 다양한 페이지의 웹사이트든 기본 엽서든 무엇이든 예쁘게 만드는 것이었습니다.\n\n2007년 iPhone의 출시로 디자이너로서의 의미가 영원히 바뀌었습니다. 기술이 진화함에 따라 디자이너들의 전형적인 작업은 인쇄물, 디지털, 물리적 미디어에서 일시적으로 변화했습니다.\n\n갑자기, 예쁘게 하는 일에 그쳤던 많은 사람들은 사용자 경험, 모바일 대응성, 정보 구조, 프론트엔드 개발의 영역을 탐험해야 했습니다.\n\n솔직히 말하자면, 나는 2012년까지 사용자 경험(UX)이라는 용어가 존재한다는 걸 몰랐습니다. 돈 노먼이 1993년에 처음 만든 용어인데요. 제 세계에서는 좋은 사용자 경험을 보장하는 것이 당연한 디자인이었습니다. 또한, 제품 디자이너는 주로 디지털이 아닌 물리적인 항목에 주력하는 줄 알았습니다.\n\n\n\n지금은 UX, UI 및 제품 디자인이라고 부르는 것과 같은 복잡한 레이블 없이 수많은 그래픽 및 웹 디자이너들이 다룬 일들이 있습니다.\n\n이러한 책임이 점점 확대되면서 디자이너들의 불만과 좌절이 커졌습니다. 세상은 여전히 우리가 그냥 미적인 디자인만 하는 것으로 책임이 있다고 생각하지만, 실제로 많은 디자이너들은 3명 또는 4명의 업무를 동시에 수행하고 있었습니다.\n\n다행히도 우리의 직업 인식이 변화하기 시작했습니다. 디자이너들은 비즈니스 영역에서 점차 중요시 여기기 시작했습니다. 갑자기 UX, UI 및 제품 디자인이라는 디자인 제목들이 나타나기 시작했습니다. 곧, 전통적인 그래픽 디자이너는 배경으로 물러나며 이러한 새로운 중요한 역할들이 더 의미 있다고 여겨지게 되었습니다.\n\n부트캠프가 생겨나기 시작하고, “디자인 씽킹”과 같은 아이디어가 대중화되기 시작했습니다. 마침내, 비즈니스들이 우리를 진지하게 받아들이기 시작했습니다.\n\n\n\n우리는 능력에 대한 보상을 받기 시작했습니다. 일부는 6자리 급여를 받으며... 디자인 직군에서 큰 성과였습니다.\n\n안타깝게도 닷컴 버블과 같이, 이 너무 좋아보이는 디자인 환경은 터질 운명입니다.\n\n2022년 11월 30일, 샌프란시스코를 기반으로 하는 OpenAI는 ChatGPT를 대중에 공개했습니다. 바위 아래서 사는 사람들을 위해, ChatGPT는 입력 값에 기반한 사람과 비슷한 응답을 생성할 수 있는 고급 대화형 AI 모델입니다.\n\nChatGPT는 그저 시작일 뿐이었습니다. 그 이후로 개발자들은 수백 가지의 디자인 관련 작업을 수행할 수 있는 AI 기반 애플리케이션을 출시했습니다. Google, Microsoft, Adobe, Figma와 같은 기업들은 이미 프로그램에 AI를 통합했습니다.\n\n\n\n누구나 인공 지능이 여러 디자인 직업들을 위협하고 우리가 얻은 발전을 침식할 것으로 예상되는 것을 알 수 있습니다. 몇몇 사람들은 이 전제에 동의하지 않을 수도 있지만, 나는 당신이 그 뿔 안경을 싸게 샀기를 소망합니다.\n\n많은 디자이너들은 이를 듣고 싶어하지 않을지도 모르지만, 지난 10년 동안 얻은 \"존경\"은 대부분 피상적입니다. 반복해서 세계에 디자인의 본질적 가치와 중요성을 설득하려는 것은 기업들을 언짢게 하고 교육하는 것은 실패의 요리법입니다.\n\n예를 들어, 디자이너들은 기업들이 사용자들을 신경 쓰지 않는다거나 특정 디자인 방법론을 채택한다면 수익을 증가시킬 수 있다는 것을 암시하는 것을 좋아합니다.\n\n이러한 주장들이 근거가 있을지라도, 나는 기업 세계에서 근무하면서 임원들과 비즈니스 인들이 엄청난 자아를 가지고 있다는 것을 배웠습니다. 그들을 도전하거나 그들의 지성이나 윤리를 의심한다면 우리가 진정으로 존경받을 기회를 손해보게 됩니다.\n\n\n\n테이블에 앉을 자격이 있음에도 불구하고, 길게 설득하지 않고 자연스럽게 얻어져야 합니다.\n\n그래서 인공지능에 교체될 직군 중에서는, 억양을 두는, 월급 높은, 모호한 디자이너 역할이 먼저 사라질 것입니다.\n\n만약 기업들이 비용을 줄이고 디자인 전략, 연구, 테스트, 제품/웹사이트 배포를 가속화할 수 있는 AI 단축키를 활용한다면, 그 기회를 쥐게 될 것입니다.\n\n대부분의 기업은 퀄리티보다는 양을 우선시합니다 - 그건 그들의 성격에 담긴 것입니다. 안타깝게도, 기업들이 많은 디자이너들의 일을 인공지능에 맡기게 되면, 알아차리는 사람은 단지 디자이너들 뿐일 것입니다.\n\n\n\n내가 낙천적이지 않다고 비판을 받을 수도 있지만, 무지개와 유니콘 이론의 다수와 대조되는 현실적인 시각을 제시하는 사람도 필요할 거야.\n\n하지만, AI 터널 끝에 빛이 보일지도 모르겠어.\n\n이런 소리가 얼마나 엉뚱한지 몰라도, 우리에게는 모든 것이 예쁘게 보이도록 하는 부굴부굴한 디자이너 시대로 돌아가는 게 최선의 선택일 수도 있겠어. 우리 직업이 복잡하지 않았고 우리가 무엇을 하는 지 설명하기 위해 세미나가 필요없었던 시절로 말이야.\n\nAI가 그래픽 디자이너도 대체할 것이라는 주장도 될 수 있어. 하지만, 나는 그래픽 디자이너가 문제를 해결하는 데 더 많은 자유롭고 인간적 창의력을 필요로 한다고 주장할 거야. 현재로서는 많은 사람들이 AI가 대체할 수 없다고 믿고 있는 분야야.\n\n\n\nAI의 위협 외에도, 디자인 산업은 동질성 위기에 시달립니다. 오늘날 우리가 사용하는 엄격한 라이브러리, 시스템 및 방법론으로 인해 모든 것이 비슷해 보이기 시작했습니다.\n\n사람들은 다시 독특하고 위험부담이 있는 재미있는 디자인을 간절히 원할 것입니다. 따라서 전통적인 그래픽 디자인이 부활할 가능성이 높습니다.\n\n좋은 디자인은 본질적으로 소통과 문제 해결에 관한 것이지만, 디자인의 매력적인 본질은 언제나 추상적인 사고와 규칙을 깨는 것이었습니다. 트렌드나 시스템을 따르는 것이 아니라 규칙을 어기는 것이었죠.\n\n일부 작업과 책임을 AI에 맡기는 것은 패배를 인정하는 것이 아니라, 디자이너가 연구자, 개발자 또는 비지니스 전문가가 되어야 할 운명이 아니었음을 인정하는 것입니다.\n\n\n\n우리는 예술적인 사람들로, 직감적으로 뭔가를 아름답게 만드는 데 능숙합니다. 향후 발전 방향을 고려하면, 더 간단한 시대로의 회귀는 매력적인 제안입니다.\n\n놓치지 마세요! 내 메일 목록에 가입하고 최신 콘텐츠를 받아보세요.","ogImage":{"url":"/assets/img/2024-05-15-Revivingthegoodoldaysofjustmakingthingslookpretty_0.png"},"coverImage":"/assets/img/2024-05-15-Revivingthegoodoldaysofjustmakingthingslookpretty_0.png","tag":["Tech"],"readingTime":4},{"title":"TypeScript에서의 싱글톤 디자인 패턴 파트 2 구현, 관련 패턴","description":"","date":"2024-05-15 23:16","slug":"2024-05-15-SingletonDesignPatterninTypeScriptPart2ImplementationRelatedPatterns","content":"\n제1부에서는 Singleton 디자인 패턴의 동기, 구조 및 결과에 대해 다루었습니다. 이제 구현과 관련 패턴을 다루겠습니다.\n\n언제나처럼, 이 글의 주요 참고 자료는 책 \"디자인 패턴: 재사용 가능한 객체 지향 소프트웨어의 요소\"입니다.\n\n# 구현\n\nSingleton 패턴을 사용할 때 고려해야 할 구현 문제들은 다음과 같습니다:\n\n- 유일한 인스턴스를 보장합니다. 싱글톤 패턴은 클래스의 단일 인스턴스를 보통의 클래스 인스턴스로 만듭니다. 그러나 해당 클래스는 한 번 만들 수 있는 인스턴스만 생성되도록 작성됩니다. 이를 위한 일반적인 방법은 인스턴스를 생성하는 작업을 유일한 인스턴스가 생성되도록 보장하는 클래스 정적 메소드 뒤에 숨기는 것입니다. 이 작업은 유일한 인스턴스를 보유하는 변수에 접근하며, 이 변수가 유일한 인스턴스로 초기화된 후 값을 반환하기 전에 이를 보장합니다. 이 접근 방법은 싱글톤이 처음 사용되기 전에 생성 및 초기화되도록 보장합니다.\n\n```js\nclass Logger {\n  private static instance: Logger;\n\n  protected constructor() {\n    // 외부에서의 인스턴스화 방지\n  }\n\n  static getInstance(): Logger {\n    if (!Logger.instance) {\n      Logger.instance = new Logger();\n    }\n    return Logger.instance;\n  }\n\n  log(message: string): void {\n    console.log(`[LOG] ${message}`);\n  }\n}\n\n// 사용법\nconst logger1 = Logger.getInstance();\nconst logger2 = Logger.getInstance();\n\nconsole.log(logger1 === logger2); // 출력: true\n\nlogger1.log(\"이것은 로그 메시지입니다.\");\nlogger2.log(\"또 다른 로그 메시지입니다.\");\n```\n\n인스턴스 속성은 클래스의 모든 인스턴스에서 공유되도록 정적으로 설정되어야 합니다. 인스턴스 속성으로 만들 경우 싱글톤 클래스의 각 인스턴스가 고유한 인스턴스 속성을 갖게되어 싱글톤 패턴의 목적을 무효화시킵니다.\n생성자가 protected로 선언되어 있음에 유의하십시오. 직접적으로 싱글톤을 인스턴스화 하려는 클라이언트는 컴파일 시간에 오류를 받게 됩니다. 이는 단 하나의 인스턴스만 생성될 수 있도록 보장합니다.\n\n2. 싱글톤 클래스의 서브클래싱. 주된 문제는 서브클래스를 정의하는 것이 아니라 해당 고유의 인스턴스를 설치해서 클라이언트가 사용 가능하도록 하는 것입니다. 본질적으로 싱글톤 인스턴스를 참조하는 변수는 서브클래스의 인스턴스로 초기화되어야 합니다. 가장 간단한 기술은 싱글톤의 인스턴스 작업에서 사용할 싱글톤을 결정하는 것입니다. 예시:\n\n```js\nclass MazeFactory {\n    private static _instance: MazeFactory | null = null;\n\n    protected constructor() {\n        // 생성을 방지하기 위한 protected 생성자\n    }\n\n    static Instance(): MazeFactory {\n        if (MazeFactory._instance === null) {\n            const mazeStyle: string | undefined = process.env.MAZESTYLE;\n            if (mazeStyle === \"bombed\") {\n                MazeFactory._instance = new BombedMazeFactory();\n            } else if (mazeStyle === \"enchanted\") {\n                MazeFactory._instance = new EnchantedMazeFactory();\n                // 필요에 따라 다른 가능한 하위 클래스 추가\n            } else { // 기본값\n                MazeFactory._instance = new MazeFactory();\n            }\n        }\n        return MazeFactory._instance;\n    }\n}\n\nclass BombedMazeFactory extends MazeFactory {\n    // BombedMazeFactory에 특정 구현을 추가하세요\n}\n\nclass EnchantedMazeFactory extends MazeFactory {\n    // EnchantedMazeFactory에 특정 구현을 추가하세요\n}\n\n// 사용법\nconst instance1: MazeFactory = MazeFactory.Instance();\nconst instance2: MazeFactory = MazeFactory.Instance();\n\nconsole.log(instance1 === instance2); // 출력: true\n```\n\n싱글톤의 하위 클래스를 선택하는 또 다른 방법은 getInstance의 구현을 상위 클래스에서 가져와서 하위 클래스에 넣는 것입니다.\n\n```js\nclass MazeFactory {\n    protected constructor() {\n        // 생성을 방지하기 위한 protected 생성자\n    }\n}\n\nclass BombedMazeFactory extends MazeFactory {\n    private static _instance: BombedMazeFactory | null = null;\n\n    private constructor() {\n        super();\n    }\n\n    static Instance(): BombedMazeFactory {\n        if (BombedMazeFactory._instance === null) {\n            BombedMazeFactory._instance = new BombedMazeFactory();\n        }\n        return BombedMazeFactory._instance;\n    }\n}\n\nclass EnchantedMazeFactory extends MazeFactory {\n    private static _instance: EnchantedMazeFactory | null = null;\n\n    private constructor() {\n        super();\n    }\n\n    static Instance(): EnchantedMazeFactory {\n        if (EnchantedMazeFactory._instance === null) {\n            EnchantedMazeFactory._instance = new EnchantedMazeFactory();\n        }\n        return EnchantedMazeFactory._instance;\n    }\n}\n\n// 사용법\nconst bombedInstance1: BombedMazeFactory = BombedMazeFactory.Instance();\nconst bombedInstance2: BombedMazeFactory = BombedMazeFactory.Instance();\n\nconsole.log(bombedInstance1 === bombedInstance2); // 출력: true\n\nconst enchantedInstance1: EnchantedMazeFactory = EnchantedMazeFactory.Instance();\nconst enchantedInstance2: EnchantedMazeFactory = EnchantedMazeFactory.Instance();\n\nconsole.log(enchantedInstance1 === enchantedInstance2); // 출력: true\n```\n\n보다 유연한 접근 방식은 싱글톤 레지스트리를 사용하는 것입니다. Instance가 모든 가능한 Singleton 클래스를 알 필요 없이, Singleton 클래스는 잘 알려진 레지스트리에 이름별로 싱글톤 인스턴스를 등록할 수 있습니다. 레지스트리는 문자열 이름과 싱글톤 간의 매핑을 제공합니다. Instance가 싱글톤을 필요로 할 때, 레지스트리에게 이름별로 싱글톤을 요청합니다. 레지스트리는 해당 싱글톤을 찾아 반환합니다. 이 접근 방식은 Instance를 모든 가능한 Singleton 클래스나 인스턴스를 알 필요 없이 자유롭게 만듭니다.\n\n```js\nclass Singleton {\n    private static registry: Map<string, any> = new Map();\n\n    protected constructor() {\n        // Protected constructor to prevent instantiation\n    }\n\n    static registerInstance(name: string, instance: any): void {\n        if (!Singleton.registry.has(name)) {\n            Singleton.registry.set(name, instance);\n        } else {\n            console.error(`Singleton with name '${name}' is already registered.`);\n        }\n    }\n\n    static getInstance(name: string): any | null {\n        if (Singleton.registry.has(name)) {\n            return Singleton.registry.get(name);\n        } else {\n            console.error(`Singleton with name '${name}' is not registered.`);\n            return null;\n        }\n    }\n}\n```\n\n싱글톤 클래스는 어디에 자신을 등록할까요? 한 가지 가능성은 생성자에 등록하는 것입니다. 예를 들어 MySingleton 서브클래스는 다음과 같이 할 수 있습니다:\n\n```js\nclass MySingleton extends Singleton {\n  constructor() {\n    super();\n    // 추가 초기화 로직 ...\n    Singleton.registerSingleton(\"MySingleton\", this);\n  }\n}\n```\n\n물론, 클래스의 인스턴스를 생성하지 않으면 생성자가 호출되지 않을 것입니다. 이는 싱글톤 패턴이 해결하려고하는 문제를 반영합니다! MySingleton의 인스턴스를 정의하여이 문제를 해결할 수 있습니다. 예를 들어 다음과 같이 정의할 수 있습니다.\n\n```js\nconst theSingleton: MySingleton = new MySingleton();\n```\n\nMySingleton의 구현 내용을 포함한 파일에서 코드를 변경해주세요. 이제 더 이상 싱글톤 클래스가 싱글톤을 생성하는 역할을 하지 않습니다. 대신, 주요 역할은 서브클래스 레지스트리를 사용하여 시스템 내에서 선택한 싱글톤 객체를 접근할 수 있도록 하는 것입니다. 이 방식에는 여전히 모든 가능한 Singleton 서브클래스의 인스턴스가 생성되어야 하는 잠재적인 단점이 있습니다. 그렇지 않으면 등록되지 않습니다.\n\n# 관련 패턴\n\nSingleton 패턴을 사용하여 많은 패턴을 구현할 수 있습니다. Abstract Factory, Builder, 그리고 Prototype을 참고하세요.\n","ogImage":{"url":"/assets/img/2024-05-15-SingletonDesignPatterninTypeScriptPart2ImplementationRelatedPatterns_0.png"},"coverImage":"/assets/img/2024-05-15-SingletonDesignPatterninTypeScriptPart2ImplementationRelatedPatterns_0.png","tag":["Tech"],"readingTime":6},{"title":"새 시리즈 보조 기술을 위한 대상 인구들","description":"","date":"2024-05-15 23:14","slug":"2024-05-15-NewSeriesAddressablePopulationsforAssistiveTechnology","content":"\n지난 6년간 전 세계 장애 조건을 평가하여 전 세계적으로 보조 기술에 대한 실제 필요성을 평가해 왔어요 — 특히 보완 및 대체 의사소통, 저발병 또는 고아 질환에 중점을 둔 것이죠. 말할 것도 없이, 기술이 존재함을 알지 못하는 사람들보다 혜택을 받을 수 있는 사람들이 훨씬 더 많다는 점. 이 프로젝트는 현재 4,000여 건의 인용을 보유하고 있으며, 몇 가지 측면에서 프라임 타임에 준비가 된 상태야!\n\n- 매 수일마다 새로운 자료 몇 개를 공유할 거예요\n- Substack이나 Patreon을 통해 이를 받아보실 수 있어요\n- 이는 데이터의 일부 샘플을 나타냅니다 — (정확한 인구 수, 지리, 지원 그룹 등과 같이) 보다 넓은 목적을 위한 라이선싱을 위해 연락 주세요\n- … 하지만 나는 이를 통해 교사, 가족, 선생님 및 기타 필요한 분들이, 제가 오랜 기간에 걸쳐 집중해 온 낯선 조건에 대해 빠르고 실질적인 자원을 가질 수 있기를 원해요.\n\n더 많은 정보가 곧 나올 예정이니, 기술 업데이트도 이어진답니다; 계속해서 확인해 주세요! 한편, 여기서 두 가지 조건에 대한 스냅샷이 있어요: 프래더-윌리 증후군과 클라인펠터 증후군. 앞으로 어떻게 개선될 수 있는지 알려주세요!\n\n수요일 즐겁게 보내시고, 연락 주세요! Patreon 커뮤니티는 지금 SLP-GPT를 분석하고 있어요, 즐겁네요!\n\n# 주소 가능 인구: 프라더-윌리 증후군\n\n![Prader-Willi Syndrome](/assets/img/2024-05-15-NewSeriesAddressablePopulationsforAssistiveTechnology_0.png)\n\n- 공식 명칭: 프라더-라브하트-윌리 증후군\n- 출생 10만 명당 1-9 건의 진단\n- 신생아 또는 태아\n- 코딩:\n  - ICD-11: LD90.3\n  - OMIM: 176270, 615547\n  - UMLS: C0032897\n  - MeSH: D011218\n  - GARD: 5575\n\n임상적 특징 및 진단\n\n프라더-윌리 증후군 (PWS)은 개인의 평생 동안 진화하는 특이한 임상적 특징으로 특징화됩니다. 처음에는 영아들이 심한 근이완, 수유 어려움 및 성장 부진을 나타냅니다. PWS를 가진 어린이들은 나이가 들수록 만족할 줄 모르는 식욕이 발달하여 만일 신중하지 않게 관리되면 만성 과식증 (과다식)과 비만이 발생할 수 있습니다. 다른 주요 특징으로는 지적 장애, 행동 문제, 성선 기능저하, 성장 호르몬 결핍 및 특징적인 안면 모습이 있습니다. 진단은 염색체 15번의 아버지 유전자 부족인 특히 15q11-q13 지역에서 이상을 식별하는 유전 검사를 통해 확인됩니다.\n\n원인, 병리학, 병리생리학\n\nPWS의 주된 원인은 15번 아버지 염색체(15q11-q13 지역)의 여러 유전자의 기능 손실입니다. 이는 아버지 유전자의 삭제, 모성 단일부모성 이핱체 (UPD) 또는 지각 결함을 통해 발생할 수 있습니다. 이러한 유전자의 부재는 갑상선 하부신경계의 정상 기능을 방해하여 내분비 기능 장애, 억제할 수 없는 식욕 및 행동 문제를 포함한 이상의 복합 표현현을 유발합니다.\n\n보조기술을 위한 특정 문제점\n\nPWS(프라더-윌리 증후군) 환자를 위한 보조 기술은 체중 관리와 신체 활동을 돕는 도구에 중점을 둬야 합니다. 이에는 식이 섭취량을 모니터하고 식사 일정을 관리하며 음식에 접근을 제한하는 애플리케이션 및 장치가 포함됩니다. 또한, 상호작용형 비디오 게임이나 착용형 활동 추적기와 같은 신체 활동을 촉진하는 기술이 유익할 수 있습니다. 부적절한 식욕을 관리하기 위해 잠그는 주방 캐비닛과 같은 환경 변화도 필수적입니다.\n\n보조/대체 의사 소통에 대한 특별 고려 사항\n\nPWS 환자의 지적 장애와 발음 지연 가능성을 감안할 때, 보충 및 대체 의사 소통(AAC) 기기가 중요합니다. 환자의 인지 수준에 맞춘 음성 생성 장치(SGD)는 의사 소통을 용이하게 할 수 있습니다. 특히 어린 아동이나 보다 심한 인지 장애를 가진 환자에게는 Picture Exchange Communication System(PECS)과 같은 시각 지원 시스템이 효과적일 수 있습니다.\n\n가능한 목표, IEP 또는 기타 정보\n\nPWS 관련 개인의 목표에는 구조화된 식사 계획과 규칙적인 신체 활동과 같이 과식 및 비만을 관리하는 전략이 포함되어야 합니다. 교육적인 목표는 의사 소통 능력 및 인지 발달을 향상시키는 데 초점을 맞추며 필요에 따라 AAC 장치를 활용할 수 있습니다. 발작, 강박증 및 사회적 기술에 대한 행동 목표도 중요합니다. 개인이 나이를 먹을 때 이러한 목표를 조정하기 위한 정기적인 평가가 중요합니다.\n\n이 상황 관리에 대한 언어병리사, 작업치료사 및 간병인들에게 조언\n\n언어병리사는 음성 지연에 대한 조기 개입에 초점을 맞추고 필요에 따라 AAC 장치를 도입해야 합니다. 작업치료사는 손기술 및 일상 생활 기술을 개발하는 데 도움을 줄 수 있으며 과식에 대한 자기 조절 전략에 특히 초점을 맞춰야 합니다. 간병인들은 과식을 관리하기 위한 잠긴 식품 보관 및 예정된 식사로 구조화된 환경을 확립해야 합니다. 긍정적 보상 및 명확한 기대 설정을 포함한 행동 개입이 필수적입니다.\n\n접근 방법에 관한 조언\n\nPWS(Prader-Willi syndrome)에서는 직관적인 성격과 사용 편의성 때문에 터치 기반 AAC(Augmentative and Alternative Communication) 장치가 가장 적합할 수 있습니다. 그러나 심한 운동 장애나 비만 관련 제한을 겪는 개인들에게는 눈을 이용한 시선 추적 기술이 효과적인 대안을 제공할 수 있습니다. 개인의 성장과 발달에 따라 선택한 방법이 계속해서 개인의 요구를 충족시키는지 확인하기 위해 정기적으로 재평가가 필요합니다.\n\n참고문헌:\n\n1. Cassidy, S. B., Schwartz, S., Miller, J. L., & Driscoll, D. J. (2012). Prader-Willi syndrome. _Genetics in Medicine_.\n\n2. Butler, M. G., Lee, P. D. K., & Whitman, B. Y. (2022). Management of Prader-Willi Syndrome.\n\n3. Goldstone, A. P., Holland, A. J., Hauffa, B. P., et al. (2008). 프라더-윌리 증후군 진단과 치료를 위한 권고사항. _임상 내분비학 및 대사학 지도_.\n\n4. Holm, V. A., Cassidy, S. B., Butler, M. G., Hanchett, J. M., et al. (1993). 프라더-윌리 증후군: 합의된 진단 기준. _소아청소년_.\n\n5. Dykens, E. M., Leckman, J. F., et al. (1996). 프라더-윌리 증후군에서의 강박과 강박증. _아동 심리학과 정신건강_.\n\n# 대상 인구: 클라인펠터 증후군\n\n<img src=\"/assets/img/2024-05-15-NewSeriesAddressablePopulationsforAssistiveTechnology_1.png\" />\n\n- 청소년, 어린이, 유아, 신생아\n- 코딩:\n- ICD-11: LD50.3Y\n- UMLS: C2936741\n- MeSH: D007713\n- GARD: 10048230\n\n임상 특징 및 진단\n\n클라인 펠터 증후군 (KS)은 남성을 영향을 미치는 가장 흔한 염색체 이상으로, 남성에게 하나 이상의 여분의 X 염색체의 존재로 특징 지어지며 (47,XXY가 가장 흔한 변형), 남성호르몬 수치의 감소를 일으키는 저고난드르농증, 정앙기능 저하로 인한 불임증, 유방비대증을 동반합니다. 개인은 키가 크고, 근육량이 줄고, 체모 양이 줄어들었을 수 있으며, 실행 기능, 언어, 사회적 상호작용과 관련된 일련의 인지 및 정신사회적 과제를 포함할 수 있습니다. 진단은 염색체 이상을 나타내는 카리오타이핑을 통해 확인됩니다.\n\n원인, 병리학, 병리생리학\n\n클라인펠터 증후군의 원인은 줄기에서의 비이상적 염색체 분리로, 남성에게 추가적인 X 염색체가 생기는 것입니다. 이 염색체 이상은 고환 발생장애를 유발하여 테스토스테론 생산과 정액생식을 저해합니다. KS의 인지 및 심리적 측면의 병리생리학은 덜 이해되었지만, 과잉 X 염색체의 뇌 발달과 기능에 미치는 영향이라고 여겨집니다.\n\n보조 기술을 위한 고려 사항\n\nKS 환자를 위한 보조 기술은 해당 상태와 관련된 인지적 난제를 고려하여 교육 및 직업적 지원에 중점을 둘 수 있습니다. 텍스트 읽기 기능 및 마인드 맵핑 도구와 같은 조직, 시간 관리 및 학습을 돕는 소프트웨어는 유익할 수 있습니다. 추가적으로 상담 및 사회기술 훈련 프로그램은 가상 현실 환경 및 다른 대화식 기술로 지원될 수 있습니다.\n\n수화 및 대체 커뮤니케이션에 관한 구체적인 문제\n\nKS를 가진 대부분의 개체들은 구어 능력을 발달시키지만, 일부는 언어와 소통에 중요한 어려움을 겪을 수 있습니다. 언어와 소통에 큰 어려움을 겪는 사람들을 위한 음성 생성 장치나 소셜 커뮤니케이션 기술을 강화하는 앱 같은 수화 및 대체 커뮤니케이션 (AAC) 전략은 유용할 수 있습니다.\n\n목표, IEP 또는 그 외\n\nKS를 가진 개인들을 위한 교육 목표는 학업적 및 사회-정서적 학습 필요를 다루어야 합니다. 이는 글쓰기와 수리, 언어 평가 및 치료, 실행 기능 훈련, 그리고 사회 기술 교육에 맞춘 지원을 포함할 수 있습니다. 개인별 교육 계획 (IEP) 또는 504 계획은 이러한 필요를 학교 환경에서 충족시키는 구조적 접근 방법을 제공할 수 있습니다.\n\nSpeech Pathologists, Occupational Therapists, and Caregivers에게 관리에 대한 조언\n\n언어병리사는 음성 및 언어 지연에 대한 초기 평가와 개입에 주안점을 두어야 하며, 언어 및 글쓰기 기술에 대한 지속적인 지원이 필요합니다. 작업치료사는 깔끔한 솜씨, 조정 능력 및 실행 기능 전략을 개발하는 데 도움을 줄 수 있습니다. 보호자 및 교육자는 학습 어려움과 사회적 도전에 대한 잠재적인 위험을 인식하고 자아 존중과 사회적 참여를 촉진하는 지원적이고 포괄적인 환경을 제공해야 합니다.\n\n접근 수단\n\nKS를 가진 사람들 중 대인 보조 보조기구가 필요한 경우, 접근 수단 선택은 해당 개인의 근육 운동 능력, 인지 능력 및 개인적인 선호도에 따라 결정되어야 합니다. 터치스크린 장치는 사용이 쉽고 적응력이 높아 적합한 경우가 많습니다. 깔끔한 솜씨에 문제가 있는 사람들에게는 시선 추적 기술이나 스위치 액세스가 효과적인 대안을 제공할 수 있습니다.\n\n인용문:\n\n- Smyth, C. M., & Bremner, W. J. (1998). Klinefelter syndrome. _Archives of Internal Medicine_.\n- Lanfranco, F., Kamischke, A., Zitzmann, M., & Nieschlag, E. (2004). Klinefelter’s syndrome. _The Lancet_.\n- Wikström, A. M., & Dunkel, L. (2011). Klinefelter syndrome. _Best Practice & Research Clinical Endocrinology & Metabolism_.\n- Groth, K. A., Skakkebæk, A., Høst, C., et al. (2013). Klinefelter syndrome — a clinical update. _The Journal of Clinical Endocrinology & Metabolism_.5. Bojesen, A., & Gravholt, C. H. (2007). Klinefelter syndrome in clinical practice. _Nature Clinical Practice Urology_.\n\n지금까지입니다 — 이번 주와 앞으로 더 많은 정보를 제공할 예정입니다!\n\n/루크 스토이버\n\n![New Series Addressable Populations for Assistive Technology](/assets/img/2024-05-15-NewSeriesAddressablePopulationsforAssistiveTechnology_2.png)\n","ogImage":{"url":"/assets/img/2024-05-15-NewSeriesAddressablePopulationsforAssistiveTechnology_0.png"},"coverImage":"/assets/img/2024-05-15-NewSeriesAddressablePopulationsforAssistiveTechnology_0.png","tag":["Tech"],"readingTime":6}],"page":"10","totalPageCount":13,"totalPageGroupCount":1,"lastPageGroup":13,"currentPageGroup":0},"__N_SSG":true}