{"pageProps":{"posts":[{"title":"오픈 소스 리액트 UI 라이브러리 구축하기 - 2일째","description":"","date":"2024-05-16 19:18","slug":"2024-05-16-BuildinganOpenSourceReactUILibraryDay2","content":"\n<img src=\"/assets/img/2024-05-16-BuildinganOpenSourceReactUILibraryDay2_0.png\" />\n\n두 번째 날 다시 방문해 주셔서 환영합니다. 오픈 소스 React UI 라이브러리를 만드는 시리즈의 두 번째 날입니다!\n\n오늘은 모든 것을 준비하는 과정이었습니다. 우리가 지금까지 얼마나 진전했는지 살펴봅시다.\n\n# 프로젝트 설정하기\n\n<div class=\"content-ad\"></div>\n\n## 1. Git 저장소 구성하기\n\n우선, GitHub의 EtnaUI라는 조직 아래 etna-ui라는 새로운 Git 저장소를 설정했습니다. 여기서 저장소를 확인할 수 있어요. 이 저장소는 앞으로 코드와 협업을 위한 중앙 허브 역할을 할 거에요.\n\n![GitHub 저장소](/assets/img/2024-05-16-BuildinganOpenSourceReactUILibraryDay2_1.png)\n\n## 2. React 프로젝트 부트스트래핑하기\n\n<div class=\"content-ad\"></div>\n\n다음은 React 프로젝트를 처음부터 시작하는 방법을 설명하겠습니다. Create React App을 사용하는 대신에 번들러로 Vite를 선택했습니다. Vite는 빠르고 간단하다는 것으로 알려져 있어서 개발 프로세스를 효과적으로 해결하는 데 도움이 될 것입니다. 아래는 설정하는 방법입니다:\n\n```js\npnpm add react react-dom\npnpm add -D vite @vitejs/plugin-react\n```\n\n또한, vite.config.ts 파일을 구성하여 React 플러그인을 포함하도록 설정했습니다:\n\n```js\n// vite.config.ts\nimport { defineConfig } from \"vite\";\nimport react from \"@vitejs/plugin-react\";\n\nexport default defineConfig({\n  plugins: [react()],\n});\n```\n\n<div class=\"content-ad\"></div>\n\n## 3. 패키지 매니저 선택\n\n페키지 관리를 위해 pnpm@9를 사용하기로 결정했어요. PNPM은 다른 패키지 매니저에 비해 디스크 공간을 더 효율적으로 사용하며 빠릅니다. 게다가, 서로 다른 개발 환경에서도 일관성을 유지하기 위해 Node.js 버전을 관리하기 위해 Volta를 사용하고 있어요.\n\n## 4. 첫 번째 컴포넌트 생성\n\n기본 설정이 완료되었으니, 첫 번째 컴포넌트를 만들었어요: 간단한 `Button` 컴포넌트입니다. 이 초기 컴포넌트를 사용하여 모든 것이 정상적으로 작동하는지 테스트할 예정이에요.\n\n<div class=\"content-ad\"></div>\n\n아래는 Button 컴포넌트를 간단히 살펴볼 수 있어요:\n\n```js\nimport { ButtonHTMLAttributes } from \"react\";\n\nimport \"./Button.scss\";\n\nexport interface ButtonProps extends ButtonHTMLAttributes<HTMLButtonElement> {\n  variant?: \"primary\" | \"secondary\";\n  size?: \"small\" | \"medium\" | \"large\";\n}\n\nexport const Button = ({ className, size = \"medium\", variant = \"primary\", ...props }: ButtonProps) => (\n  <button className={`button button--${variant} button--${size}`} {...props} />\n);\n```\n\n그리고 함께 사용되는 SCSS 파일은 아래와 같아요:\n\n```js\n.button {\n  border: 1px solid #ccc;\n  border-radius: 4px;\n  cursor: pointer;\n  display: inline-block;\n  font-size: 14px;\n  font-weight: 500;\n  line-height: 1.5;\n  padding: 8px 16px;\n  text-align: center;\n  text-decoration: none;\n  transition:\n    background-color 0.3s,\n    border-color 0.3s,\n    color 0.3s;\n\n  &--primary {\n    background-color: #8a4dff;\n    color: #ffffff;\n\n    &:hover {\n      background-color: #6f3aff;\n    }\n\n    &:active {\n      background-color: #4d1aff;\n    }\n  }\n\n  &--secondary {\n    background-color: #d6baff;\n    color: #000000;\n\n    &:hover {\n      background-color: #b38cff;\n    }\n\n    &:active {\n      background-color: #8a4dff;\n    }\n  }\n\n  &--small {\n    font-size: 12px;\n    padding: 6px 12px;\n  }\n\n  &--medium {\n    font-size: 16px;\n    padding: 10px 20px;\n  }\n\n  &--large {\n    font-size: 18px;\n    padding: 12px 24px;\n  }\n}\n```\n\n<div class=\"content-ad\"></div>\n\n## 5. Sass 지원 추가하기\n\n우리의 컴포넌트를 스타일링하기 위해, 종속성으로 Sass 지원을 추가했어요:\n\n```js\npnpm add sass\n```\n\n## 6. TypeScript 구성하기\n\n<div class=\"content-ad\"></div>\n\nTypeScript은 우리의 설정에서 중요한 부분으로, 타입 안전성과 개발자 경험을 향상시켜줍니다. tsconfig.json을 설정하는 데 시간을 소비해서, 프로젝트의 요구에 맞게 맞추었어요. TypeScript 구성에 대해 더 깊이 파고들고 싶다면, 이 가이드가 매우 유용했어요.\n\n```js\n{\n  \"compilerOptions\": {\n    /* 언어 및 환경 */\n    \"target\": \"ESNext\",                                  /* 생성된 JavaScript에 대한 JavaScript 언어 버전 및 호환 라이브러리 선언을 포함하도록 설정. */\n    \"jsx\": \"react-jsx\",                                /* 생성된 JSX 코드를 지정합니다. */\n\n    /* 모듈 */\n    \"module\": \"ESNext\",                                /* 생성된 모듈 코드를 지정합니다. */\n    \"moduleResolution\": \"Bundler\",                     /* TypeScript가 지정된 모듈 지정자에서 파일을 어떻게 찾는지를 지정합니다. */\n    \"noEmit\": true,                                   /* 컴파일 중에 파일을 생성하지 않도록 설정합니다. */\n\n    /* 타입 확인 */\n    \"strict\": true,                                      /* 모든 엄격한 타입 확인 옵션을 활성화합니다. */\n  },\n  \"include\": [\"src\"],\n  \"references\": [{ \"path\": \"./tsconfig.node.json\" }]\n}\n```\n\n## 7. Prettier 설정하기\n\n코드를 깔끔하고 일관되게 유지하기 위해 Prettier를 설치하고 구성했어요. 지금은 우리의 요구에 충분한 기본 구성을 사용하고 있어요.\n\n<div class=\"content-ad\"></div>\n\n```js\npnpm add -D prettier\n```\n\n## 프로젝트 실행하기\n\n모든 것이 올바르게 설정되었는지 확인하기 위해 dev 스크립트를 사용하여 프로젝트를 실행했습니다. 이 스크립트는 웹 서버를 시작하고 데모 페이지를 로드하여 Button 구성 요소를 테스트했습니다.\n\n```js\npnpm dev\n```\n\n<div class=\"content-ad\"></div>\n\n<img src=\"/assets/img/2024-05-16-BuildinganOpenSourceReactUILibraryDay2_2.png\" />\n\n앞으로는 더 포괄적인 컴포넌트 설명과 테스트를 위해 Storybook을 사용할 계획입니다.\n\n# Package Configuration\n\n여기에 필요한 모든 종속성과 스크립트가 포함된 package.json 파일을 살펴보겠습니다:\n\n<div class=\"content-ad\"></div>\n\n```json\n{\n  \"name\": \"etna-ui\",\n  \"author\": \"Matteo Cavallo\",\n  \"description\": \"EtnaUI는 이탈리아에서 사랑을 담아 만들어진 종합적인 디자인 시스템입니다.\",\n  \"type\": \"module\",\n  \"files\": [\"dist\"],\n  \"scripts\": {\n    \"dev\": \"vite\"\n  },\n  \"peerDependencies\": {\n    \"react\": \"^18.3.0\",\n    \"react-dom\": \"^18.3.0\"\n  },\n  \"devDependencies\": {\n    \"@types/react\": \"^18.3.2\",\n    \"@types/react-dom\": \"^18.3.0\",\n    \"@vitejs/plugin-react\": \"^4.2.1\",\n    \"prettier\": \"^3.2.5\",\n    \"sass\": \"^1.77.1\",\n    \"typescript\": \"^5.4.5\",\n    \"vite\": \"^5.2.11\"\n  }\n}\n```\n\n# 다음 단계\n\n기초 세팅이 완료되었으므로 나머지 컴포넌트를 구축할 준비가 되었습니다. 아직 해야 할 몇 가지 항목들이 있습니다:\n\n- 적절한 폴더 구조 설정\n- 컴포넌트 문서화 및 테스트를 위해 Storybook 구현\n- Jest를 이용한 단위 테스트 구성\n- CI/CD 파이프라인 설정\n- 변형에 대해 CVA 사용 여부 고려\n- 스타일링을 위해 BEM 사용 여부 고려\n- 코드 품질을 위한 ESLint 추가\n\n<div class=\"content-ad\"></div>\n\n일상적인 진행 상황 업데이트를 계속해서 공유할 테니 기다려주세요. 지금 당장은 GitHub에서 프로젝트의 현재 상태를 확인할 수 있어요.\n\n이 여정을 따라와 주셔서 감사합니다. 아래 댓글에 궁금한 점이나 제안 사항을 자유롭게 남겨주세요. 함께 멋진 것을 만들어봐요!\n\n즐거운 코딩 되세요!\n","ogImage":{"url":"/assets/img/2024-05-16-BuildinganOpenSourceReactUILibraryDay2_0.png"},"coverImage":"/assets/img/2024-05-16-BuildinganOpenSourceReactUILibraryDay2_0.png","tag":["Tech"],"readingTime":6},{"title":"SEO와 웹 접근성의 강력한 파워 커플 AI로 슈퍼 차지","description":"","date":"2024-05-16 19:16","slug":"2024-05-16-TheSEOandWebAccessibilitypowercoupleSuperchargedbyAI","content":"\n\n## AI가 우리가 웹 사이트를 최적화하는 방식을 혁신하고 있습니다\n\n끊임없이 변화하는 웹 최적화 환경에서 SEO(검색 엔진 최적화)와 웹 접근성의 다이내믹한 협업은 오랫동안 성공을 위한 비결이었습니다. 웹 사이트가 검색 엔진에 발견되고 모든 사람이 사용할 수 있도록 보장함으로써, 보다 폭넓은 관객을 유치하고 긍정적인 사용자 경험(UX)을 만들어냅니다.\n\n포괄성에 대한 이러한 집중은 전 세계 웹 사용자를 위한 접근성을 우선시하는 것으로, 5월에는 글로벌 접근성 인식의 날(GAAD)이 접근을 향상시키도록 시기적절한 알림 역할을 합니다.\n\nAI는 여러 산업을 급속하게 변화시키고 있으며, 웹 최적화도 예외는 아닙니다. AI의 능력을 활용하여 SEO 및 접근성 전략을 더 높은 수준으로 끌어올림으로써, 더 큰 효율성을 가지고 더 나은 결과를 얻을 수 있습니다.\n\n<div class=\"content-ad\"></div>\n\n![image](/assets/img/2024-05-16-TheSEOandWebAccessibilitypowercoupleSuperchargedbyAI_0.png)\n\n## AI가 웹사이트 최적화 방법을 혁신하는 방법:\n\n1. SEO를 위한 향상된 콘텐츠 최적화:\n\n- AI 기반 콘텐츠 분석 도구는 웹사이트 콘텐츠를 분석하고 검색 엔진 알고리즘과 사용자 행동에 기반하여 개선할 부분을 식별할 수 있습니다. 이를 통해 정보성 뿐만 아니라 검색 쿼리에 적합하며 사용자들에게 매력적인 콘텐츠를 작성할 수 있습니다.\n- AI 작성 보조 도구는 콘텐츠 아이디어를 생성하고 제목 및 메타 설명을 최적화하며 심지어 SEO 최상의 실천 사항을 준수하는 고품질 문장을 작성하는 데 도움을 줄 수 있습니다.\n\n<div class=\"content-ad\"></div>\n\n2. 맞춤형 접근성 권장 사항:\n\n- AI 기반의 접근성 테스트 도구는 당신의 웹사이트를 크롤링하고 장애를 가진 사용자를 위한 잠재적인 접근성 장벽을 식별할 수 있습니다. 이는 기본적인 확인을 넘어서 복잡한 문제를 발견할 수 있어요. 전통적인 테스트 방법에서 놓칠 수 있는 부분을 찾아냅니다.\n- AI는 사용자의 선호도와 요구에 기반한 맞춤형 접근성 기능을 제공할 수 있습니다. 개개인의 설정에 따라 자동으로 글꼴 크기, 색 대비, 또는 텍스트 음성 옵션을 조정하는 웹사이트를 상상해 보세요.\n\n3. 간소화된 사용자 경험 최적화:\n\n- AI는 사용자의 행동 데이터를 분석하여 사람들이 어떻게 당신의 웹사이트와 상호 작용하는지 이해할 수 있습니다. 이 데이터는 사용자의 당혹함이나 혼란이 있을 수 있는 부분을 식별하고 더 나은 참여와 전환율을 위해 사용자 경험을 최적화하는 데 사용될 수 있습니다.\n- AI 기반 챗봇은 사용자에게 실시간 지원을 제공하고 질문에 답변하며 문제를 해결함으로써 더욱 원활하고 개인화된 사용자 경험을 만들어줍니다.\n\n<div class=\"content-ad\"></div>\n\n미래는 밝다...\n웹 최적화 공간에서 AI가 여전히 발전 중이지만, 그 잠재력은 부인할 수 없다. AI 도구와 전략을 SEO 및 접근성 노력에 통합함으로써 가치 있는 통찰을 얻고, 반복적인 작업을 자동화하며, 검색 엔진뿐만 아니라 참으로 포괄적이고 사용자 친화적인 웹사이트를 만들 수 있습니다. AI 기술이 계속 발전함에 따라 미래의 뛰어난 성능을 발휘하는 모든 사람들을 위한 웹사이트를 위해 그 힘을 활용하는 더 혁신적인 방법을 기대할 수 있습니다.\n\n시작할 준비가 되셨나요?\n좋은 소식은 이 기술을 활용해 이점을 얻으려면 AI 전문가가 필요하지 않다는 것입니다. 많은 사용자 친화적인 AI 도구가 이미 사용 가능해져 있어 SEO 및 디지털 접근성을 모두 위해 웹사이트를 최적화하는 데 도움이 됩니다.\n이 도구들을 살펴보고 다양한 전략을 실험해보고, AI가 SEO 및 접근성의 힘을 실력있게 끌어올리는 데 어떻게 도울 수 있는지 살펴보세요!\n\n아래는 고려해볼 몇 가지 디지털 도구입니다:\n\nSEO 중심 AI 도구:\n\n<div class=\"content-ad\"></div>\n\n친구 같은 톤으로 번역해보겠습니다:\n\n- Surfer SEO: 검색 의도, 경쟁자 콘텐츠, 그리고 페이지 내 SEO 요인을 기반으로 콘텐츠를 분석합니다.\n- MarketMuse: 키워드 관련성 및 주제 권위를 기반으로 콘텐츠 향상을 위한 제안을 제공합니다.\n- Frase: 인공지능을 활용하여 콘텐츠 개요를 생성하고 검색 엔진을 위해 기존 콘텐츠를 최적화합니다.\n\n기술적인 SEO:\n- Screaming Frog SEO Spider: 웹사이트를 크롤링하여 깨진 링크나 누락된 메타 설명과 같은 기술적인 SEO 문제를 식별합니다. 엄격히 말하면 AI로 구동되진 않지만, 일부 AI 도구와 통합됩니다.\n\n<div class=\"content-ad\"></div>\n\n내용 생성:\n\n- Rytr: 블로그 게시물, 제품 설명 및 기타 콘텐츠 형식을 생성하는 AI 작성 보조 도구\n- Jasper: 전문적인 요구 사항에 기반한 다양한 기능을 갖춘 SEO 친화적 콘텐츠 생성\n- Writesonic: 다양한 AI 작성 템플릿을 제공하여 흥미로운 웹사이트 콘텐츠, 랜딩 페이지 및 소셜 미디어 콘텐츠 작성 지원\n\n## 접근성 중심 AI 도구:\n\n자동화된 테스트:\n\n<div class=\"content-ad\"></div>\n\n- WAVE by WebAIM: WCAG 가이드라인을 기반으로 한 접근성 장벽을 신속히 식별해주는 무료 온라인 도구\n- Deque Axe: 심층적인 접근성 감사를 제공하며 개발 도구와 통합하여 실시간 피드백을 제공\n- Siteimprove Accessibility: 자동화된 테스트, 교정 제안 및 지속적인 모니터링을 제공\n\n개인화된 특징:\n\n- EqualWeb Accessibility Checker: 특정 사용자 요구에 맞게 맞춤형 AI 기반의 접근성 권장 사항을 제공\n\n기억하세요:\n\n<div class=\"content-ad\"></div>\n\n- 이것들은 몇 가지 예시에 불과하며 시장은 끊임없이 변화하고 있습니다.\n- 도구를 선택할 때 예산, 사용자 인터페이스 및 특정 요구 사항과 같은 요소를 고려해 보세요.\n- 많은 SEO 도구에는 기본 접근성 기능이 내장되어 있지만, 전용 접근성 도구는 고급 기능을 제공하기도 합니다.\n\n게다가:\n\n- SEO와 접근성 기능을 결합한 도구를 찾아보세요. 보다 획기적인 방식으로 접근해 보세요.\n- 인공지능에만 의존하지 마세요. SEO 및 접근성에 대한 인간의 전문 지식은 여전히 중요합니다.\n- AI 도구를 사용하여 업무 흐름을 최적화하고 가치 있는 통찰력을 얻으세요. 그러나 모두에게 진정한 유저 친화적인 웹사이트를 만드는 데 중점을 두세요.\n\nAI 도구를 전략적으로 활용하여 SEO 및 접근성 노력을 함께할 경우, 웹사이트의 성공을 위한 승리의 조합을 만들 수 있습니다.\n\n<div class=\"content-ad\"></div>\n\n## 블로그 노트:\n\n## 위의 2번 항목에서의 추가적인 생각들:\n\n만약 AI가 접근성 요구에 따라 웹사이트 기능을 실시간으로 개인화할 수 있다면... 시각, 청각, 음성, 터치를 통한 사용자 상호작용마다 웹사이트를 동적이고 사용자 친화적으로 만들어줄 수 있어서, 신경 다양성을 갖는 사람들에게 인지 과부하를 줄여줄 수 있을까요?\n\n젠니 AI 챗봇 제안...\n\n<div class=\"content-ad\"></div>\n\nAI가 사용자별 요구에 따라 웹 사이트를 맞춤화하는 방법을 보여드릴게요:\n\n시각:\n\n- 시선 추적: AI가 사용자의 시선을 인식하고 컨텐츠 초점을 동적으로 조정하는 것을 상상해보세요. 사용자가 더 오래 바라보는 영역은 확대되거나 강조되거나 읽힐 수 있습니다.\n- 동적 레이아웃: AI가 시각적 요구에 따라 레이아웃을 조정할 수 있습니다. 주변 시야가 제한된 사용자를 위해 컨텐츠를 한 열로 제공하여 쉬운 탐색이 가능합니다. \n\n청각:\n\n<div class=\"content-ad\"></div>\n\n- 적응형 사운드스케이프: 사용자의 선호에 따라 배경 소음을 조절할 수 있습니다. 웹사이트는 청각 민감성을 가진 사람들을 위해 진정한 소리를 제공하거나 더 몰입적인 경험을 선호하는 사람들을 위해 동적인 소리 효과를 제공할 수 있습니다.\n- 개인 맞춤형 오디오 설명: 인공지능이 시각 장애를 가진 사용자들을 위해 시각 컨텐츠의 실시간 오디오 설명을 생성할 수 있습니다.\n\n상호작용:\n\n- 터치 인식: 인공지능이 운동 기술에 기반해 터치 컨트롤을 적응시킬 수 있습니다. 솜씨가 제한된 사용자들을 위해 더 큰 터치 대상이나 대체 탐색 옵션이 나타날 수 있습니다.\n- 예측 텍스트 입력: 인공지능이 사용자가 타이핑하는 내용을 예측하고, 사용자의 브라우징 기록과 접근성 요구에 기반하여 자동 완성 옵션을 제안할 수 있습니다.\n\n맞춤형 접근성의 미래:\n\n<div class=\"content-ad\"></div>\n\n- 생체 인식 통합: 미래에는 인공지능이 뇌파 패턴이나 근전도 데이터와 같은 생체 인식 데이터를 활용하여 웹사이트 경험을 더욱 개인화할 수 있을 것입니다.\n- AI 비서: 사용자의 요구에 기반하여 도움을 제안하는 가상 비서가 나타날 수 있습니다. 그들은 혼동스러운 콘텐츠를 설명하거나 실시간으로 언어를 번역하거나 작업을 완료하는 대안적인 방법을 제안할 수 있습니다.\n\n전반적으로, 접근성을 위한 AI 기반의 실시간 개인화는 웹을 혁신시킬 잠재력이 있습니다. 도전에 대처하고 윤리적으로 발전시킴으로써, 우리는 모두를 위한 더 포괄적이고 사용자 친화적인 온라인 경험을 만들어낼 수 있습니다.\n\n다른 AI가 아닌 블로그 중 일부를 살펴보세요:\nSEO와 웹 접근성의 교차점\n웹사이트 최적화를 돕는 도구들\nSEO를 개선하는 10가지 팁","ogImage":{"url":"/assets/img/2024-05-16-TheSEOandWebAccessibilitypowercoupleSuperchargedbyAI_0.png"},"coverImage":"/assets/img/2024-05-16-TheSEOandWebAccessibilitypowercoupleSuperchargedbyAI_0.png","tag":["Tech"],"readingTime":5},{"title":"생성적 AI에서 우세한 디자인으로 가는 길","description":"","date":"2024-05-16 19:14","slug":"2024-05-16-ThePathtoDominantDesigninGenerativeAI","content":"\n\n## 도미넌트 디자인과 지배를 위한 경쟁에서 성공 또는 실패를 이끄는 전략적 요소에 관한 사상\n\n![이미지](/assets/img/2024-05-16-ThePathtoDominantDesigninGenerativeAI_0.png)\n\nI. 소개\n\n기술 혁신의 수명주기 내에서 도미넌트 디자인을 달성하기 위한 투쟁은 지난 반 세기 동안 강한 연구 주제였습니다. 이러한 싸움은 연구 및 개발 (R&D) 연구소, 상용화 및 마케팅 전략 논의, 그리고 언론 및 소비자 공간에서 전개되지만, 궁극적으로는 일상적인 능력 선택을 통해 시장 점유율과 제품 수용을 바꾸는 고객들의 마음과 정신에서 결정됩니다. 이것이 VHS가 Betamax를 기억하는 이유이며, 왜 우리는 QWERTY 키보드로 타이핑을 하며, Google의 검색 엔진 또는 Apple의 iPhone 소개 후 산업이 어떻게 변화했는지를 설명합니다. ChatGPT의 등장은 시장에 신호를 주었으며, 우리는 현재 생성적 AI를 포함한 또 다른 도미넌트 디자인을 위한 전투 중에 있다는 것을 의미합니다.\n\n<div class=\"content-ad\"></div>\n\n생성 AI는 새로운 콘텐츠 생성과 복잡한 작업 수행이 가능하며, 창의성을 향상시키고 작업을 자동화하며 고객 경험을 향상시킴으로써 산업을 혁신할 잠재력이 있습니다. 따라서 조직은 관련 능력 생태계에 신속하게 투자하여 중요성을 유지하고 경쟁력을 확보하는 데 주력하고 있습니다. 비즈니스 리더, 정부 기관 및 투자자는 재빠르게 진화하는 생성 AI 분야에서 기술에 관한 결정을 내릴 때 치피되는 특정 디자인의 개념과 기술이 어떻게 성숙해가면서 이 개념 주위에서 어떻게 결합되는지를 염두에 두어야 합니다.\n\n## 우열을 가리는 디자인의 전투\n\n우열을 가리는 디자인의 개념은 1975년 Abernathy-Utterback 모델로 최초로 제시되었으며, 이 용어는 그 후 20년 후에야 공식적으로 제정된 것이었습니다. 이 개념은 MBA 학생들에게 여전히 국내외의 학교에서 가르쳐지도록 기초적인 지식으로 자리 잡았습니다. 이 비즈니스 모델의 가장 기본적인 측면에서, 제품의 디자인 및 제조 공정이 어떻게 세 가지 구분된 단계를 통해 시간이 지남에 따라 발전하는지를 설명합니다: 제품 디자인 및 공정 개선에서 상당한 혁신이 이루어지며 시장 요구를 충족하기 위해 서로 다른 접근 방식이 개발되고 정제되는 중요한 실험을 특징으로 하는 초기 유동성 단계, 우세한 제품 디자인이 나타나기 시작하고 시장이 제품 표준화 방향으로 점차 전환되지만 상당한 공정 혁신을 동반하는 전환기 단계, 제품 및 공정 디자인을 표준화하는 특정기 단계입니다.\n\n후에 이 작업은 제품이 시장에 소개되기 전에 기술적 지배력 역동성을 설명하기 위해 Fernando Suarez에 의해 가장 주목할만한 것으로 확장되었습니다. Suarez의 기술 지배 틀은 제품 혁신이 다섯 단계를 거쳐 진행되는 방법을 보여주고 있습니다.\n\n<div class=\"content-ad\"></div>\n\n## 기술 우위의 다섯 단계\n\n- 연구 및 개발 확대: 새로운 기술 영역과 관련된 응용 연구를 시작하면서 기업들이 혼합되어 시작됩니다. 기술 흐름의 다양성으로 인해, 기술과 기술적 재능에 중점이 둔다.\n- 기술적 실현 가능성: 첫 번째 작동 프로토 타입의 생성은 모든 참여 기업들을 현재 연구와 경쟁적 위치표에 대해 평가하게 만듭니다(예: 계속된 독립적 추진, 협력/팀 형성, 나가기). 경쟁 동태는 회사 수준 요소와 기술적 우월성에 중점을 두며, 시장에 적용 가능한 규제에 대해 강조합니다.\n- 시장 형성: 첫 상업 상품 출시는 시장에 명확한 신호를 보내고 기술로부터 시장 요소로의 중요성을 불가능하게 변화시킵니다. 이 단계에서, 제품 간의 기술적 차이가 점점 중요하지 않아지며, 생태계 안의 회사들에 의한 전략적 조정이 가장 중요해 집니다.\n- 결정적 전투: 규모 있는 시장 점유율을 가진 각 경쟁사 중 조기 선두자의 등장이 이 단계를 알리게 됩니다. 주목할 점은 네트워크 효과(예: 제품 주변에 형성된 생태계)와 환경 내의 전환 비용이 더 강한 영향을 미치기 시작한다는 것입니다. 추가로, 설치된 기반 규모와 보완적 자산의 크기가 중요성을 띄며, 신뢰성과 혁신보다 신뢰와 신뢰를 추구하는 주요 시장 소비자들이 승자를 결정합니다.\n- 우위 이후: 시장에서 대안적 설계 중 하나가 채택되어 명확한 우세 기술이 되며, 사용자의 대규모 설치 기반이 지원됩니다. 새로운 진입자에 대한 자연적 방어 기능이 제공됩니다, 특히 강력한 네트워크 효과와 전환 비용이 있는 시장에서. 현재 기술을 대체할 새로운 기술 혁신이 발생할 때까지 이 단계는 지속됩니다.\n\n가까 장기적 관점에서 이러한 단계를 탐험하는 것은 중요합니다.\n\n<div class=\"content-ad\"></div>\n\nIII. ChatGPT: 세계를 뒤흔든 발도\n\n2022년 11월 ChatGPT의 출현은 대규모 언어 모델(LLM)이 실용적이고 상업적으로 광범위하게 적용될 수 있다는 명백한 신호를 보냈습니다. 몇 주 안에 일반 사용자뿐만 아니라 기술적이고 비기술적 사용자 세대 간에도 산업용 AI라는 용어가 널리 알려지게 되었습니다. 더욱 중요한 것은 시장의 다른 참가자들이 자신의 산업용 AI 능력을 제공할 수 있는 노력을 시작하거나 크게 가속화해야 한다는 깨달음을 얻은 것이었습니다. 이로 인해 기술 실현 가능성 단계에서 시장 생성 단계로의 이동이 이루어졌습니다. 그 이후, 경쟁이 시작되었습니다.\n\n비교적 빠른 시간 안에 주요 기술 공급업체들이 자사의 산업용 AI 플랫폼과 연계된 모델들을 차례대로 발표하기 시작했습니다 (예: Meta AI - 2023년 2월, AWS Bedrock - 2023년 4월, Palantir Artificial Intelligence Platform - 2023년 4월, Google Vertex AI - 2023년 6월, IBM WatsonX.ai - 2023년 7월). 기술과 기술 인재가 기술 실현 가능성을 입증하는 데 가장 중요했던 영역이었다면, 이제는 기업들이 성장을 위해 자사를 포지셔닝하려는 전략적 조정으로 변모하고 있습니다. 이는 설치된 사용자 베이스를 구축하고 보완적 자산 및 생태계를 개발하며 네트워킹 효과를 향상시킴에 초점을 맞추는 것으로 이어지고 있습니다. 이는 고도의 확장적 전략 파트너십의 현재 시기로 이어지고 있습니다. 기업들이 지배권을 확보하기 위해 결정적 전투를 헤쳐 나가기 위해 도와 줄 동맹을 형성하려고 하는 과정입니다. 우리는 또한 클라우드 인프라 자산을 활용하여 새로운 규제적 장벽을 가진 니치 시장에서 산업용 AI 자산을 가속화하는 과정을 관찰하고 있습니다.\n\n이러한 과정을 거치면서 기업들은 다양한 위험 요인을 고려해야 합니다. 예를 들어, 주요 디자인이 되지 못한 대안 접근 방식에 투자하는 AI 기업은 불리한 지위에 처할 수 있습니다. 결과적으로, 지배적 디자인에 적응하거나 채택해야 할 경우 현재 잠긴 비용 이상에 상당한 전략, 개발 및 투자 변화가 필요할 수 있습니다. 게다가, 산업용 AI 시장의 잠재력이 더욱 명확해지면 경쟁은 계속 격화되며 모든 시장 참가자들에게 압력을 가할 것이고 결국 합병 및 철수로 이어질 것입니다. 마지막으로, AI의 보급으로 인해 세계 정부 및 기관들이 AI의 책임 있는 배치와 보안 증진을 촉진하기 위해 규제 프레임워크를 업데이트하기 시작하고 있습니다. 이는 기업이 새로운 규정 요구 사항에 직면하여 자원이 많이 소비되는 구현을 할 수도 있는 추가적인 불확실성을 도입하고 있습니다. 엄격한 규제가 존재하는 시장에서는, 이러한 도구가 기본 요구 사항을 충족하지 못한다면, 산업용 AI 도구를 제공하는 데 장벽이 될 수도 있음을 염두에 두어야 합니다.\n\n<div class=\"content-ad\"></div>\n\n현재 기간은 기회가 없는 것은 아닙니다. 시장이 주류 디자인의 선두주자를 식별하면서, 주류 디자인(들)과 신속하게 조화를 이룰 수 있는 기능 또는 그러한 프레임워크 내에서 혁신할 수 있는 조직은 상당한 시장 점유율을 확보하기 위해 더 나은 위치에 있게 됩니다. 또한 시장이 주류 디자인을 중심으로 표준화되기 시작하는 가운데, AI 분야 내에서 새로운 니치가 등장할 수 있습니다. 이를 조기에 파악하고 활용할 경우, 기업은 강력한 존재감을 확립하고 최초 진입자 이점을 누릴 수 있습니다.\n\nIV. 기술적 우위의 지표\n\n현재 주류 디자인 경쟁이 계속되는 가운데, 현재 진화하는 환경 내에서 생성적 AI 애플리케이션의 표준을 설정하고 시장 리더십을 확립할 수 있는 기술이나 기업을 예측하는 데 도움이 되는 여러 지표의 등장을 기대할 수 있습니다.\n\n- 시장 점유율에서 리더십 등장: 시장에서 큰 설치된 사용자 베이스를 확보할 수 있는 AI 기업 및 플랫폼은 선두주자의 지위를 차지할 수 있습니다. 이는 플랫폼의 널리 채택되거나 사용자 참여가 증가되는 것, 매출액이 증가하는 것, 또는 특정 시장 내의 고객들을 통해 시사될 수 있습니다. 시장 점유율에서의 조기 선도는 잠재적인 우위를 나타내는 중요한 지표가 될 수 있습니다.\n- 생태계의 개발과 확장: 서로 다른 생성적 AI 기술 주변의 생태계를 관찰함으로써, 생성적 AI 플랫폼의 가치를 높일 수 있는 보완 기술을 갖춘 강력하고 확장성 있는 생태계를 식별할 수 있습니다. 이러한 생태계의 강도는 기술의 채택 및 장기적인 지속 가능성에 중요한 역할을 합니다.\n- 전환 비용: 생성적 AI 플랫폼에서 다른 플랫폼으로 이동하는 데 관련된 전환 비용은 사용자가 경쟁 기술로 이동하는 것을 억제할 수 있으며, 이로써 현재 선도 업체의 위치를 강화할 수 있습니다. 이에는 데이터 통합 문제, 기계 학습 모델 재교육의 필요, 계약 및 비즈니스 종속성이 포함될 수 있습니다.\n- 설치된 베이스의 크기: 큰 사용자 및 솔루션 설치 베이스는 네트워크 효과를 향상시키고 신뢰성, 지원 생태계, 상호 운용성 및 학습 효과로 인해 추가 사용자를 유도할 수 있는 핵심 집단을 제공합니다. 이는 안정성, 지원 및 견고함에 대한 긍정적 피드백을 받는 브랜드가 경쟁 우위를 확보할 가능성이 높습니다.\n- 혁신과 개선: 생성적 AI 제품에 대한 기업의 혁신 투자는 우위를 나타낼 수 있습니다. 시장이 신통성 있고 신뢰할 수 있는 기술을 선호할 수 있지만, 계속적인 개선과 사용자 요구에 대한 적응은 계속된 경쟁력을 위해 중요할 것입니다.\n- 규정 준수 및 윤리적 기준: 인기 있는 생성적 AI 기술에 대한 신뢰성 및 신뢰도에 대한 시장 의견을 측정하십시오. 시장 소비자는 종종 성능과 혁신보다 신뢰성과 신뢰성을 선호합니다. 신뢰할 만하다고 여겨지며 사용자 지원 및 견고성에 대한 긍정적 피드백을 받는 브랜드가 경쟁 우위를 얻을 가능성이 높습니다.\n- 혁신과 향상: 회사의 생성적 AI 오퍼링에 대한 혁신 투자는 우위를 나타낼 수 있습니다. 시장이 안정적이고 신뢰할 만한 기술을 선호할 수 있지만, 지속적인 개선과 사용자 요구에 대한 적응이 계속된 경쟁력을 위해 중요할 것입니다.\n- 규제 준수 및 윤리적 기준: 증가하는 규제에 준수하여 윤리적으로 일치된 AI를 개발하는 데 선도하는 기업 및 기관은 시장에서 선호되어질 수 있으며, 특히 규제가 엄격한 산업에서 그렇습니다. 이는 운영 가치를 위해 활용될 수 있는 기술에 대한 네트워크 승인 및 독특한 보안 요구 사항이 중요한 연관된 역할을 하는 연방 시장 내에서 특히 중요합니다.\n\n<div class=\"content-ad\"></div>\n\n위 지표를 모니터링함으로써 조직은 중요한 전투 단계 중 발전적 AI 분야의 선두 기술로 부상할 기술을 어떤 것으로 예측할 수 있는 통찰력을 얻을 수 있습니다. 이러한 동향을 이해하는 것은 발전적 AI 기술에 대한 투자, 개발 또는 구현 결정을 내릴 때 중요합니다.\n\nV. 결론\n\n- 발전적 AI에서 주도 디자인을 확립하는 것은 시장 안정성과 산업 전체 표준화에 중요한 단계이며, 시장 수용 확대 및 기업과 소비자 모두에게 불확실성 감소로 이어질 것입니다. - 떠오르는 주도 디자인에 영향을 미치거나 이를 적응시킬 수 있는 기업은 경쟁 우위를 확보하며, 새로운 기술 패러다임의 시장 선두자로 자리 잡을 것입니다. 그러나 최종적으로 표준이 되지 않는 제품 생태계를 선택하게 되면 시장 점유율이 줄어듦과 동시에 기업은 이제 주도 디자인으로 전환해야 하는 정확한 전환 비용을 치뤄야 할 것입니다.\n\n- 산업이 순조로운 흐름에서 구체적인 방향으로 이동함에 따라, 주도 디자인으로 가는 점성이 점점 높아지면서 전략적 선견지명과 민첩성은 훨씬 더 중요해집니다. 기술로부터 가치를 창출하고 기술이 가져다 주는 영향을 전달하려는 조직이라면 미래 동향을 예측하고 AI 기술의 새로운 발전과 소비자 요구의 변화에 신속하게 대응해야 합니다. 기술적 변화의 궤적을 상상하고 이에 적극적으로 대응하는 기업은 단지 견딜 뿐만 아니라 디지털 변혁 새 시대에서 선구자로서 돋보일 것입니다. 그러나 그렇지 못하는 기업은 역사의 아카이브로 낙인을 찍을 것입니다.\n\n<div class=\"content-ad\"></div>\n\n본 글에서 표현된 모든 견해는 작성자 개인의 견해입니다.\n\n참고문헌:\n\n[i] J. Utterback, W. Abernathy, “A dynamic model of process and product innovation,” Omega, Vol. 3, Issue 6. 1975\n\n[ii] W. Abernathy, J. Utterback, “Patterns on Innovation”, Technology Review, Vol. 80, Issue 7. 1978\n\n<div class=\"content-ad\"></div>\n\n[iii] F. Suárez, J. Utterback, “Dominant Designs and the Survival of Firms,” Strategic Management Journal, Vol. 16, №6. 1995, 415–430\n\n[iv] F. Suárez, “Battles for technological dominance: an integrative framework,” Research Policy, Vol. 33, 2004, 271–286\n\n[v] E. Fernández, S. Valle, “Battle for dominant design: A decision-making model,” European Research on Management and Business Economics, Vol. 25, Issue 2. 2019, 72–78\n\n[vi] W.B. Arthur, “Competing Technologies, Increasing Returns, and Lock-In by Historical Events,” The Economic Journal, Vol. 99, №394, 1989, 116–131\n\n<div class=\"content-ad\"></div>\n\n[vii] F. van der Vlist, A. Helmond, F. Ferrari, “대규모 AI: 클라우드 인프라 의존성 및 인공 지능 산업화,” Big Data and Society, 2024년 1-3월: I-16, 1, 2, 5, 6","ogImage":{"url":"/assets/img/2024-05-16-ThePathtoDominantDesigninGenerativeAI_0.png"},"coverImage":"/assets/img/2024-05-16-ThePathtoDominantDesigninGenerativeAI_0.png","tag":["Tech"],"readingTime":8},{"title":"벤치에서 내려와 본래의 디자이너 창업자로 다시 돌아가기로 결정한 이유 FAANG 디자인 매니저 일자리를 그만두다","description":"","date":"2024-05-16 19:12","slug":"2024-05-16-GettingOffTheBenchWhyIquitmyFAANGdesignmanagergigtoreturntomyrootsasadesignerfounder","content":"\n\n제 아마존 네트워크 대부분이 알고 있는 뉴스는 3월 중순에 AWS에서 퇴사했다는 것입니다. AWS Design Manager III로서의 자진 퇴사이며, 부정적인 성과 평가로부터 어떤 압박도 없이 (제가 아는 한에서는 성과가 높고 성능이 탁월한 디자인 리더로서 높은 수행 능력을 보이고 있었습니다) 클라우드 아키텍처 \"컨테이너\" 공간의 세 가지 매우 재능 있는 디자인 팀을 이끌었습니다: Elastic Kubernetes Service (EKS), Elastic Container Service (ECS) 및 Elastic Container Registry (ECR). 그래서 많은 개발자들은 저에게 \"두 년의 벼랑 낭떠러지\"에 도달했다고 말했는데, 저는 2022년 5월부터 2024년 3월까지 일했습니다.\n\n그래서 여러분은 아마도 현재 시장에서 FAANG(페이스북 애플 아마존 넷플릭스 구글) 회사에서 일하는 직장을 그만두는 이유를 궁금해할 수 있습니다. 짧게 말하면 - 왜냐하면 \"성채 밖에서\" 더 많이 하고 더 잘할 수 있다고 믿기 때문에 실제 디자이너로서의 뿌리로 돌아가려고 한다는 것입니다. 곧 자세히 설명하겠습니다. \n\n# 기업 UX에서 얻은 것\n\n![텍스트](/assets/img/2024-05-16-GettingOffTheBenchWhyIquitmyFAANGdesignmanagergigtoreturntomyrootsasadesignerfounder_0.png)\n\n<div class=\"content-ad\"></div>\n\n저는 Fortune 500 소프트웨어 기업에서의 근무를 마치고 나와서, 디자인과 제품 관점에서 좋았던 몇 가지 긍정적인 점을 되새겨보고 싶어요...\n\n- 비즈니스 통찰력과 제품 전략: 아마존 웹 서비스의 고객 지향성과 비즈니스 전략을 통해 배운 것과 세 개의 수십억 달러 규모의 마이크로서비스에 기여한 경험이 특별했어요. 가장 재능 있는 제품팀들과 함께 아이디에이션 워크샵을 진행하거나 Kubernetes와 컨테이너 오케스트레이션에 대해 깊이 공부하거나, 디자인 팀을 위해 새로운 워크플로우 자동화를 만든 경험, 이 모든 것이 AWS의 한 부분으로 있었던 것은 정말 특별한 경험이었어요. 아마존에서 일하는 것은 MBA를 받는 듯한 느낌이었습니다.\n- 오라클의 디자인 중심 문화를 통해 기업에서의 디자인 가치: 오라클처럼 큰 기업이 사용자 경험에 대해 이렇게 강조하는 것을 본 적이 없어요. 오라클 넷수트에서 \"UI Components\"라는 디자인 팀을 이끌었는데, 이 팀은 샌프란시스코 디자인 위크 2022의 \"시스템 디자인\" 상을 수상한 레드우드 디자인 시스템에 기여했어요. 여기서 전체 기업이 우수한 CX와 UX에 의해 주도되는 조직과 보고 구조를 보았는데, 단순히 제품 및 엔지니어링을 지원하는 역할보다 더 중요한 역할을 하는 걸 목격했어요.\n- 애자일에서의 디자인: CVS 헬스/Aetna에서 출시 트레인의 일환으로써 디자인팀을 이끌었던 적이 있었는데, 이것은 감동적이고 완전히 다른 경험이었어요. 환자/의료 공급자 검색 및 절차 결과를 위한 블루 스카이 UX/UI 솔루션을 만드는 것이 특별했어요. 팀을 전면 원격으로 전환한 이 경험도 결코 잊지 못할 것입니다.\n- 핀테크에서의 데이터 중심 UX: 그 전에는 TD Ameritrade에서 8년간 가장 긴 시간을 보내며 시니어에서 프린시펄 디자이너로, 그리고 디자인 리더십까지 올랐어요. 여기서 저는 데이터 중심 디자인, 고급 트레이딩, 핀테크 UX에 더 많이 몰두했죠.\n\n# 다음은 무엇일까요? 디자인 폭스\n\n전문가로서의 디자이너입니다. 세기의 전환, 즉 뉴올리언스의 작은 디자인 학교에서 디자인 학위를 취득했고, 비영리 단체나 컨설팅 기업, 시카고에 자신의 스튜디오를 설립하거나 노스웨스턴대학에서 디자인을 가르친 경험을 가졌어요. 디자인이 제 혈액 속에 흐르는 것이죠. 최근 디자인 분야의 리더 중 한 명인 Cap Watkins은 최근 The Rebalancing of Design Management에서 \"우리는 연출 감독의 에너지를 좀 더 가져야 한다: 세부 사항에 얽매이는 것...\"이라고 썼어요. 저는 아마존에서 자주 \"레버를 누르는\" 것이나 조직적인 난관을 극복하기 위해 애쓰는 모습을 보였지만 사실은 더 많이 현장에서 일하고 싶었어요. 분명히 관리자에서 개인 기여자(IC)로 전환할 수도 있었겠지만, 대신 완전히 자신만의 것을 만들기로 결심했어요.\n\n<div class=\"content-ad\"></div>\n\n이제 새로 만든 디자인 컨설팅 회사 Design Fox로 그 일을 하고 있어요. 이 회사의 목표는 AI를 활용하여 UX를 강화하는 것, 내부에서 하는 것보다 CX/UX를 훨씬 빠르게 시장에 내놓는 것, 그리고 고객 관계 관리(CRM), 기업 자원 계획(ERP), 클라우드 아키텍처 및 FinTech 공간의 SaaS 기업을 특히 겨냥하는 것입니다.\n\n여우를 선택한 이유는 무엇일까요? 기술 분야에서는 '유니콘'에 관해 많이 알고 있습니다. 여우는 유사한 의미를 가지고 있어요. 상호작용 디자인 재단에 따르면 \"UX 여우\"는 UX 분야뿐만 아니라 마케팅, 비즈니스, 컨설팅 및 기업 내 기업에 대한 통찰력을 제공할 수 있는 특수한 유형의 디자인 전문가입니다.\n\nDesignFox.io에서 새로운 시도에 대한 모든 세부 정보를 확인할 수 있어요! 전문 디자인 솔루션을 필요로 하지만 정규직 디자이너를 고용하고 싶지 않나요? Design Fox는 무제한 요청이 가능한 월간 구독 모델을 사용하고 있어요.\n\n<div class=\"content-ad\"></div>\n\n읽어 주셔서 감사합니다!","ogImage":{"url":"/assets/img/2024-05-16-GettingOffTheBenchWhyIquitmyFAANGdesignmanagergigtoreturntomyrootsasadesignerfounder_0.png"},"coverImage":"/assets/img/2024-05-16-GettingOffTheBenchWhyIquitmyFAANGdesignmanagergigtoreturntomyrootsasadesignerfounder_0.png","tag":["Tech"],"readingTime":3},{"title":"2024년을 위한 무료 Mockup 사이트 5선","description":"","date":"2024-05-16 19:11","slug":"2024-05-16-5FreeMockupSitesin2024","content":"\n\n![이미지](/assets/img/2024-05-16-5FreeMockupSitesin2024_0.png)\n\n이 모킹업 영감들은 대부분 무료이며 매우 고품질의 모킹업이 포함되어 있어요.\n\n시작하기 전에, 디자이너들을 위해 고르게 선별된 200개 이상의 유사한 디자인 자료에 무료로 접속할 수 있는 UiPedia가 있어요. 지금 확인해보세요.\n\n더이상 지루하게 만드리 않도록 바로 시작해봐요.\n\n<div class=\"content-ad\"></div>\n\n## 1. Morflax\n\n멋진 템플릿, 간단한 인터페이스 및 프리미엄 모델을 갖춘 강력한 3차원 장치 온라인 모형 빌더입니다.\n\n웹사이트 링크\n\n![링크](/assets/img/2024-05-16-5FreeMockupSitesin2024_1.png)\n\n<div class=\"content-ad\"></div>\n\n## 2. 모방 생성기\n\n쉽게 사용할 수 있는 무료 모방 생성기입니다. 모방을 선택하고 디자인을 업로드하면 모방 이미지를 다운로드할 수 있습니다. 가장 좋은 점은 모두 무료이고 워터마크를 사용하지 않습니다.\n\n[웹사이트로 이동](https://www.example.com)\n\n![이미지](/assets/img/2024-05-16-5FreeMockupSitesin2024_2.png)\n\n<div class=\"content-ad\"></div>\n\n## 3. Creatoom\n\n매우 클래식한 모큭업 웹사이트입니다. 유료이지만 훌륭한 템플릿과 멋진 무료 항목들이 있습니다. 매우 깨끗하고 프리미엄한 인터페이스를 가지고 있습니다.\n\n[웹사이트로 이동](링크 주소)\n\n![이미지](/assets/img/2024-05-16-5FreeMockupSitesin2024_3.png)\n\n<div class=\"content-ad\"></div>\n\n## 4. 모의모델 세상\n\n인터넷에서 가장 좋은 무료 디자인 모의모델을 찾아보세요. 포장부터 디지털 자산까지 모두 한 곳에서 제공됩니다. 이 사이트는 무료 모의모델을 검색할 때 가장 먼저 볼 수 있는 사이트일 수 있지만, 품질은 그 평판에 부응합니다.\n\n[웹사이트로 이동](링크 주소)\n\n![이미지](/assets/img/2024-05-16-5FreeMockupSitesin2024_4.png)\n\n<div class=\"content-ad\"></div>\n\n## 5. 샷\n\n의심의 여지없이, 이것은 제일 좋은 무료 온라인 모크업 편집기 중 하나입니다. 배경색 변경, 3D 모크업 기울임 등 다양한 사용자 정의 기능을 무료로 제공합니다. 정말 탐험할 가치가 있어요.\n\n[웹사이트 링크](Link to website)\n\n![이미지](/assets/img/2024-05-16-5FreeMockupSitesin2024_5.png)\n\n<div class=\"content-ad\"></div>\n\n마지막으로, UiPedia에서 더 많은 멋진 모형 사이트들과 다양한 리소스들을 찾아보실 수 있어요.\n\n![Mockup Sites](/assets/img/2024-05-16-5FreeMockupSitesin2024_6.png)\n\n이 기사가 도움이 되셨으면 좋겠어요.\n\n댓글로 피드백을 주시면 정말 감사하겠어요. 보고 싶은 다른 유형의 리소스가 있으면 알려주세요.\n\n<div class=\"content-ad\"></div>\n\n👋 안녕하세요. UI/UX 관련 디자인 주제나 사이드 플젝 개발에 관심이 있다면 LinkedIn과 Medium에서 저를 팔로우해주세요. 도움이 필요하시다면 제 Topmate을 확인해보세요.\n\n그리고 Gumroad 및 Figma Community에서 무료 UI/UX 자료도 많이 제공하고 있으니 꼭 확인해보세요 :)","ogImage":{"url":"/assets/img/2024-05-16-5FreeMockupSitesin2024_0.png"},"coverImage":"/assets/img/2024-05-16-5FreeMockupSitesin2024_0.png","tag":["Tech"],"readingTime":2},{"title":"게임 제작의 수수께끼 게임 디자인은 무엇으로 이루어지며 왜 필요한가요","description":"","date":"2024-05-16 13:21","slug":"2024-05-16-TheMysteryofGameCreationGameDesignwhatdoesitconsistofandwhyisitnecessary","content":"\n\n<img src=\"/assets/img/2024-05-16-TheMysteryofGameCreationGameDesignwhatdoesitconsistofandwhyisitnecessary_0.png\" />\n\n게임 창작의 예술: 게임 디자인은 기본적인 첫 번째 단계\n\n백만 명들의 마음을 사로잡으려는 모든 새로운 게임이 경쟁적인 게임 산업에서, 게임 창작의 기본 단계인 게임 디자인은 중요한 역할을 합니다. 여기서 아이디어가 탄생하고 미래 프로젝트의 기반을 닦으며 개념부터 출시까지의 흥미로운 여정이 시작됩니다.\n\n게임 디자인이란 무엇인가요?\n\n<div class=\"content-ad\"></div>\n\n게임 디자인은 게임 메커니즘, 이야기, 캐릭터, 그리고 게임 세계를 만드는 과정입니다. 예술과 과학이 결합된 영역으로, 창의력이 엔지니어링과 만나는 곳입니다. 게임 디자이너들은 플레이어들이 게임과 상호작용하는 방법, 무엇을 할 것인지, 어떻게 느낄지, 그리고 어떤 감정을 경험할지를 결정합니다.\n\n왜 게임 디자인은 가장 기본적인 첫 단계인가요?\n\n비전과 컨셉\n\n이 단계에서 게임의 핵심 비전이 형성됩니다. 게임 디자이너들은 프로젝트의 중심이 될 컨셉을 개발합니다. 이에는 다음이 포함됩니다:\n\n<div class=\"content-ad\"></div>\n\n- 장르 및 스타일: 게임이 RPG, 슈팅, 전략 또는 다른 장르로 결정되는 것\n\n- 타겟 오디언스: 게임이 어느 대상을 위해 만들어지는지 결정\n\n- 코어 게임 메카닉스: 게임의 독창성을 정의할 중요한 게임플레이 요소 개발\n\n이야기와 캐릭터\n\n<div class=\"content-ad\"></div>\n\n이야기와 캐릭터는 플레이어를 끌어들이고 유지하는 데 중요한 역할을 합니다. 게임 디자인 단계에서 이야기의 기초를 만들고, 캐릭터는 개발되며 그들의 동기와 상호 작용이 개발됩니다. 제대로 갖춰진 이야기와 매력적인 캐릭터는 게임을 잊지 못할 만하게 만들어 줍니다.\n\n프로토타이핑\n\n본격적인 개발로 나아가기 전에 프로토타입을 만듭니다. 이를 통해 핵심 아이디어와 메커니즘을 초기 단계에서 테스트하고, 잠재적인 문제를 식별하고 필요한 조정을 할 수 있습니다. 프로토타입은 간단할 수 있지만, 게임이 어떻게 작동할지에 대한 중요한 통찰력을 제공합니다.\n\n게임 디자인 문서의 중요성\n\n<div class=\"content-ad\"></div>\n\n게임 디자인 문서 (GDD)는 게임의 모든 측면을 설명하는 상세한 가이드입니다. 전체 개발팀을 위한 로드맵 역할을 하며 다음을 포함합니다:\n\n- 컨셉 및 메카닉 설명\n\n- 상세한 스토리 및 캐릭터 프로필\n\n- 시각적 및 오디오 요소\n\n<div class=\"content-ad\"></div>\n\n- 기술적 요구 사항과 제약 사항\n\nGDD는 개발 과정의 모든 단계에서 명확성과 구조를 확보하여 팀이 일치하고 효율적으로 작업을 처리할 수 있도록 돕습니다.\n\n결론\n\n게임 디자인은 게임 제작의 첫 번째이자 가장 중요한 단계 중 하나입니다. 전체 프로젝트의 기반을 마련하며, 그 방향과 독창성을 결정합니다. 게임 디자인에 충분한 주의를 기울이고 고품질의 게임 디자인 문서를 만들면, 개발자들은 성공할 확률을 크게 높일 수 있고 수백만 명의 마음을 사로잡는 게임을 만들 수 있습니다.\n\n<div class=\"content-ad\"></div>\n\n게임의 성공을 위한 게임 디자인에서 가장 중요한 측면은 무엇이라고 생각하시나요? 의견을 댓글로 공유해 주세요!","ogImage":{"url":"/assets/img/2024-05-16-TheMysteryofGameCreationGameDesignwhatdoesitconsistofandwhyisitnecessary_0.png"},"coverImage":"/assets/img/2024-05-16-TheMysteryofGameCreationGameDesignwhatdoesitconsistofandwhyisitnecessary_0.png","tag":["Tech"],"readingTime":2},{"title":"번개가 우리 개를 바꾼 날","description":"","date":"2024-05-16 13:19","slug":"2024-05-16-TheDayThunderChangedOurDog","content":"\n## 유머\n\n![thunder](/assets/img/2024-05-16-TheDayThunderChangedOurDog_0.png)\n\n어릴 적 우리 개 페퍼는 천둥 소리를 무서워했어요.\n\n- 소리에 도망갔어요.\n- 울음을 지렸어요.\n- 한 번은 폭풍이 그녀를 거실의 한 코너로 날리게 했어요. 바로 엄마와 아빠가 우리 애들을 책상에 섰을 때 사용한 그 코너죠. 그 코너는 지금까지 내 몸의 코너 모양을 의미하는 유일한 곳이에요.\n- 여기에 내년이 지날 때까지 서 있었어요. 분노로 전율하며 소리 없이 손톱으로 그림을 새기곤 했어요 - \"지옥\", \"똥\", \"빌어먹을\" 등을, 엄마와 아빠에게 그들의 칭찬을 비밀리에 되갚았어요.\n- 페퍼가 그 코너로 도망쳐 들어간 것은 우리가 자주 거기에 있던 모습을 본 게 아닐까 해요. 용서의 폭풍에서 도망치던 우리 부모님을 본 게 그녀로서는 그곳이 천둥 시절의 안전하지 않은 집일 것 같았던 게겠죠.\n- 그 코너로 뛰어 들었지만 머리로 코너를 들고 뛰어들진 않았어요.\n- 다리를 들었죠.\n- 마치 곰 같이 말이에요.\n- 가능한 높이까지 팔을 뻗었어요.\n- 거기 서 있더니 떨면서,\n- 전율하는 발톱이 지옥, 똥, 빌어먹을을 도는 듯했어요.\n\n<div class=\"content-ad\"></div>\n\n\n![Image](/assets/img/2024-05-16-TheDayThunderChangedOurDog_1.png)\n\nAnother time, lightning struck our backyard, which means the flash and the boom arrived together. My grandmother was visiting and said, “I felt the hair stand up on my legs.”\n\nPepper did too. She took off running, shooting poo behind herself in a line that made her easy to track.\n\n## And Now For The BIG ONE\n\n\n<div class=\"content-ad\"></div>\n\n천둥이 울리자 페퍼는 뛰었다. 여기저기, 위층 아래층을 오가며 달렸다가...\n\n사라졌다.\n\n이번에는 개똥을 싸지 않아서 찾는 데 영원히 걸렸다. 결국 우리는 그녀를 찾았다: 엄마와 아빠의 침대 아래에 숨어 있었다.\n\n불가능해.\n\n<div class=\"content-ad\"></div>\n\n왜요?\n\n페퍼는 큰 개가 아니었지만 튼실한 배를 가지고 있었어요. 그녀는 비만이 아니라, 행복했죠.\n\n하지만 그 침대 아래로 들어갈 자리가 없을 정도로 행복했어요.\n\n강철 프레임은 바닥으로부터 8인치 떨어져 있었어요. 반면에 페퍼는 어떻게 자리를 잡더라도 적어도 두 개의 침대 프레임과 반 개만큼은 바닥에서 높았어요.\n\n<div class=\"content-ad\"></div>\n\n그녀는 그렇게 깊게 들어가 있었다.\n\n`![사진](/assets/img/2024-05-16-TheDayThunderChangedOurDog_2.png)`\n\n그녀는 침대의 정 중앙에 자신을 들어마구 끼워 넣었다. 불가능한 일이지만 결국 사실인 것을 완전히 느끼게 되었다. 그녀를 빼내려면 침대를 들어야 하는 순간 우리는 이게 얼마나 사실인지 느꼈다.\n\n폭풍우 한 주 뒤, 페퍼는 변하기 시작했다.\n\n<div class=\"content-ad\"></div>\n\n천둥 변이가 시작되었습니다...\n\n우리가 그녀를 쓰다듬을 때 느꼈습니다: 그녀의 상부가 이상했습니다.\n\n- 푹신했습니다\n- 쫄깃했습니다\n- 다르게 느껴졌습니다\n\n폭풍우가 오기 전에, 그녀에게는 상부가 있었습니다. 이제는 거품이 생기고 털로 뒤덮인 혹, 어깨뼈가 물이 가득한 두려움으로 부풀어난 것이었습니다.\n\n<div class=\"content-ad\"></div>\n\n작은 덩어리가 점점 성장했어요.\n\n페퍼는 자신이 낙타로 변하는 것을 전혀 깨닫지 못하는 것 같았어요. 거울에 비친 모습은 아무것도 말해 주지 않았어요. 그녀는 거울이 제시하는 이미지나 그것들을 믿지 않았어요. 그녀 눈 속 지루한 표정은 모든 거울에게 \"거짓말쟁이\" 라고 말하는 것 같았어요.\n\n게다가, 덩어리는 그녀의 시력에서 빠진 곳에 숨어 있었어요. 만약 우리가 그녀에게 그 덩어리나 그녀 목 뒤에 직접적으로 있는 것을 믿게 하려고 했다면 아마도 우리를 거짓말쟁이라고 불렀을 거예요.\n\n덩어리는 계속해서 성장했어요. 그것은 우리가 하나님을 기억하고 기도할 때까지 성장했어요:\n\n<div class=\"content-ad\"></div>\n\n\"오 주님, 혹시 저 봉우리를 없애 주시되 아직 제게 가져가지 마십시오.\"\n\n어찌 되었건, 우리는 개가 새 부위를 자라는 걸 본 적이 없었다. 만약에 날개가 자란다면? 그리고 만약에 여전히 봉우리라면, 오 하느님, 그것은 편한 베개였다. 영화를 보거나 학교에서 지난 어려운 날을 회복하는 데 용이했다.\n\n이 봉우리는 곧 두려움으로 가득 찼지만, 이제는?\n\n누군가를 사랑할 때, 그 사람의 몸에서 유독 피해를 주지 않는다면 무엇이 자라든 환영받는다. 그래서 우리는 그 봉우리를 사랑 가득한 눈으로 바라보았다. 그것은 개의 나라에 있는 낙타 대사관이었고, 친절한 이글루였고, 밝은 요르트였다. 그것은 올리브 가든이었다: 여기에 있을 때는, 봉우리야, 우리 중 한 명으로 생각하자.\"\n\n<div class=\"content-ad\"></div>\n\n\n![Image](/assets/img/2024-05-16-TheDayThunderChangedOurDog_3.png)\n\nBut it couldn’t last.\n\nIf you’ve seen E.T., you understand.\n\nThe scientists wouldn’t let us keep our new friend. A vet took one look and gave Hump a new name:\n\n\n<div class=\"content-ad\"></div>\n\n“농양.”\n\n“그는 농양이 아니에요,” 아이들이 소리를 질렀다. “젠장, 씨, 젠장, 그는 험프야!”\n\n과학은 우리를 무시했다.\n\n페퍼와 험프를 떠내고 벗겨놨어요.\n\n<div class=\"content-ad\"></div>\n\n\"험!\" 우리는 소리쳤어요. \"함께 있어요! 제발요! 함께! 여기 있을게요! 여기 있을게요!\"\n\n다음에 우리가 페퍼를 보게 된 순간...\n\n험은 사라졌어요.\n\n과학자들이 두 개의 절편을 만들었어요, 두 개의 문, 험의 따뜻한 영혼이 울어 사라진 눈의 집합을 통해서요.\n\n<div class=\"content-ad\"></div>\n\n그리고, 정령이 다시 돌아오지 않도록 하기 위해 낙타의 눈을 통과시키는 고무 리본을 꿰어 매는 것 같은 일을 했습니다. 그 위에는 리본을 묶어 줬어요.\n\n페퍼는 이제 서류가방처럼 되었어요. 그녀에게는 손잡이가 있었죠.\n\n과학자들은 우리 눈을 보고 우리의 의도를 짐작했어요. \"서류가방처럼 들지 마세요,\" 그들이 말했습니다. \"이게 손잡이가 아닙니다.\"\n\n아니죠, 그건 리본이었죠.\n\n<div class=\"content-ad\"></div>\n\n햄프가 떠난 우리 애완견을 기억하는 띠.\n\n우리가 수의사 진료소를 떠나 페퍼와 함께 집으로 돌아오면 모든게 다시 평화롭게 됩니다. 지루한 평범한 일상이 돌아왔어요.\n\n<div class=\"content-ad\"></div>\n\n하지만, 그렇게 되지 않았어요.\n\n바로 우리는 페퍼가 텅 빈 마음을 되찾은 것처럼 느꼈습니다.\n\n누수가 나버렸죠.\n\n그녀는 침대, 소파, 바닥, 손에 누출물을 흘렸어요! 우리는 그녀를 쓰다듬기 원했고, 사랑하고, 평소처럼 최고의 가시를 주고 싶었지만, 우리는 함프의 젖은 유령에 속절없이 놀랐어요.\n\n<div class=\"content-ad\"></div>\n\n우리는 옷을 입힌 Pepper가 있었어요.\n\n그녀는 아빠의 가장 오래된 티셔츠를 차례대로 입고, 그 위에 삭혔는데, 어둠의 웅덩이가 퍼져 티셔츠를 충분히 축축해지기 전까지 누출되었어요. 그 때만큼은 티셔츠를 벗기고, 태우고, 묻었죠.\n\n엄마는 오랜 시간동안 아빠의 낡은 셔츠와의 전쟁을 벌였고 이겼어요. 그냥 덩이라는 기적이 필요했을 뿐이었죠.\n\nPepper가 아빠의 유명한 티셔츠를 입은 모습을 보면 웃기기도 했어요. 주위를 돌아다니며 아빠 같은 냄새가 나고, 누출되었더라도 그래도 움직이기에 헷갈렸어요. 우리는 아빠를 안았을 때, \"손가락에 계속 냄새를 맡는 이유가 뭐야? 나 누출하고 있지 않아.\" 하고 말했죠. 혹은 우리가 잊고 Pepper를 제한 없이 안고 Hump으로 물들어 도망다닐 수도 있었어요.\n\n<div class=\"content-ad\"></div>\n\n![Image](/assets/img/2024-05-16-TheDayThunderChangedOurDog_5.png)\n\n마침내 우리의 옛 친구 중 마지막 하나가 사라졌다. 과학은 리본을 제거했고 Hump의 눈을 꿰맨 다음엔 그게 끝이었다.\n\n그러나 정말 그랬을까?\n\n오늘날에도 Pepper를 생각할 때면 Hump를 떠올린다. 둘은 하나다. 어떠한 치료도, 어떤 정교하고 숙련된 치료도 나의 마음 속에서 둘 사이를 분리시킬 수 없었고, 그 덕분에 마주치는 모든 개들이 내게 특별한 무언가, 잠재력을 부여한다.\n\n<div class=\"content-ad\"></div>\n\n나는 후딱 닦아주며 꿈을 꾸죠.\n\n물론 내 개 블라썸과 함께. 블라썸과 함께 말이죠. 그녀는 페퍼를 생각나게 해. 그녀는 페퍼처럼 검은색과 흰색의 털을 가지고 있고, 특별한 두려움을 가지고 있어요:\n\n그녀는 천둥을 무서워해요.\n\n천둥이 울리면 그녀는 도망가고, 울고 있어요. 천둥이 울릴 때, 나는 하늘을 보며 기억해요.\n\n<div class=\"content-ad\"></div>\n\n저는 리본을 기억합니다. 리본 이전의 이야기, 예전에 떠난 제 사랑하는 Pepper가 등에 기적을 가졌던 친구에 대한 이야기를 생각해냅니다.\n\n그는 제 집으로 왔습니다. 사랑을 위해.\n\n그가 제게 왔습니다.\n\n번개가 치고 꽃이 피면, 저는 Blossom을 안전한 자리로 인도하려 노력합니다. 아무것이나 숨을 수 있는 낮은 곳, 보폭이 좁은 곳. 커피 테이블 아래, 서랍장 아래, 인형 벤치 아래, 모든 침대 밑으로.\n\n<div class=\"content-ad\"></div>\n\n(표를 마크다운 형식으로 변경해주세요.)\n\n<div class=\"content-ad\"></div>\n\n제가 여기 있을게요.\n\n언제나요.\n\n![이미지](/assets/img/2024-05-16-TheDayThunderChangedOurDog_7.png)\n","ogImage":{"url":"/assets/img/2024-05-16-TheDayThunderChangedOurDog_0.png"},"coverImage":"/assets/img/2024-05-16-TheDayThunderChangedOurDog_0.png","tag":["Tech"],"readingTime":6},{"title":"아이언핵 챌린지 1 디자인 씽킹","description":"","date":"2024-05-16 13:18","slug":"2024-05-16-Ironhackchallenge1DesignThinking","content":"\n\n<img src=\"/assets/img/2024-05-16-Ironhackchallenge1DesignThinking_0.png\" />\n\n# 소개\n\nCitymapper는 여러 국가에서 이용 가능한 애플리케이션으로, 지점 A에서 지점 B로의 최적의 대중교통 여행을 찾는데 도움을 줍니다.\n\n앱의 한 측면인 다양한 종류의 대중교통 티켓 이해와 구매 과정을 충분히 다루지 못하고 있습니다.\n\n<div class=\"content-ad\"></div>\n\n저희의 목표는 교통편 티켓 구매와 관련된 복잡한 작업을 간편하게 만드는 것입니다. 특히 관광객이나 가끔씩 이용하는 사람들을 돕는 데 중점을 두고 있습니다.\n\n이동성 애플리케이션의 경쟁적인 환경에서 Citymapper는 구글맵과 같은 전 세계적으로 잘 알려진 플랫폼들과 함께, 파리에서의 IDF Mobilité와 같은 지역 애플리케이션들과 경쟁하고 있습니다.\n\n# 공감하기\n\n5명의 사람들을 대상으로 외국 도시에서의 여행 조직 및 해외 교통티켓 구매 경험에 대해 인터뷰를 진행했습니다.\n\n<div class=\"content-ad\"></div>\n\n- 레옹, 30, 가끔 여행객\n- 알리스, 30, 가끔 여행객\n- 주르, 32, 숙련된 여행객\n- 프레데리크, 50, 숙련된 여행객\n- 마리, 29, 숙련된 여행객\n\n다음 질문이 있었습니다:\n\n- 프랑스 내외로 여행할 때 새로운 도시에서 교통을 어떻게 조직하시나요?\n- [CityMapper 또는 다른 앱을 언급하면] 해당 애플리케이션에 대해 어떻게 생각하시나요? 어떤 점이 마음에 드시나요? 개선할 점이 있다면 무엇인가요?\n- 교통티켓을 구매하는 방법은 무엇인가요 (조직, 결제 방식, 티켓 종류, 불편한 점)? 결제 경험을 개선할 수 있는 방법은 무엇인가요?\n\n인터뷰를 한 사람 중 거의 아무도 교통티켓을 온라인으로 구매할 것을 기대하지 않습니다.\n\n<div class=\"content-ad\"></div>\n\n현장에서 구입한다면 런던의 교통 시스템처럼 빠르다면 불편하지 않습니다. 거기서는 접촉식 결제로 직접 탑승할 수 있어요. 하지만, 불명확하거나 줄을 서야 하는 구매는 문제가 되곤 해요.\n\n또한 3명의 사용자들은 각 도시에서의 구매 과정의 다양성을 강조했으며, 한 명은 가끔 혼란스러움을 느낀다고 고백했어요.\n\n# 정의\n\n주요 도움이 필요한 부분은 티켓 구매의 이해도, 어떤 도시에서는 교통티켓 구매의 유연성과 속도의 부족, 그리고 여러 구매 과정 간 일관성의 부재라고 할 수 있어요.\n\n<div class=\"content-ad\"></div>\n\n# 아이디어 도출\n\n다양한 고통 포인트에 대응하기 위해 우리는 다음을 해야 합니다:\n\n- 사용자의 편의를 높이기 위해 티켓 구매 옵션의 이해를 간단화합니다.\n- 사용자들이 빠르고 쉽게 티켓을 구매할 수 있도록 모바일 결제를 가능하게 합니다. 대화를 나눈 대부분의 사용자들이 온라인 구매 옵션을 찾고 있지는 않지만, 제공한다면 순조롭고 빠르며 일관성 있는 문제를 해결할 수 있을 것입니다.\n\n# 프로토타입\n\n<div class=\"content-ad\"></div>\n\n먼저, 사용자들이 티켓을 어디서 구매할 수 있는지, 어떤 옵션이 가능한지, 그리고 구매 방법을 이해할 수 있는 옵션을 추가해야 합니다 :\n\n다음으로, 그들이 원한다면 온라인으로 티켓을 구매할 수 있도록 하고 싶습니다 :\n\n# 주요 배운 점\n\n이 연습이 나에게 무엇을 가르쳐 주었을까요?\n\n<div class=\"content-ad\"></div>\n\n- 공감: 사용자들이 항상 예상한 대답을 제공하지는 않을 수 있으며, 따라서 예상한 해결책으로 이끄는 것이 어려울 수 있습니다. 인터뷰 중에는 꼭 스크립트에 엄격히 고수하느라말고, 듣고 적응하는 것이 중요합니다.\n- 정의 및 아이디어 도출: 이러한 단계들은 공감 단계의 성공에 의존합니다. 만약 효과적으로 수행했다면, 정의하고 아이디어를 도출하는 것이 훨씬 쉬울 것입니다.\n- 프로토타입: \"좋은 것의 적성이 높은 것입니다.\" 프로토타입을 만들 때 마스터피스를 만드는 것은 필수적이지 않습니다. 더 간단한 것이 더 나은 것입니다 (제가 받아들이기 어려운 부분입니다)!","ogImage":{"url":"/assets/img/2024-05-16-Ironhackchallenge1DesignThinking_0.png"},"coverImage":"/assets/img/2024-05-16-Ironhackchallenge1DesignThinking_0.png","tag":["Tech"],"readingTime":3},{"title":"과학과 신화 사이 다크 모드가 기본 사용자 인터페이스 설정이 될 수 있을까","description":"","date":"2024-05-16 13:17","slug":"2024-05-16-BetweenScienceandMythsCouldDarkModeBecometheDefaultUserInterfaceSetting","content":"\n\n저절로 어두운 모드가 기본 사용자 인터페이스 설정이 될 수 있는 시점에 도달할 수 있을까요? 그게 유일한 옵션이 된다면 어떨까요? '라이트 모드'와 '다크 모드' 사이의 실제 차이점에 대해 이야기해보고, 현재의 트렌드를 넘어서 어두운 모드가 사용자에 미치는 영향을 과학적으로 살펴보고 언제 사용해야 하는지 알아봅시다.\n\n먼저, 중학 시절의 기본 교훈으로 잠시 돌아가 볼게요. 이 기억해 두면 좋을 몇 가지 중요한 내용이 있습니다:\n\n- 후각: 눈의 중심에 위치한 검은색 원형 구멍입니다.\n- 망막: 눈의 뒷면에 위치한 빛에 민감한 층으로, 빛을 처리하고 신경 자극을 보내 이미지를 만듭니다.\n- 동공 기능: 동공은 빛이 망막에 도달할 수 있도록 하는 게이트웨이 역할을 합니다.\n- 동공 크기 변화: 동공의 크기는 빛 조건에 따라 변화합니다. 밝은 빛에서는 수축하고 어두운 빛에서는 확장하여 더 많은 빛이 통과할 수 있도록 합니다.\n\n# 사용자 인터페이스 디자인에서 대비 이해하기:\n\n<div class=\"content-ad\"></div>\n\n- 부정적 대조: 배경이 어두우고 텍스트가 밝을 때 발생합니다.\n- 긍정적 대조: 텍스트가 어두우고 배경이 밝을 때 발생합니다.\n- 대비 극성: 이 용어는 텍스트와 배경 간의 대비 비율을 설명합니다.\n\n# 다크 모드의 과제들\n\n나이가 들면서 동공이 빛에 대한 적응능력이 약해집니다. 동공을 제어하는 근육이 시간이 지남에 따라 약해져 빛에 대한 반응성이 줄어듭니다. 예를 들어,\n\n우리가 중요한 문제들을 자세히 살펴보겠습니다:\n\n<div class=\"content-ad\"></div>\n\n![image](/assets/img/2024-05-16-BetweenScienceandMythsCouldDarkModeBecometheDefaultUserInterfaceSetting_0.png)\n\n- 미세먼지 민감도: 노인들은 눈이 어두운 배경에서 밝은 글자를 읽을 때 시야를 어둡게 조절하는 능력이 느리기 때문에 어려움을 겪을 수 있습니다.\n- 추적능력과 날카로움: 물체를 따라가는 능력이 감소하고 시각적 선명도가 떨어지면, 다크 모드 인터페이스를 사용하여 읽고 상호작용 하는 것이 어려워질 수 있습니다.\n\n# 깊게 파고들어보기\n\n세부사항에 더 깊숙히 파고들기 전에, 아래 개념들을 좀 더 탐구해보시기 바랍니다:\n\n<div class=\"content-ad\"></div>\n\n- 구면 수차: 눈의 렌즈에 발생하는 불완전성으로 흐릿함을 유발할 수 있습니다.\n- 초점 깊이: 장면 내에서 수용할만한 선명한 거리의 범위입니다.\n\n# 실용적인 영향 및 팁\n\n다음은 UI/UX 디자이너들을 위한 몇 가지 실용적인 영향입니다:\n\n- 대상 고려: 대상의 연령대를 고려하세요. 사용자 그룹에 나이 많은 어른들을 포함할 경우 다크 모드와 라이트 모드 선택을 제공하여 접근성을 향상시킬 수 있습니다.\n- 사용자 맞춤 설정: 사용자가 선호하는 밝기와 대조 설정을 조정할 수 있도록 해주세요.\n- 테스트: 다양한 연령대의 사용자 그룹으로 사용자 테스트를 실시하여 인터페이스의 시각적 편안함과 사용성을 이해하세요.\n\n<div class=\"content-ad\"></div>\n\n다음 파트에서는 이러한 개념들이 어떻게 실제로 작용하며 이를 통해 Dark Mode가 사용자 인터페이스에서 어떻게 영향을 미치는지 더 살펴볼 예정입니다. 그동안 아래 댓글에 여러분의 생각과 Dark Mode에 대한 경험을 공유해 주시면 감사하겠습니다!","ogImage":{"url":"/assets/img/2024-05-16-BetweenScienceandMythsCouldDarkModeBecometheDefaultUserInterfaceSetting_0.png"},"coverImage":"/assets/img/2024-05-16-BetweenScienceandMythsCouldDarkModeBecometheDefaultUserInterfaceSetting_0.png","tag":["Tech"],"readingTime":2},{"title":"와일드플라워 원더풀 폰트","description":"","date":"2024-05-16 13:16","slug":"2024-05-16-WildflowerWonderfulFont","content":"\n\n🌟 와일드플라워 원더풀 폰트를 소개합니다! 이 매혹적인 산세리프 폰트로 여러분의 디자인을 한 단계 업그레이드해보세요. 지금 놓치지 마시고 무료로 다운로드하세요!\n\n와일드플라워 원더풀은 깔끔하고 아름다운 스타일의 간단한 산세리프 폰트입니다. 이 폰트는 패션 제품, 머그잔, 결혼 초대장, 홈 데코 디자인, 잡지 표지, 명언, 티셔츠, 선물 라벨, 로고, 웹 디자인, 브랜딩 등에 미니멀한 미학을 만들 때 완벽하게 어울립니다!\n\n## 호환성\n\n- Windows\n- Apple/Mac\n- Linux\n- 웹폰트로 쉽게 변환 가능\n- 크리컷\n- 실루엣\n- 다른 커팅 머신\n\n<div class=\"content-ad\"></div>\n\n## 설치:\n\n윈도우에서 글꼴 설치하기\n\n맥에서 글꼴 설치하기\n\n더 많은 설치 가이드 보기\n\n<div class=\"content-ad\"></div>\n\n## 이 폰트를 시도해 보세요\n\n와일드플라워 원더풀\n\n## 폭포\n\n## 모든 글리프 보기\n\n<div class=\"content-ad\"></div>\n\nWildflower Wonderful\n\n72pt\n\n48pt\n\n36pt\n\n<div class=\"content-ad\"></div>\n\n24pt\n\n18pt\n\n14pt\n\n개인 및 상업용 평생 라이선스입니다. 다중 사용자 라이선스가 필요하신가요?\n\n<div class=\"content-ad\"></div>\n\n## 이 글꼴을 무료로 다운로드하세요\n\n폰트 내용\n\n168,516가지 폰트 무제한 액세스\n\n매일 새로운 폰트 추가\n\n<div class=\"content-ad\"></div>\n\n10개의 다운로드를 100% 무료로 받아 가세요\n\n무료\n\n무료로 다운로드\n\n## 꼭 한번 확인해보세요\n\n<div class=\"content-ad\"></div>\n\n트레이싱 즐거움\n\n글꼴 안내\n\n프라임\n\n글꼴 내에서\n\n<div class=\"content-ad\"></div>\n\n수박 설탕\n\n글꼴에서\n\n멋진 자정\n\n글꼴에서\n\n<div class=\"content-ad\"></div>\n\n- 상업용 라이선스 포함\n- 모든 다운로드 및 구매에는 상업용 라이선스가 포함되어 있습니다. 라이선스에 대해 자세히 읽어보세요.\n- 프리미엄 기술 지원\n- 문제가 발생했나요? 우리는 모든 니즈에 맞는 전문 기술 지원을 제공하기 위해 여기 있어요.\n- 무제한 다운로드\n- 구매한 항목은 항상 온라인에서 이용 가능하며 무제한으로 다운로드할 수 있습니다.\n\n## Manlogs Studio\n\n프로필 보기\n\n## 168,516 폰트 다운로드\n\n<div class=\"content-ad\"></div>\n\n10개의 무료 제품을 다운로드하고 위험 없는 무료 평가판을 활성화하세요.\n\n무료 평가판 활성화\n\n**Wildflower Wonderful Glyphs**\n\n**The Quick Brown Fox**\n\n<div class=\"content-ad\"></div>\n\n## 숫자\n\n## 구두점\n\n## 저자의 더 많은 이야기\n\n그린하우스\n\n<div class=\"content-ad\"></div>\n\n폰트\n\n사프론\n\n폰트\n\n로사리오\n\n<div class=\"content-ad\"></div>\n\n폰트에 관한 글입니다\n\n툴루즈\n\n폰트에 관한 글입니다\n\n## 관련 주제\n\n<div class=\"content-ad\"></div>\n\n**글꼴**\n\n산세리프 글꼴\n\n심플한 글꼴\n\n미니멀한 글꼴\n\n<div class=\"content-ad\"></div>\n\n브랜딩 글꼴\n\n수공예 글꼴\n\n크리컷 글꼴\n\n웨딩 글꼴\n\n<div class=\"content-ad\"></div>\n\n**Procreate Font**\n\n**Social Media Font**\n\n**Luxury Font**\n\n**Fashion Font**\n\n<div class=\"content-ad\"></div>\n\n초대장 디자인\n\n인용구 디자인\n\n의류 디자인\n\n타이포그래피\n\n<div class=\"content-ad\"></div>\n\n로고\n\n팜하우스\n\n핸드레터드\n\n레터헤드\n\n<div class=\"content-ad\"></div>\n\n실루엣\n\n깨끗한\n\n헤드라인\n\n아름다운\n\n<div class=\"content-ad\"></div>\n\nBeauty\n\nFashion\n\nAesthetic\n\nAuthentic\n\n<div class=\"content-ad\"></div>\n\n야생화\n\n빈티지\n\n타입페이스","ogImage":{"url":"/assets/img/2024-05-16-WildflowerWonderfulFont_0.png"},"coverImage":"/assets/img/2024-05-16-WildflowerWonderfulFont_0.png","tag":["Tech"],"readingTime":3}],"page":"7","totalPageCount":13,"totalPageGroupCount":1,"lastPageGroup":13,"currentPageGroup":0},"__N_SSG":true}